jbgreer/Dotfiles/nix-darwin/result/sw/share/man/man5/configuration.nix.5
.TH "CONFIGURATION\&.NIX" "5" "01/01/1980" "Darwin" "Darwin Reference Pages"
.\" disable hyphenation
.nh
.\" disable justification (adjust text to left margin only)
.ad l
.\" enable line breaks after slashes
.cflags 4 /
.SH "NAME"
\fIconfiguration\&.nix\fP \- Darwin system configuration specification
.SH "DESCRIPTION"
.PP
The file \fIconfiguration\&.nix\fP contains the declarative specification of your Darwin system configuration\&. The command \fBdarwin\-rebuild\fP takes this file and realises the system configuration specified therein\&.
.SH "OPTIONS"
.PP
You can use the following options in \fIconfiguration\&.nix\fP\&.
.PP
\fB_module\&.args\fR
.RS 4
Additional arguments passed to each module in addition to ones like \fR\(oqlib\(cq\fP, \fR\(oqconfig\(cq\fP, and \fR\(oqpkgs\(cq\fP, \fR\(oqmodulesPath\(cq\fP\&.
.sp
This option is also available to all submodules\&. Submodules do not inherit args from their parent module, nor do they provide args to their parent module or sibling submodules\&. The sole exception to this is the argument \fR\(oqname\(cq\fP which is provided by parent modules to a submodule and contains the attribute name the submodule is bound to, or a unique generated name if it is not bound to an attribute\&.
.sp
Some arguments are already passed by default, of which the following \fIcannot\fR be changed with this option:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fIlib\fP: The nixpkgs library\&.
.RE
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fIconfig\fP: The results of all options after merging the values from all modules together\&.
.RE
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fIoptions\fP: The options declared in all modules\&.
.RE
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fIspecialArgs\fP: The \fR\(oqspecialArgs\(cq\fP argument passed to \fR\(oqevalModules\(cq\fP\&.
.RE
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
All attributes of \fIspecialArgs\fP
.sp
Whereas option values can generally depend on other option values thanks to laziness, this does not apply to \fR\(oqimports\(cq\fP, which must be computed statically before anything else\&.
.sp
For this reason, callers of the module system can provide \fR\(oqspecialArgs\(cq\fP which are available during import resolution\&.
.sp
For NixOS, \fR\(oqspecialArgs\(cq\fP includes \fImodulesPath\fP, which allows you to import extra modules from the nixpkgs package tree without having to somehow make the module aware of the location of the \fR\(oqnixpkgs\(cq\fP or NixOS directories\&.
.sp
.RS 4
.nf
{ modulesPath, \&.\&.\&. }: {
  imports = [
    (modulesPath + \(dq/profiles/minimal\&.nix\(dq)
  ];
}
.fi
.RE
.RE
.sp
For NixOS, the default value for this option includes at least this argument:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fIpkgs\fP: The nixpkgs package set according to the \fBnixpkgs\&.pkgs\fP option\&.
.RE
.sp
\fIType:\fR lazy attribute set of raw value
.sp
\fIDeclared by:\fP
.RS 4
\fB<nixpkgs/lib/modules\&.nix>\fP
.RE
.RE
.PP
\fBdocumentation\&.enable\fR
.RS 4
Whether to install documentation of packages from \fBenvironment\&.systemPackages\fP into the generated system path\&.
.sp
See \[u201C]Multiple\-output packages\[u201D] chapter in the nixpkgs manual for more info\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/documentation>\fP
.RE
.RE
.PP
\fBdocumentation\&.doc\&.enable\fR
.RS 4
Whether to install documentation distributed in packages\[u2019] \fR\(oq/share/doc\(cq\fP\&. Usually plain text and/or HTML\&. This also includes \[u201C]doc\[u201D] outputs\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/documentation>\fP
.RE
.RE
.PP
\fBdocumentation\&.info\&.enable\fR
.RS 4
Whether to install info pages and the \fBinfo\fP command\&. This also includes \[u201C]info\[u201D] outputs\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/documentation>\fP
.RE
.RE
.PP
\fBdocumentation\&.man\&.enable\fR
.RS 4
Whether to install manual pages and the \fBman\fP command\&. This also includes \[u201C]man\[u201D] outputs\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/documentation>\fP
.RE
.RE
.PP
\fBenvironment\&.darwinConfig\fR
.RS 4
The path of the darwin configuration\&.nix used to configure the system, this updates the default darwin\-config entry in NIX_PATH\&. Since this changes an environment variable it will only apply to new shells\&.
.sp
NOTE: Changing this requires running \fBdarwin\-rebuild switch \-I darwin\-config=/path/to/configuration\&.nix\fP the first time to make darwin\-rebuild aware of the custom location\&.
.sp
\fIType:\fR path or string
.sp
\fIDefault:\fR \(dq$HOME/\&.nixpkgs/darwin\-configuration\&.nix\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.etc\fR
.RS 4
Set of files that have to be linked in \fI/etc\fP\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/etc\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.etc\&.<name>\&.enable\fR
.RS 4
Whether this file should be generated\&. This option allows specific files to be disabled\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/etc\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.etc\&.<name>\&.source\fR
.RS 4
Path of the source file\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/etc\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.etc\&.<name>\&.target\fR
.RS 4
Name of symlink\&. Defaults to the attribute name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/etc\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.etc\&.<name>\&.text\fR
.RS 4
Text of the file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/etc\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.extraInit\fR
.RS 4
Shell script code called during global environment initialisation after all variables and profileVariables have been set\&. This code is asumed to be shell\-independent, which means you should stick to pure sh without sh word split\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.extraOutputsToInstall\fR
.RS 4
List of additional package outputs to be symlinked into \fI/run/current\-system/sw\fP\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqdoc\(dq
  \(dqinfo\(dq
  \(dqdevdoc\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.extraSetup\fR
.RS 4
Shell fragments to be run after the system environment has been created\&. This should only be used for things that need to modify the internals of the environment, e\&.g\&. generating MIME caches\&. The environment being built can be accessed at $out\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.interactiveShellInit\fR
.RS 4
Shell script code called during interactive shell initialisation\&. This code is asumed to be shell\-independent, which means you should stick to pure sh without sh word split\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.launchAgents\fR
.RS 4
Set of files that have to be linked in \fI/Library/LaunchAgents\fP\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchAgents\&.<name>\&.enable\fR
.RS 4
Whether this file should be generated\&. This option allows specific files to be disabled\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchAgents\&.<name>\&.source\fR
.RS 4
Path of the source file\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchAgents\&.<name>\&.target\fR
.RS 4
Name of symlink\&. Defaults to the attribute name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchAgents\&.<name>\&.text\fR
.RS 4
Text of the file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchDaemons\fR
.RS 4
Set of files that have to be linked in \fI/Library/LaunchDaemons\fP\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchDaemons\&.<name>\&.enable\fR
.RS 4
Whether this file should be generated\&. This option allows specific files to be disabled\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchDaemons\&.<name>\&.source\fR
.RS 4
Path of the source file\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchDaemons\&.<name>\&.target\fR
.RS 4
Name of symlink\&. Defaults to the attribute name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.launchDaemons\&.<name>\&.text\fR
.RS 4
Text of the file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.loginShell\fR
.RS 4
Configure default login shell\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq$SHELL \-l\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.loginShellInit\fR
.RS 4
Shell script code called during login shell initialisation\&. This code is asumed to be shell\-independent, which means you should stick to pure sh without sh word split\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.pathsToLink\fR
.RS 4
List of directories to be symlinked in \fI/run/current\-system/sw\fP\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq/share/doc\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.profiles\fR
.RS 4
A list of profiles used to setup the global environment\&.
.sp
\fIType:\fR list of string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.shellAliases\fR
.RS 4
An attribute set that maps aliases (the top level attribute names in this option) to command strings or directly to build outputs\&. The alises are added to all users\[u2019] shells\&.
.sp
\fIType:\fR attribute set of string
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  ll = \(dqls \-l\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.shellInit\fR
.RS 4
Shell script code called during shell initialisation\&. This code is asumed to be shell\-independent, which means you should stick to pure sh without sh word split\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.shells\fR
.RS 4
A list of permissible login shells for user accounts\&. No need to mention \fR\(oq/bin/sh\(cq\fP and other shells that are available by default on macOS\&.
.sp
\fIType:\fR list of (package or path)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ pkgs\&.bashInteractive pkgs\&.zsh ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/shells\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.systemPackages\fR
.RS 4
The set of packages that appear in /run/current\-system/sw\&. These packages are automatically available to all users, and are automatically updated every time you rebuild the system configuration\&. (The latter is the main difference with installing them in the default profile, \fI/nix/var/nix/profiles/default\fP\&.
.sp
\fIType:\fR list of package
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ pkgs\&.curl pkgs\&.vim ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.systemPath\fR
.RS 4
The set of paths that are added to PATH\&.
.sp
\fIType:\fR list of (path or string)
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBenvironment\&.userLaunchAgents\fR
.RS 4
Set of files that have to be linked in \fI\(ti/Library/LaunchAgents\fP\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.userLaunchAgents\&.<name>\&.enable\fR
.RS 4
Whether this file should be generated\&. This option allows specific files to be disabled\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.userLaunchAgents\&.<name>\&.source\fR
.RS 4
Path of the source file\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.userLaunchAgents\&.<name>\&.target\fR
.RS 4
Name of symlink\&. Defaults to the attribute name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.userLaunchAgents\&.<name>\&.text\fR
.RS 4
Text of the file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/launchd\&.nix>\fP
.RE
.RE
.PP
\fBenvironment\&.variables\fR
.RS 4
A set of environment variables used in the global environment\&. These variables will be set on shell initialisation\&. The value of each variable can be either a string or a list of strings\&. The latter is concatenated, interspersed with colon characters\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  EDITOR = \(dqvim\(dq;
  LANG = \(dqnl_NL\&.UTF\-8\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/environment>\fP
.RE
.RE
.PP
\fBfonts\&.packages\fR
.RS 4
List of fonts to install into \fI/Library/Fonts/Nix Fonts\fP\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ pkgs\&.dejavu_fonts ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/fonts>\fP
.RE
.RE
.PP
\fBhomebrew\&.enable\fR
.RS 4
Whether to enable \fBnix\-darwin\fP to manage installing/updating/upgrading Homebrew taps, formulae, and casks, as well as Mac App Store apps and Docker containers, using Homebrew Bundle\&.
.sp
Note that enabling this option does not install Homebrew, see the Homebrew \fBwebsite\fR[1]\fR for installation instructions\&.
.sp
Use the \fBhomebrew.brews\fR[2]\fR, \fBhomebrew.casks\fR[3]\fR, \fBhomebrew.masApps\fR[4]\fR, and \fBhomebrew.whalebrews\fR[5]\fR options to list the Homebrew formulae, casks, Mac App Store apps, and Docker containers you\[u2019]d like to install\&. Use the \fBhomebrew.taps\fR[6]\fR option, to make additional formula repositories available to Homebrew\&. This module uses those options (along with the \fBhomebrew.caskArgs\fR[7]\fR options) to generate a Brewfile that \fBnix\-darwin\fP passes to the \fBbrew bundle\fP command during system activation\&.
.sp
The default configuration of this module prevents Homebrew Bundle from auto\-updating Homebrew and all formulae, as well as upgrading anything that\[u2019]s already installed, so that repeated invocations of \fBdarwin\-rebuild switch\fP (without any change to the configuration) are idempotent\&. You can modify this behavior using the options under \fBhomebrew.onActivation\fR[8]\fR\&.
.sp
This module also provides a few options for modifying how Homebrew commands behave when you manually invoke them, under \fBhomebrew.global\fR[9]\fR\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://brew\&.sh
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
see the \fBhomebrew\&.brews\fP option
.RE
.RS 4
\h'-3'\fB3\&.\fP\h'1'\c
see the \fBhomebrew\&.casks\fP option
.RE
.RS 4
\h'-3'\fB4\&.\fP\h'1'\c
see the \fBhomebrew\&.masApps\fP option
.RE
.RS 4
\h'-3'\fB5\&.\fP\h'1'\c
see the \fBhomebrew\&.whalebrews\fP option
.RE
.RS 4
\h'-3'\fB6\&.\fP\h'1'\c
see the \fBhomebrew\&.taps\fP option
.RE
.RS 4
\h'-3'\fB7\&.\fP\h'1'\c
see the \fBhomebrew\&.caskArgs\fP option
.RE
.RS 4
\h'-3'\fB8\&.\fP\h'1'\c
see the \fBhomebrew\&.onActivation\fP option
.RE
.RS 4
\h'-3'\fB9\&.\fP\h'1'\c
see the \fBhomebrew\&.global\fP option
.RE
.RE
.PP
\fBhomebrew\&.brewPrefix\fR
.RS 4
The path prefix where the \fBbrew\fP executable is located\&. This will be set to the correct value based on your system\[u2019]s platform, and should only need to be changed if you manually installed Homebrew in a non\-standard location\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
if pkgs\&.stdenv\&.hostPlatform\&.isAarch64 then \(dq/opt/homebrew/bin\(dq
else \(dq/usr/local/bin\(dq
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.brews\fR
.RS 4
List of Homebrew formulae to install\&.
.sp
Formulae defined as strings, e\&.g\&., \fR\(oq\(dqimagemagick\(dq\(cq\fP, are a shorthand for:
.sp
\fR\(oq{ name = \(dqimagemagick\(dq; }\(cq\fP
.sp
\fIType:\fR list of ((submodule) or string convertible to it)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
# Adapted examples from https://github\&.com/Homebrew/homebrew\-bundle#usage
[
  # \(gabrew install\(ga
  \(dqimagemagick\(dq

  # \(gabrew install \-\-with\-rmtp\(ga, \(gabrew services restart\(ga on version changes
  {
    name = \(dqdenji/nginx/nginx\-full\(dq;
    args = [ \(dqwith\-rmtp\(dq ];
    restart_service = \(dqchanged\(dq;
  }

  # \(gabrew install\(ga, always \(gabrew services restart\(ga, \(gabrew link\(ga, \(gabrew unlink mysql\(ga (if it is installed)
  {
    name = \(dqmysql@5\&.6\(dq;
    restart_service = true;
    link = true;
    conflicts_with = [ \(dqmysql\(dq ];
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.brews\&.*\&.args\fR
.RS 4
Arguments flags to pass to \fBbrew install\fP\&. Values should not include the leading \fR\(oq\(dq\-\-\(dq\(cq\fP\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.brews\&.*\&.conflicts_with\fR
.RS 4
List of formulae that should be unlinked and their services stopped (if they are installed)\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.brews\&.*\&.link\fR
.RS 4
Whether to link the formula to the Homebrew prefix\&. When this option is \fR\(oqnull\(cq\fP, Homebrew will use it\[u2019]s default behavior which is to link the formula if it\[u2019]s currently unlinked and not keg\-only, and to unlink the formula if it\[u2019]s currently linked and keg\-only\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.brews\&.*\&.name\fR
.RS 4
The name of the formula to install\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.brews\&.*\&.restart_service\fR
.RS 4
Whether to run \fBbrew services restart\fP for the formula and register it to launch at login (or boot)\&. If set to \fR\(oq\(dqchanged\(dq\(cq\fP, the service will only be restarted on version changes\&.
.sp
Homebrew\[u2019]s default is \fR\(oqfalse\(cq\fP\&.
.sp
\fIType:\fR null or boolean or value \[u201C]changed\[u201D] (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.brews\&.*\&.start_service\fR
.RS 4
Whether to run \fBbrew services start\fP for the formula and register it to launch at login (or boot)\&.
.sp
Homebrew\[u2019]s default is \fR\(oqfalse\(cq\fP\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\fR
.RS 4
Arguments passed to \fBbrew install \-\-cask\fP for all casks listed in \fBhomebrew.casks\fR[1]\fR\&.
.sp
\fIType:\fR submodule
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  appdir = \(dq\(ti/Applications\(dq;
  require_sha = true;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.casks\fP option
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.appdir\fR
.RS 4
Target location for Applications\&.
.sp
Homebrew\[u2019]s default is \fI/Applications\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.audio_unit_plugindir\fR
.RS 4
Target location for Audio Unit Plugins\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Audio/Plug\-Ins/Components\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.colorpickerdir\fR
.RS 4
Target location for Color Pickers\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/ColorPickers\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.dictionarydir\fR
.RS 4
Target location for Dictionaries\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Dictionaries\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.fontdir\fR
.RS 4
Target location for Fonts\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Fonts\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.input_methoddir\fR
.RS 4
Target location for Input Methods\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Input Methods\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.internet_plugindir\fR
.RS 4
Target location for Internet Plugins\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Internet Plug\-Ins\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.language\fR
.RS 4
Comma\-separated list of language codes to prefer for cask installation\&. The first matching language is used, otherwise it reverts to the cask\[u2019]s default language\&. The default value is the language of your system\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqzh\-TW\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.mdimporterdir\fR
.RS 4
Target location for Spotlight Plugins\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Spotlight\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.no_binaries\fR
.RS 4
Whether to disable linking of helper executables\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.no_quarantine\fR
.RS 4
Whether to disable quarantining of downloads\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.prefpanedir\fR
.RS 4
Target location for Preference Panes\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/PreferencePanes\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.qlplugindir\fR
.RS 4
Target location for QuickLook Plugins\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/QuickLook\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.require_sha\fR
.RS 4
Whether to require cask(s) to have a checksum\&.
.sp
Homebrew\[u2019]s default is \fR\(oqfalse\(cq\fP\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.screen_saverdir\fR
.RS 4
Target location for Screen Savers\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Screen Savers\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.servicedir\fR
.RS 4
Target location for Services\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Services\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.vst3_plugindir\fR
.RS 4
Target location for VST3 Plugins\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Audio/Plug\-Ins/VST3\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.caskArgs\&.vst_plugindir\fR
.RS 4
Target location for VST Plugins\&.
.sp
Homebrew\[u2019]s default is \fI\(ti/Library/Audio/Plug\-Ins/VST\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.casks\fR
.RS 4
List of Homebrew casks to install\&.
.sp
Casks defined as strings, e\&.g\&., \fR\(oq\(dqgoogle\-chrome\(dq\(cq\fP, are a shorthand for:
.sp
\fR\(oq{ name = \(dqgoogle\-chrome\(dq; }\(cq\fP
.sp
\fIType:\fR list of ((submodule) or string convertible to it)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
# Adapted examples from https://github\&.com/Homebrew/homebrew\-bundle#usage
[
  # \(gabrew install \-\-cask\(ga
  \(dqgoogle\-chrome\(dq

  # \(gabrew install \-\-cask \-\-appdir=\(ti/my\-apps/Applications\(ga
  {
    name = \(dqfirefox\(dq;
    args = { appdir = \(dq\(ti/my\-apps/Applications\(dq; };
  }

  # always upgrade auto\-updated or unversioned cask to latest version even if already installed
  {
    name = \(dqopera\(dq;
    greedy = true;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.casks\&.*\&.args\fR
.RS 4
Arguments passed to \fBbrew install \-\-cask\fP when installing this cask\&. See \fBhomebrew.caskArgs\fR[1]\fR for the available options\&.
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.caskArgs\fP option
.RE
.RE
.PP
\fBhomebrew\&.casks\&.*\&.greedy\fR
.RS 4
Whether to always upgrade this cask regardless of whether it\[u2019]s unversioned or it updates itself\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.casks\&.*\&.name\fR
.RS 4
The name of the cask to install\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.extraConfig\fR
.RS 4
Extra lines to be added verbatim to the bottom of the generated Brewfile\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR
.sp
.RS 4
.nf
\(aq\(aq
  # \(aqbrew cask install\(aq only if \(aq/usr/libexec/java_home \-\-failfast\(aq fails
  cask \(dqjava\(dq unless system \(dq/usr/libexec/java_home \-\-failfast\(dq
\(aq\(aq
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.global\fR
.RS 4
Options for configuring the behavior of Homebrew commands when you manually invoke them\&.
.sp
\fIType:\fR submodule
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.global\&.autoUpdate\fR
.RS 4
Whether to enable Homebrew to auto\-update itself and all formulae when you manually invoke commands like \fBbrew install\fP, \fBbrew upgrade\fP, \fBbrew tap\fP, and \fBbrew bundle [install]\fP\&.
.sp
Note that Homebrew auto\-updates when you manually invoke commands like the ones mentioned above if it\[u2019]s been more then 5 minutes since it last updated\&.
.sp
You may want to consider disabling this option if you have \fBhomebrew.onActivation.upgrade\fR[1]\fR enabled, and \fBhomebrew.onActivation.autoUpdate\fR[2]\fR disabled, if you want to ensure that your installed formulae will only be upgraded during \fBnix\-darwin\fP system activation, after you\[u2019]ve explicitly run \fBbrew update\fP\&.
.sp
Implementation note: when disabled, this option sets the \fR\(oqHOMEBREW_NO_AUTO_UPDATE\(cq\fP environment variable, by adding it to \fBenvironment.variables\fR[3]\fR\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.onActivation\&.upgrade\fP option
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
see the \fBhomebrew\&.onActivation\&.autoUpdate\fP option
.RE
.RS 4
\h'-3'\fB3\&.\fP\h'1'\c
see the \fBenvironment\&.variables\fP option
.RE
.RE
.PP
\fBhomebrew\&.global\&.brewfile\fR
.RS 4
Whether to enable Homebrew to automatically use the Brewfile that this module generates in the Nix store, when you manually invoke \fBbrew bundle\fP\&.
.sp
Enabling this option will change the default value of \fBhomebrew.global.lockfiles\fR[1]\fR to \fR\(oqfalse\(cq\fP since, with this option enabled, \fBbrew bundle [install]\fP will default to using the Brewfile that this module generates in the Nix store, unless you explicitly point it at another Brewfile using the \fR\(oq\-\-file\(cq\fP flag\&. As a result, it will try to write the lockfile in the Nix store, and complain that it can\[u2019]t (though the command will run successfully regardless)\&.
.sp
Implementation note: when enabled, this option sets the \fR\(oqHOMEBREW_BUNDLE_FILE\(cq\fP environment variable to the path of the Brewfile that this module generates in the Nix store, by adding it to \fBenvironment.variables\fR[2]\fR\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.global\&.lockfiles\fP option
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
see the \fBenvironment\&.variables\fP option
.RE
.RE
.PP
\fBhomebrew\&.global\&.lockfiles\fR
.RS 4
Whether to enable Homebrew to generate lockfiles when you manually invoke \fBbrew bundle [install]\fP\&.
.sp
This option will default to \fR\(oqfalse\(cq\fP if \fBhomebrew.global.brewfile\fR[1]\fR is enabled since, with that option enabled, \fBbrew bundle [install]\fP will default to using the Brewfile that this module generates in the Nix store, unless you explicitly point it at another Brewfile using the \fR\(oq\-\-file\(cq\fP flag\&. As a result, it will try to write the lockfile in the Nix store, and complain that it can\[u2019]t (though the command will run successfully regardless)\&.
.sp
Implementation note: when disabled, this option sets the \fR\(oqHOMEBREW_BUNDLE_NO_LOCK\(cq\fP environment variable, by adding it to \fBenvironment.variables\fR[2]\fR\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR !config\&.homebrew\&.global\&.brewfile
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.global\&.brewfile\fP option
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
see the \fBenvironment\&.variables\fP option
.RE
.RE
.PP
\fBhomebrew\&.masApps\fR
.RS 4
Applications to install from Mac App Store using \fBmas\fP\&.
.sp
When this option is used, \fR\(oq\(dqmas\(dq\(cq\fP is automatically added to \fBhomebrew.brews\fR[1]\fR\&.
.sp
Note that you need to be signed into the Mac App Store for \fBmas\fP to successfully install and upgrade applications, and that unfortunately apps removed from this option will not be uninstalled automatically even if \fBhomebrew.onActivation.cleanup\fR[2]\fR is set to \fR\(oq\(dquninstall\(dq\(cq\fP or \fR\(oq\(dqzap\(dq\(cq\fP (this is currently a limitation of Homebrew Bundle)\&.
.sp
For more information on \fBmas\fP see: \fBgithub\&.com/mas\-cli/mas\fR[3]\fR\&.
.sp
\fIType:\fR attribute set of (positive integer, meaning >0)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dq1Password for Safari\(dq = 1569813296;
  Xcode = 497799835;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.brews\fP option
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
see the \fBhomebrew\&.onActivation\&.cleanup\fP option
.RE
.RS 4
\h'-3'\fB3\&.\fP\h'1'\c
https://github\&.com/mas\-cli/mas
.RE
.RE
.PP
\fBhomebrew\&.onActivation\fR
.RS 4
Options for configuring the behavior of the \fBbrew bundle\fP command that \fBnix\-darwin\fP runs during system activation\&.
.sp
\fIType:\fR submodule
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.onActivation\&.autoUpdate\fR
.RS 4
Whether to enable Homebrew to auto\-update itself and all formulae during \fBnix\-darwin\fP system activation\&. The default is \fR\(oqfalse\(cq\fP so that repeated invocations of \fBdarwin\-rebuild switch\fP are idempotent\&.
.sp
Note that Homebrew auto\-updates when it\[u2019]s been more then 5 minutes since it last updated\&.
.sp
Although auto\-updating is disabled by default during system activation, note that Homebrew will auto\-update when you manually invoke certain Homebrew commands\&. To modify this behavior see \fBhomebrew.global.autoUpdate\fR[1]\fR\&.
.sp
Implementation note: when disabled, this option sets the \fR\(oqHOMEBREW_NO_AUTO_UPDATE\(cq\fP environment variable when \fBnix\-darwin\fP invokes \fBbrew bundle [install]\fP during system activation\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.global\&.autoUpdate\fP option
.RE
.RE
.PP
\fBhomebrew\&.onActivation\&.cleanup\fR
.RS 4
This option manages what happens to formulae installed by Homebrew, that aren\[u2019]t present in the Brewfile generated by this module, during \fBnix\-darwin\fP system activation\&.
.sp
When set to \fR\(oq\(dqnone\(dq\(cq\fP (the default), formulae not present in the generated Brewfile are left installed\&.
.sp
When set to \fR\(oq\(dquninstall\(dq\(cq\fP, \fBnix\-darwin\fP invokes \fBbrew bundle [install]\fP with the \fB\-\-cleanup\fP flag\&. This uninstalls all formulae not listed in generated Brewfile, i\&.e\&., \fBbrew uninstall\fP is run for those formulae\&.
.sp
When set to \fR\(oq\(dqzap\(dq\(cq\fP, \fBnix\-darwin\fP invokes \fBbrew bundle [install]\fP with the \fB\-\-cleanup \-\-zap\fP flags\&. This uninstalls all formulae not listed in the generated Brewfile, and if the formula is a cask, removes all files associated with that cask\&. In other words, \fBbrew uninstall \-\-zap\fP is run for all those formulae\&.
.sp
If you plan on exclusively using \fBnix\-darwin\fP to manage formulae installed by Homebrew, you probably want to set this option to \fR\(oq\(dquninstall\(dq\(cq\fP or \fR\(oq\(dqzap\(dq\(cq\fP\&.
.sp
\fIType:\fR one of \[u201C]none\[u201D], \[u201C]uninstall\[u201D], \[u201C]zap\[u201D]
.sp
\fIDefault:\fR \(dqnone\(dq
.sp
\fIExample:\fR \(dquninstall\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.onActivation\&.extraFlags\fR
.RS 4
Extra flags to pass to \fBbrew bundle [install]\fP during \fBnix\-darwin\fP system activation\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq\-\-verbose\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.onActivation\&.upgrade\fR
.RS 4
Whether to enable Homebrew to upgrade outdated formulae and Mac App Store apps during \fBnix\-darwin\fP system activation\&. The default is \fR\(oqfalse\(cq\fP so that repeated invocations of \fBdarwin\-rebuild switch\fP are idempotent\&.
.sp
Implementation note: when disabled, \fBnix\-darwin\fP invokes \fBbrew bundle [install]\fP with the \fB\-\-no\-upgrade\fP flag during system activation\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.taps\fR
.RS 4
List of Homebrew formula repositories to tap\&.
.sp
Taps defined as strings, e\&.g\&., \fR\(oq\(dquser/repo\(dq\(cq\fP, are a shorthand for:
.sp
\fR\(oq{ name = \(dquser/repo\(dq; }\(cq\fP
.sp
\fIType:\fR list of ((submodule) or string convertible to it)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
# Adapted examples from https://github\&.com/Homebrew/homebrew\-bundle#usage
[
  # \(gabrew tap\(ga
  \(dqhomebrew/cask\(dq

  # \(gabrew tap\(ga with custom Git URL and arguments
  {
    name = \(dquser/tap\-repo\(dq;
    clone_target = \(dqhttps://user@bitbucket\&.org/user/homebrew\-tap\-repo\&.git\(dq;
    force_auto_update = true;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.taps\&.*\&.clone_target\fR
.RS 4
Use this option to tap a formula repository from anywhere, using any transport protocol that \fBgit\fP handles\&. When \fBclone_target\fP is specified, taps can be cloned from places other than GitHub and using protocols other than HTTPS, e\&.g\&., SSH, git, HTTP, FTP(S), rsync\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.taps\&.*\&.force_auto_update\fR
.RS 4
Whether to auto\-update the tap even if it is not hosted on GitHub\&. By default, only taps hosted on GitHub are auto\-updated (for performance reasons)\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.taps\&.*\&.name\fR
.RS 4
When \fBclone_target\fP is unspecified, this is the name of a formula repository to tap from GitHub using HTTPS\&. For example, \fR\(oq\(dquser/repo\(dq\(cq\fP will tap https://github\&.com/user/homebrew\-repo\&.
.sp
\fIType:\fR string
.sp
\fIExample:\fR \(dqhomebrew/cask\-fonts\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.RE
.PP
\fBhomebrew\&.whalebrews\fR
.RS 4
List of Docker images to install using \fBwhalebrew\fP\&.
.sp
When this option is used, \fR\(oq\(dqwhalebrew\(dq\(cq\fP is automatically added to \fBhomebrew.brews\fR[1]\fR\&.
.sp
For more information on \fBwhalebrew\fP see: \fBgithub\&.com/whalebrew/whalebrew\fR[2]\fR\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqwhalebrew/wget\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/homebrew\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBhomebrew\&.brews\fP option
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
https://github\&.com/whalebrew/whalebrew
.RE
.RE
.PP
\fBlaunchd\&.agents\fR
.RS 4
Definition of per\-user launchd agents\&.
.sp
When a user logs in, a per\-user launchd is started\&. It does the following:
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
It loads the parameters for each launch\-on\-demand user agent from the property list files found in /System/Library/LaunchAgents, /Library/LaunchAgents, and the user\[u2019]s individual Library/LaunchAgents directory\&.
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
It registers the sockets and file descriptors requested by those user agents\&.
.RE
.RS 4
\h'-3'\fB3\&.\fP\h'1'\c
It launches any user agents that requested to be running all the time\&.
.RE
.RS 4
\h'-3'\fB4\&.\fP\h'1'\c
As requests for a particular service arrive, it launches the corresponding user agent and passes the request to it\&.
.RE
.RS 4
\h'-3'\fB5\&.\fP\h'1'\c
When the user logs out, it sends a SIGTERM signal to all of the user agents that it started\&.
.RE
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.command\fR
.RS 4
Command executed as the service\[u2019]s main process\&.
.sp
\fIType:\fR string or path
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.environment\fR
.RS 4
Environment variables passed to the service\[u2019]s processes\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  LANG = \(dqnl_NL\&.UTF\-8\(dq;
  PATH = \(dq/foo/bar/bin\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.path\fR
.RS 4
Packages added to the service\[u2019]s \fBPATH\fP environment variable\&. Only the \fIbin\fP and subdirectories of each package is added\&.
.sp
\fIType:\fR list of (path or string)
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.script\fR
.RS 4
Shell commands executed as the service\[u2019]s main process\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\fR
.RS 4
Each attribute in this set specifies an option for a key in the plist\&. \fBhttps://developer\&.apple\&.com/legacy/library/documentation/Darwin/Reference/ManPages/man5/launchd\&.plist\&.5\&.html\fR[1]\fR
.sp
\fIType:\fR submodule
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  KeepAlive = true;
  Program = \(dq/run/current\-system/sw/bin/nix\-daemon\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://developer\&.apple\&.com/legacy/library/documentation/Darwin/Reference/ManPages/man5/launchd\&.plist\&.5\&.html
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.AbandonProcessGroup\fR
.RS 4
When a job dies, launchd kills any remaining processes with the same process group ID as the job\&. Setting this key to true disables that behavior\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Debug\fR
.RS 4
This optional key specifies that launchd should adjust its log mask temporarily to LOG_DEBUG while dealing with this job\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Disabled\fR
.RS 4
This optional key is used as a hint to \fR\(oqlaunchctl(1)\(cq\fP that it should not submit this job to launchd when loading a job or jobs\&. The value of this key does NOT reflect the current state of the job on the running system\&. If you wish to know whether a job is loaded in launchd, reading this key from a configuration file yourself is not a sufficient test\&. You should query launchd for the presence of the job using the \fR\(oqlaunchctl(1)\(cq\fP list subcommand or use the ServiceManagement framework\[u2019]s \fR\(oqSMJobCopyDictionary()\(cq\fP method\&.
.sp
Note that as of Mac OS X v10\&.6, this key\[u2019]s value in a configuration file conveys a default value, which is changed with the [\-w] option of the \fR\(oqlaunchctl(1)\(cq\fP load and unload subcommands\&. These subcommands no longer modify the configuration file, so the value displayed in the configuration file is not necessarily the value that \fR\(oqlaunchctl(1)\(cq\fP will apply\&. See \fR\(oqlaunchctl(1)\(cq\fP for more information\&.
.sp
Please also be mindful that you should only use this key if the provided on\-demand and KeepAlive criteria are insufficient to describe the conditions under which your job needs to run\&. The cost to have a job loaded in launchd is negligible, so there is no harm in loading a job which only runs once or very rarely\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.EnableGlobbing\fR
.RS 4
This flag causes launchd to use the \fR\(oqglob(3)\(cq\fP mechanism to update the program arguments before invocation\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.EnableTransactions\fR
.RS 4
This flag instructs launchd that the job promises to use \fR\(oqvproc_transaction_begin(3)\(cq\fP and \fR\(oqvproc_transaction_end(3)\(cq\fP to track outstanding transactions that need to be reconciled before the process can safely terminate\&. If no outstanding transactions are in progress, then launchd is free to send the SIGKILL signal\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.EnvironmentVariables\fR
.RS 4
This optional key is used to specify additional environment variables to be set before running the job\&.
.sp
\fIType:\fR null or (attribute set of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.ExitTimeOut\fR
.RS 4
The amount of time launchd waits before sending a SIGKILL signal\&. The default value is 20 seconds\&. The value zero is interpreted as infinity\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.GroupName\fR
.RS 4
This optional key specifies the group to run the job as\&. This key is only applicable when launchd is running as root\&. If UserName is set and GroupName is not, the the group will be set to the default group of the user\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\fR
.RS 4
Resource limits to be imposed on the job\&. These adjust variables set with \fR\(oqsetrlimit(2)\(cq\fP\&. The following keys apply:
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  NumberOfFiles = 4096;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.CPU\fR
.RS 4
The maximum amount of cpu time (in seconds) to be used by each process\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Core\fR
.RS 4
The largest size (in bytes) core file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Data\fR
.RS 4
The maximum size (in bytes) of the data segment for a process; this defines how far a program may extend its break with the \fR\(oqsbrk(2)\(cq\fP system call\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.FileSize\fR
.RS 4
The largest size (in bytes) file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.MemoryLock\fR
.RS 4
The maximum size (in bytes) which a process may lock into memory using the \fR\(oqmlock(2)\(cq\fP function\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.NumberOfFiles\fR
.RS 4
The maximum number of open files for this process\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxfiles (SoftResourceLimits) or kern\&.maxfilesperproc (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.NumberOfProcesses\fR
.RS 4
The maximum number of simultaneous processes for this user id\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxproc (SoftResourceLimits) or kern\&.maxprocperuid (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.ResidentSetSize\fR
.RS 4
The maximum size (in bytes) to which a process\[u2019]s resident set size may grow\&. This imposes a limit on the amount of physical memory to be given to a process; if memory is tight, the system will prefer to take memory from processes that are exceeding their declared resident set size\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Stack\fR
.RS 4
The maximum size (in bytes) of the stack segment for a process; this defines how far a program\[u2019]s stack segment may be extended\&. Stack extension is performed automatically by the system\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.InitGroups\fR
.RS 4
This optional key specifies whether \fR\(oqinitgroups(3)\(cq\fP should be called before running the job\&. The default is true in 10\&.5 and false in 10\&.4\&. This key will be ignored if the UserName key is not set\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.KeepAlive\fR
.RS 4
This optional key is used to control whether your job is to be kept continuously running or to let demand and conditions control the invocation\&. The default is false and therefore only demand will start the job\&. The value may be set to true to unconditionally keep the job alive\&. Alternatively, a dictionary of conditions may be specified to selectively control whether launchd keeps a job alive or not\&. If multiple keys are provided, launchd ORs them, thus providing maximum flexibility to the job to refine the logic and stall if necessary\&. If launchd finds no reason to restart the job, it falls back on demand based invocation\&. Jobs that exit quickly and frequently when configured to be kept alive will be throttled to converve system resources\&.
.sp
\fIType:\fR null or boolean or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Label\fR
.RS 4
This required key uniquely identifies the job to launchd\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.LaunchEvents\fR
.RS 4
Specifies higher\-level event types to be used as launch\-on\-demand event sources\&. Each sub\-dictionary defines events for a particular event subsystem, such as \[u201C]com\&.apple\&.iokit\&.matching\[u201D], which can be used to launch jobs based on the appearance of nodes in the IORegistry\&. Each dictionary within the sub\-dictionary specifies an event descriptor that is specified to each event subsystem\&. With this key, the job promises to use the xpc_set_event_stream_handler(3) API to consume events\&. See xpc_events(3) for more details on event sources\&.
.sp
\fIType:\fR null or (attribute set)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dqcom\&.apple\&.iokit\&.matching\(dq = {
    \(dqcom\&.apple\&.usb\&.device\(dq = {
      IOMatchLaunchStream = true;
      IOProviderClass = \(dqIOUSBDevice\(dq;
      idProduct = \(dq*\(dq;
      idVendor = \(dq*\(dq;
    };
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.LaunchOnlyOnce\fR
.RS 4
This optional key specifies whether the job can only be run once and only once\&. In other words, if the job cannot be safely respawned without a full machine reboot, then set this key to be true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.LimitLoadFromHosts\fR
.RS 4
This configuration file only applies to hosts NOT listed with this key\&. Note: One should set kern\&.hostname in \fR\(oqsysctl\&.conf(5)\(cq\fP for this feature to work reliably\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.LimitLoadToHosts\fR
.RS 4
This configuration file only applies to the hosts listed with this key\&. Note: One should set kern\&.hostname in \fR\(oqsysctl\&.conf(5)\(cq\fP for this feature to work reliably\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.LimitLoadToSessionType\fR
.RS 4
This configuration file only applies to sessions of the type specified\&. This key is used in concert with the \-S flag to \fBlaunchctl\fP\&.
.sp
\fIType:\fR null or string or list of string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.LowPriorityBackgroundIO\fR
.RS 4
This optional key specifies whether the kernel should consider this daemon to be low priority when doing file system I/O when the process is throttled with the Darwin\-background classification\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.LowPriorityIO\fR
.RS 4
This optional key specifies whether the kernel should consider this daemon to be low priority when doing file system I/O\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.MachServices\fR
.RS 4
This optional key is used to specify Mach services to be registered with the Mach bootstrap sub\-system\&. Each key in this dictionary should be the name of service to be advertised\&. The value of the key must be a boolean and set to true\&. Alternatively, a dictionary can be used instead of a simple true value\&.
.sp
Finally, for the job itself, the values will be replaced with Mach ports at the time of check\-in with launchd\&.
.sp
\fIType:\fR null or (attribute set of (boolean or (submodule)))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dqorg\&.nixos\&.service\(dq = {
    ResetAtClose = true;
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Nice\fR
.RS 4
This optional key specifies what nice(3) value should be applied to the daemon\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.OnDemand\fR
.RS 4
This key was used in Mac OS X 10\&.4 to control whether a job was kept alive or not\&. The default was true\&. This key has been deprecated and replaced in Mac OS X 10\&.5 and later with the more powerful KeepAlive option\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.ProcessType\fR
.RS 4
This optional key describes, at a high level, the intended purpose of the job\&. The system will apply resource limits based on what kind of job it is\&. If left unspecified, the system will apply light resource limits to the job, throttling its CPU usage and I/O bandwidth\&. The following are valid values:
.RS 4
.PP
Background
.RS 4
Background jobs are generally processes that do work that was not directly requested by the user\&. The resource limits applied to Background jobs are intended to prevent them from disrupting the user experience\&.
.RE
.PP
Standard
.RS 4
Standard jobs are equivalent to no ProcessType being set\&.
.RE
.PP
Adaptive
.RS 4
Adaptive jobs move between the Background and Interactive classifications based on activity over XPC connections\&. See \fR\(oqxpc_transaction_begin(3)\(cq\fP for details\&.
.RE
.PP
Interactive
.RS 4
Interactive jobs run with the same resource limitations as apps, that is to say, none\&. Interactive jobs are critical to maintaining a responsive user experience, and this key should only be used if an app\[u2019]s ability to be responsive depends on it, and cannot be made Adaptive\&.
.RE
.RE
.sp
\fIType:\fR null or one of \[u201C]Background\[u201D], \[u201C]Standard\[u201D], \[u201C]Adaptive\[u201D], \[u201C]Interactive\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqBackground\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Program\fR
.RS 4
This key maps to the first argument of \fR\(oqexecvp(3)\(cq\fP\&. If this key is missing, then the first element of the array of strings provided to the ProgramArguments will be used instead\&. This key is required in the absence of the ProgramArguments key\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.ProgramArguments\fR
.RS 4
This key maps to the second argument of \fR\(oqexecvp(3)\(cq\fP\&. This key is required in the absence of the Program key\&. Please note: many people are confused by this key\&. Please read \fR\(oqexecvp(3)\(cq\fP very carefully!
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.QueueDirectories\fR
.RS 4
Much like the WatchPaths option, this key will watch the paths for modifications\&. The difference being that the job will only be started if the path is a directory and the directory is not empty\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.RootDirectory\fR
.RS 4
This optional key is used to specify a directory to \fR\(oqchroot(2)\(cq\fP to before running the job\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.RunAtLoad\fR
.RS 4
This optional key is used to control whether your job is launched once at the time the job is loaded\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.ServiceIPC\fR
.RS 4
This optional key specifies whether the job participates in advanced communication with launchd\&. The default is false\&. This flag is incompatible with the inetdCompatibility key\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SessionCreate\fR
.RS 4
This key specifies that the job should be spawned into a new security audit session rather than the default session for the context is belongs to\&. See auditon(2) for details\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\fR
.RS 4
This optional key is used to specify launch on demand sockets that can be used to let launchd know when to run the job\&. The job must check\-in to get a copy of the file descriptors using APIs outlined in launch(3)\&. The keys of the top level Sockets dictionary can be anything\&. They are meant for the application developer to use to differentiate which descriptors correspond to which application level protocols (e\&.g\&. http vs\&. ftp vs\&. DNS\[u2026])\&. At check\-in time, the value of each Sockets dictionary key will be an array of descriptors\&. Daemon/Agent writers should consider all descriptors of a given key to be to be effectively equivalent, even though each file descriptor likely represents a different networking protocol which conforms to the criteria specified in the job configuration file\&.
.sp
The parameters below are used as inputs to call \fR\(oqgetaddrinfo(3)\(cq\fP\&.
.sp
\fIType:\fR null or (attribute set of (submodule))
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.Bonjour\fR
.RS 4
This optional key can be used to request that the service be registered with the \fR\(oqmDNSResponder(8)\(cq\fP\&. If the value is boolean, the service name is inferred from the SockServiceName\&.
.sp
\fIType:\fR null or boolean or list of string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.MulticastGroup\fR
.RS 4
This optional key can be used to request that the datagram socket join a multicast group\&. If the value is a hostname, then \fR\(oqgetaddrinfo(3)\(cq\fP will be used to join the correct multicast address for a given socket family\&. If an explicit IPv4 or IPv6 address is given, it is required that the SockFamily family also be set, otherwise the results are undefined\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SecureSocketWithKey\fR
.RS 4
This optional key is a variant of SockPathName\&. Instead of binding to a known path, a securely generated socket is created and the path is assigned to the environment variable that is inherited by all jobs spawned by launchd\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockFamily\fR
.RS 4
This optional key can be used to specifically request that \[u201C]IPv4\[u201D] or \[u201C]IPv6\[u201D] socket(s) be created\&.
.sp
\fIType:\fR null or one of \[u201C]IPv4\[u201D], \[u201C]IPv6\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockNodeName\fR
.RS 4
This optional key specifies the node to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPassive\fR
.RS 4
This optional key specifies whether \fR\(oqlisten(2)\(cq\fP or \fR\(oqconnect(2)\(cq\fP should be called on the created file descriptor\&. The default is true (\[u201C]to listen\[u201D])\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPathMode\fR
.RS 4
This optional key specifies the mode of the socket\&. Known bug: Property lists don\[u2019]t support octal, so please convert the value to decimal\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPathName\fR
.RS 4
This optional key implies SockFamily is set to \[u201C]Unix\[u201D]\&. It specifies the path to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockProtocol\fR
.RS 4
This optional key specifies the protocol to be passed to \fR\(oqsocket(2)\(cq\fP\&. The only value understood by this key at the moment is \[u201C]TCP\[u201D]\&.
.sp
\fIType:\fR null or value \[u201C]TCP\[u201D] (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockServiceName\fR
.RS 4
This optional key specifies the service on the node to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockType\fR
.RS 4
This optional key tells launchctl what type of socket to create\&. The default is \[u201C]stream\[u201D] and other valid values for this key are \[u201C]dgram\[u201D] and \[u201C]seqpacket\[u201D] respectively\&.
.sp
\fIType:\fR null or one of \[u201C]stream\[u201D], \[u201C]dgram\[u201D], \[u201C]seqpacket\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\fR
.RS 4
Resource limits to be imposed on the job\&. These adjust variables set with \fR\(oqsetrlimit(2)\(cq\fP\&. The following keys apply:
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.CPU\fR
.RS 4
The maximum amount of cpu time (in seconds) to be used by each process\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Core\fR
.RS 4
The largest size (in bytes) core file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Data\fR
.RS 4
The maximum size (in bytes) of the data segment for a process; this defines how far a program may extend its break with the \fR\(oqsbrk(2)\(cq\fP system call\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.FileSize\fR
.RS 4
The largest size (in bytes) file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.MemoryLock\fR
.RS 4
The maximum size (in bytes) which a process may lock into memory using the mlock(2) function\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.NumberOfFiles\fR
.RS 4
The maximum number of open files for this process\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxfiles (SoftResourceLimits) or kern\&.maxfilesperproc (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.NumberOfProcesses\fR
.RS 4
The maximum number of simultaneous processes for this user id\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxproc (SoftResourceLimits) or kern\&.maxprocperuid (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.ResidentSetSize\fR
.RS 4
The maximum size (in bytes) to which a process\[u2019]s resident set size may grow\&. This imposes a limit on the amount of physical memory to be given to a process; if memory is tight, the system will prefer to take memory from processes that are exceeding their declared resident set size\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Stack\fR
.RS 4
The maximum size (in bytes) of the stack segment for a process; this defines how far a program\[u2019]s stack segment may be extended\&. Stack extension is performed automatically by the system\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.StandardErrorPath\fR
.RS 4
This optional key specifies what file should be used for data being sent to stderr when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.StandardInPath\fR
.RS 4
This optional key specifies what file should be used for data being supplied to stdin when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.StandardOutPath\fR
.RS 4
This optional key specifies what file should be used for data being sent to stdout when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.StartCalendarInterval\fR
.RS 4
This optional key causes the job to be started every calendar interval as specified\&. The semantics are much like \fBcrontab\fP\fR(5)\fP: Missing attributes are considered to be wildcard\&. Unlike cron which skips job invocations when the computer is asleep, launchd will start the job the next time the computer wakes up\&. If multiple intervals transpire before the computer is woken, those events will be coalesced into one event upon waking from sleep\&.
.sp
.RS 4
\fBImportant\fP
.br
The list must not be empty and must not contain duplicate entries (attrsets which compare equally)\&.
.RE
.sp
.RS 4
\fBCaution\fP
.br
Since missing attrs become wildcards, an empty attrset effectively means \[u201C]every minute\[u201D]\&.
.RE
.sp
\fIType:\fR null or (submodule) or unique (non\-empty (list of (submodule)))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  {
    Hour = 2;
    Minute = 30;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.StartInterval\fR
.RS 4
This optional key causes the job to be started every N seconds\&. If the system is asleep, the job will be started the next time the computer wakes up\&. If multiple intervals transpire before the computer is woken, those events will be coalesced into one event upon wake from sleep\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.StartOnMount\fR
.RS 4
This optional key causes the job to be started every time a filesystem is mounted\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.ThrottleInterval\fR
.RS 4
This key lets one override the default throttling policy imposed on jobs by launchd\&. The value is in seconds, and by default, jobs will not be spawned more than once every 10 seconds\&. The principle behind this is that jobs should linger around just in case they are needed again in the near future\&. This not only reduces the latency of responses, but it encourages developers to amortize the cost of program invocation\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.TimeOut\fR
.RS 4
The recommended idle time out (in seconds) to pass to the job\&. If no value is specified, a default time out will be supplied by launchd for use by the job at check in time\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.Umask\fR
.RS 4
This optional key specifies what value should be passed to \fR\(oqumask(2)\(cq\fP before running the job\&. Known bug: Property lists don\[u2019]t support octal, so please convert the value to decimal\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.UserName\fR
.RS 4
This optional key specifies the user to run the job as\&. This key is only applicable when launchd is running as root\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.WaitForDebugger\fR
.RS 4
This optional key specifies that launchd should instruct the kernel to have the job wait for a debugger to attach before any code in the job is executed\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.WatchPaths\fR
.RS 4
This optional key causes the job to be started if any one of the listed paths are modified\&.
.sp
\fIType:\fR null or (list of path)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.WorkingDirectory\fR
.RS 4
This optional key is used to specify a directory to \fR\(oqchdir(2)\(cq\fP to before running the job\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.inetdCompatibility\fR
.RS 4
The presence of this key specifies that the daemon expects to be run as if it were launched from inetd\&.
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  Wait = true;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.agents\&.<name>\&.serviceConfig\&.inetdCompatibility\&.Wait\fR
.RS 4
This flag corresponds to the \[u201C]wait\[u201D] or \[u201C]nowait\[u201D] option of inetd\&. If true, then the listening socket is passed via the standard in/out/error file descriptors\&. If false, then \fR\(oqaccept(2)\(cq\fP is called on behalf of the job, and the result is passed via the standard in/out/error descriptors\&.
.sp
\fIType:\fR null or boolean or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\fR
.RS 4
Definition of launchd daemons\&.
.sp
After the system is booted and the kernel is running, launchd is run to finish the system initialization\&. As part of that initialization, it goes through the following steps:
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
It loads the parameters for each launch\-on\-demand system\-level daemon from the property list files found in /System/Library/LaunchDaemons/ and /Library/LaunchDaemons/\&.
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
It registers the sockets and file descriptors requested by those daemons\&.
.RE
.RS 4
\h'-3'\fB3\&.\fP\h'1'\c
It launches any daemons that requested to be running all the time\&.
.RE
.RS 4
\h'-3'\fB4\&.\fP\h'1'\c
As requests for a particular service arrive, it launches the corresponding daemon and passes the request to it\&.
.RE
.RS 4
\h'-3'\fB5\&.\fP\h'1'\c
When the system shuts down, it sends a SIGTERM signal to all of the daemons that it started\&.
.RE
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.command\fR
.RS 4
Command executed as the service\[u2019]s main process\&.
.sp
\fIType:\fR string or path
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.environment\fR
.RS 4
Environment variables passed to the service\[u2019]s processes\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  LANG = \(dqnl_NL\&.UTF\-8\(dq;
  PATH = \(dq/foo/bar/bin\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.path\fR
.RS 4
Packages added to the service\[u2019]s \fBPATH\fP environment variable\&. Only the \fIbin\fP and subdirectories of each package is added\&.
.sp
\fIType:\fR list of (path or string)
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.script\fR
.RS 4
Shell commands executed as the service\[u2019]s main process\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\fR
.RS 4
Each attribute in this set specifies an option for a key in the plist\&. \fBhttps://developer\&.apple\&.com/legacy/library/documentation/Darwin/Reference/ManPages/man5/launchd\&.plist\&.5\&.html\fR[1]\fR
.sp
\fIType:\fR submodule
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  KeepAlive = true;
  Program = \(dq/run/current\-system/sw/bin/nix\-daemon\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://developer\&.apple\&.com/legacy/library/documentation/Darwin/Reference/ManPages/man5/launchd\&.plist\&.5\&.html
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.AbandonProcessGroup\fR
.RS 4
When a job dies, launchd kills any remaining processes with the same process group ID as the job\&. Setting this key to true disables that behavior\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Debug\fR
.RS 4
This optional key specifies that launchd should adjust its log mask temporarily to LOG_DEBUG while dealing with this job\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Disabled\fR
.RS 4
This optional key is used as a hint to \fR\(oqlaunchctl(1)\(cq\fP that it should not submit this job to launchd when loading a job or jobs\&. The value of this key does NOT reflect the current state of the job on the running system\&. If you wish to know whether a job is loaded in launchd, reading this key from a configuration file yourself is not a sufficient test\&. You should query launchd for the presence of the job using the \fR\(oqlaunchctl(1)\(cq\fP list subcommand or use the ServiceManagement framework\[u2019]s \fR\(oqSMJobCopyDictionary()\(cq\fP method\&.
.sp
Note that as of Mac OS X v10\&.6, this key\[u2019]s value in a configuration file conveys a default value, which is changed with the [\-w] option of the \fR\(oqlaunchctl(1)\(cq\fP load and unload subcommands\&. These subcommands no longer modify the configuration file, so the value displayed in the configuration file is not necessarily the value that \fR\(oqlaunchctl(1)\(cq\fP will apply\&. See \fR\(oqlaunchctl(1)\(cq\fP for more information\&.
.sp
Please also be mindful that you should only use this key if the provided on\-demand and KeepAlive criteria are insufficient to describe the conditions under which your job needs to run\&. The cost to have a job loaded in launchd is negligible, so there is no harm in loading a job which only runs once or very rarely\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.EnableGlobbing\fR
.RS 4
This flag causes launchd to use the \fR\(oqglob(3)\(cq\fP mechanism to update the program arguments before invocation\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.EnableTransactions\fR
.RS 4
This flag instructs launchd that the job promises to use \fR\(oqvproc_transaction_begin(3)\(cq\fP and \fR\(oqvproc_transaction_end(3)\(cq\fP to track outstanding transactions that need to be reconciled before the process can safely terminate\&. If no outstanding transactions are in progress, then launchd is free to send the SIGKILL signal\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.EnvironmentVariables\fR
.RS 4
This optional key is used to specify additional environment variables to be set before running the job\&.
.sp
\fIType:\fR null or (attribute set of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.ExitTimeOut\fR
.RS 4
The amount of time launchd waits before sending a SIGKILL signal\&. The default value is 20 seconds\&. The value zero is interpreted as infinity\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.GroupName\fR
.RS 4
This optional key specifies the group to run the job as\&. This key is only applicable when launchd is running as root\&. If UserName is set and GroupName is not, the the group will be set to the default group of the user\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\fR
.RS 4
Resource limits to be imposed on the job\&. These adjust variables set with \fR\(oqsetrlimit(2)\(cq\fP\&. The following keys apply:
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  NumberOfFiles = 4096;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.CPU\fR
.RS 4
The maximum amount of cpu time (in seconds) to be used by each process\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Core\fR
.RS 4
The largest size (in bytes) core file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Data\fR
.RS 4
The maximum size (in bytes) of the data segment for a process; this defines how far a program may extend its break with the \fR\(oqsbrk(2)\(cq\fP system call\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.FileSize\fR
.RS 4
The largest size (in bytes) file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.MemoryLock\fR
.RS 4
The maximum size (in bytes) which a process may lock into memory using the \fR\(oqmlock(2)\(cq\fP function\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.NumberOfFiles\fR
.RS 4
The maximum number of open files for this process\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxfiles (SoftResourceLimits) or kern\&.maxfilesperproc (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.NumberOfProcesses\fR
.RS 4
The maximum number of simultaneous processes for this user id\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxproc (SoftResourceLimits) or kern\&.maxprocperuid (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.ResidentSetSize\fR
.RS 4
The maximum size (in bytes) to which a process\[u2019]s resident set size may grow\&. This imposes a limit on the amount of physical memory to be given to a process; if memory is tight, the system will prefer to take memory from processes that are exceeding their declared resident set size\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Stack\fR
.RS 4
The maximum size (in bytes) of the stack segment for a process; this defines how far a program\[u2019]s stack segment may be extended\&. Stack extension is performed automatically by the system\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.InitGroups\fR
.RS 4
This optional key specifies whether \fR\(oqinitgroups(3)\(cq\fP should be called before running the job\&. The default is true in 10\&.5 and false in 10\&.4\&. This key will be ignored if the UserName key is not set\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.KeepAlive\fR
.RS 4
This optional key is used to control whether your job is to be kept continuously running or to let demand and conditions control the invocation\&. The default is false and therefore only demand will start the job\&. The value may be set to true to unconditionally keep the job alive\&. Alternatively, a dictionary of conditions may be specified to selectively control whether launchd keeps a job alive or not\&. If multiple keys are provided, launchd ORs them, thus providing maximum flexibility to the job to refine the logic and stall if necessary\&. If launchd finds no reason to restart the job, it falls back on demand based invocation\&. Jobs that exit quickly and frequently when configured to be kept alive will be throttled to converve system resources\&.
.sp
\fIType:\fR null or boolean or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Label\fR
.RS 4
This required key uniquely identifies the job to launchd\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.LaunchEvents\fR
.RS 4
Specifies higher\-level event types to be used as launch\-on\-demand event sources\&. Each sub\-dictionary defines events for a particular event subsystem, such as \[u201C]com\&.apple\&.iokit\&.matching\[u201D], which can be used to launch jobs based on the appearance of nodes in the IORegistry\&. Each dictionary within the sub\-dictionary specifies an event descriptor that is specified to each event subsystem\&. With this key, the job promises to use the xpc_set_event_stream_handler(3) API to consume events\&. See xpc_events(3) for more details on event sources\&.
.sp
\fIType:\fR null or (attribute set)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dqcom\&.apple\&.iokit\&.matching\(dq = {
    \(dqcom\&.apple\&.usb\&.device\(dq = {
      IOMatchLaunchStream = true;
      IOProviderClass = \(dqIOUSBDevice\(dq;
      idProduct = \(dq*\(dq;
      idVendor = \(dq*\(dq;
    };
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.LaunchOnlyOnce\fR
.RS 4
This optional key specifies whether the job can only be run once and only once\&. In other words, if the job cannot be safely respawned without a full machine reboot, then set this key to be true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.LimitLoadFromHosts\fR
.RS 4
This configuration file only applies to hosts NOT listed with this key\&. Note: One should set kern\&.hostname in \fR\(oqsysctl\&.conf(5)\(cq\fP for this feature to work reliably\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.LimitLoadToHosts\fR
.RS 4
This configuration file only applies to the hosts listed with this key\&. Note: One should set kern\&.hostname in \fR\(oqsysctl\&.conf(5)\(cq\fP for this feature to work reliably\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.LimitLoadToSessionType\fR
.RS 4
This configuration file only applies to sessions of the type specified\&. This key is used in concert with the \-S flag to \fBlaunchctl\fP\&.
.sp
\fIType:\fR null or string or list of string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.LowPriorityBackgroundIO\fR
.RS 4
This optional key specifies whether the kernel should consider this daemon to be low priority when doing file system I/O when the process is throttled with the Darwin\-background classification\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.LowPriorityIO\fR
.RS 4
This optional key specifies whether the kernel should consider this daemon to be low priority when doing file system I/O\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.MachServices\fR
.RS 4
This optional key is used to specify Mach services to be registered with the Mach bootstrap sub\-system\&. Each key in this dictionary should be the name of service to be advertised\&. The value of the key must be a boolean and set to true\&. Alternatively, a dictionary can be used instead of a simple true value\&.
.sp
Finally, for the job itself, the values will be replaced with Mach ports at the time of check\-in with launchd\&.
.sp
\fIType:\fR null or (attribute set of (boolean or (submodule)))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dqorg\&.nixos\&.service\(dq = {
    ResetAtClose = true;
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Nice\fR
.RS 4
This optional key specifies what nice(3) value should be applied to the daemon\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.OnDemand\fR
.RS 4
This key was used in Mac OS X 10\&.4 to control whether a job was kept alive or not\&. The default was true\&. This key has been deprecated and replaced in Mac OS X 10\&.5 and later with the more powerful KeepAlive option\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.ProcessType\fR
.RS 4
This optional key describes, at a high level, the intended purpose of the job\&. The system will apply resource limits based on what kind of job it is\&. If left unspecified, the system will apply light resource limits to the job, throttling its CPU usage and I/O bandwidth\&. The following are valid values:
.RS 4
.PP
Background
.RS 4
Background jobs are generally processes that do work that was not directly requested by the user\&. The resource limits applied to Background jobs are intended to prevent them from disrupting the user experience\&.
.RE
.PP
Standard
.RS 4
Standard jobs are equivalent to no ProcessType being set\&.
.RE
.PP
Adaptive
.RS 4
Adaptive jobs move between the Background and Interactive classifications based on activity over XPC connections\&. See \fR\(oqxpc_transaction_begin(3)\(cq\fP for details\&.
.RE
.PP
Interactive
.RS 4
Interactive jobs run with the same resource limitations as apps, that is to say, none\&. Interactive jobs are critical to maintaining a responsive user experience, and this key should only be used if an app\[u2019]s ability to be responsive depends on it, and cannot be made Adaptive\&.
.RE
.RE
.sp
\fIType:\fR null or one of \[u201C]Background\[u201D], \[u201C]Standard\[u201D], \[u201C]Adaptive\[u201D], \[u201C]Interactive\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqBackground\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Program\fR
.RS 4
This key maps to the first argument of \fR\(oqexecvp(3)\(cq\fP\&. If this key is missing, then the first element of the array of strings provided to the ProgramArguments will be used instead\&. This key is required in the absence of the ProgramArguments key\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.ProgramArguments\fR
.RS 4
This key maps to the second argument of \fR\(oqexecvp(3)\(cq\fP\&. This key is required in the absence of the Program key\&. Please note: many people are confused by this key\&. Please read \fR\(oqexecvp(3)\(cq\fP very carefully!
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.QueueDirectories\fR
.RS 4
Much like the WatchPaths option, this key will watch the paths for modifications\&. The difference being that the job will only be started if the path is a directory and the directory is not empty\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.RootDirectory\fR
.RS 4
This optional key is used to specify a directory to \fR\(oqchroot(2)\(cq\fP to before running the job\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.RunAtLoad\fR
.RS 4
This optional key is used to control whether your job is launched once at the time the job is loaded\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.ServiceIPC\fR
.RS 4
This optional key specifies whether the job participates in advanced communication with launchd\&. The default is false\&. This flag is incompatible with the inetdCompatibility key\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SessionCreate\fR
.RS 4
This key specifies that the job should be spawned into a new security audit session rather than the default session for the context is belongs to\&. See auditon(2) for details\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\fR
.RS 4
This optional key is used to specify launch on demand sockets that can be used to let launchd know when to run the job\&. The job must check\-in to get a copy of the file descriptors using APIs outlined in launch(3)\&. The keys of the top level Sockets dictionary can be anything\&. They are meant for the application developer to use to differentiate which descriptors correspond to which application level protocols (e\&.g\&. http vs\&. ftp vs\&. DNS\[u2026])\&. At check\-in time, the value of each Sockets dictionary key will be an array of descriptors\&. Daemon/Agent writers should consider all descriptors of a given key to be to be effectively equivalent, even though each file descriptor likely represents a different networking protocol which conforms to the criteria specified in the job configuration file\&.
.sp
The parameters below are used as inputs to call \fR\(oqgetaddrinfo(3)\(cq\fP\&.
.sp
\fIType:\fR null or (attribute set of (submodule))
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.Bonjour\fR
.RS 4
This optional key can be used to request that the service be registered with the \fR\(oqmDNSResponder(8)\(cq\fP\&. If the value is boolean, the service name is inferred from the SockServiceName\&.
.sp
\fIType:\fR null or boolean or list of string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.MulticastGroup\fR
.RS 4
This optional key can be used to request that the datagram socket join a multicast group\&. If the value is a hostname, then \fR\(oqgetaddrinfo(3)\(cq\fP will be used to join the correct multicast address for a given socket family\&. If an explicit IPv4 or IPv6 address is given, it is required that the SockFamily family also be set, otherwise the results are undefined\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SecureSocketWithKey\fR
.RS 4
This optional key is a variant of SockPathName\&. Instead of binding to a known path, a securely generated socket is created and the path is assigned to the environment variable that is inherited by all jobs spawned by launchd\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockFamily\fR
.RS 4
This optional key can be used to specifically request that \[u201C]IPv4\[u201D] or \[u201C]IPv6\[u201D] socket(s) be created\&.
.sp
\fIType:\fR null or one of \[u201C]IPv4\[u201D], \[u201C]IPv6\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockNodeName\fR
.RS 4
This optional key specifies the node to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPassive\fR
.RS 4
This optional key specifies whether \fR\(oqlisten(2)\(cq\fP or \fR\(oqconnect(2)\(cq\fP should be called on the created file descriptor\&. The default is true (\[u201C]to listen\[u201D])\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPathMode\fR
.RS 4
This optional key specifies the mode of the socket\&. Known bug: Property lists don\[u2019]t support octal, so please convert the value to decimal\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPathName\fR
.RS 4
This optional key implies SockFamily is set to \[u201C]Unix\[u201D]\&. It specifies the path to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockProtocol\fR
.RS 4
This optional key specifies the protocol to be passed to \fR\(oqsocket(2)\(cq\fP\&. The only value understood by this key at the moment is \[u201C]TCP\[u201D]\&.
.sp
\fIType:\fR null or value \[u201C]TCP\[u201D] (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockServiceName\fR
.RS 4
This optional key specifies the service on the node to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockType\fR
.RS 4
This optional key tells launchctl what type of socket to create\&. The default is \[u201C]stream\[u201D] and other valid values for this key are \[u201C]dgram\[u201D] and \[u201C]seqpacket\[u201D] respectively\&.
.sp
\fIType:\fR null or one of \[u201C]stream\[u201D], \[u201C]dgram\[u201D], \[u201C]seqpacket\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\fR
.RS 4
Resource limits to be imposed on the job\&. These adjust variables set with \fR\(oqsetrlimit(2)\(cq\fP\&. The following keys apply:
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.CPU\fR
.RS 4
The maximum amount of cpu time (in seconds) to be used by each process\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Core\fR
.RS 4
The largest size (in bytes) core file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Data\fR
.RS 4
The maximum size (in bytes) of the data segment for a process; this defines how far a program may extend its break with the \fR\(oqsbrk(2)\(cq\fP system call\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.FileSize\fR
.RS 4
The largest size (in bytes) file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.MemoryLock\fR
.RS 4
The maximum size (in bytes) which a process may lock into memory using the mlock(2) function\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.NumberOfFiles\fR
.RS 4
The maximum number of open files for this process\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxfiles (SoftResourceLimits) or kern\&.maxfilesperproc (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.NumberOfProcesses\fR
.RS 4
The maximum number of simultaneous processes for this user id\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxproc (SoftResourceLimits) or kern\&.maxprocperuid (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.ResidentSetSize\fR
.RS 4
The maximum size (in bytes) to which a process\[u2019]s resident set size may grow\&. This imposes a limit on the amount of physical memory to be given to a process; if memory is tight, the system will prefer to take memory from processes that are exceeding their declared resident set size\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Stack\fR
.RS 4
The maximum size (in bytes) of the stack segment for a process; this defines how far a program\[u2019]s stack segment may be extended\&. Stack extension is performed automatically by the system\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.StandardErrorPath\fR
.RS 4
This optional key specifies what file should be used for data being sent to stderr when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.StandardInPath\fR
.RS 4
This optional key specifies what file should be used for data being supplied to stdin when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.StandardOutPath\fR
.RS 4
This optional key specifies what file should be used for data being sent to stdout when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.StartCalendarInterval\fR
.RS 4
This optional key causes the job to be started every calendar interval as specified\&. The semantics are much like \fBcrontab\fP\fR(5)\fP: Missing attributes are considered to be wildcard\&. Unlike cron which skips job invocations when the computer is asleep, launchd will start the job the next time the computer wakes up\&. If multiple intervals transpire before the computer is woken, those events will be coalesced into one event upon waking from sleep\&.
.sp
.RS 4
\fBImportant\fP
.br
The list must not be empty and must not contain duplicate entries (attrsets which compare equally)\&.
.RE
.sp
.RS 4
\fBCaution\fP
.br
Since missing attrs become wildcards, an empty attrset effectively means \[u201C]every minute\[u201D]\&.
.RE
.sp
\fIType:\fR null or (submodule) or unique (non\-empty (list of (submodule)))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  {
    Hour = 2;
    Minute = 30;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.StartInterval\fR
.RS 4
This optional key causes the job to be started every N seconds\&. If the system is asleep, the job will be started the next time the computer wakes up\&. If multiple intervals transpire before the computer is woken, those events will be coalesced into one event upon wake from sleep\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.StartOnMount\fR
.RS 4
This optional key causes the job to be started every time a filesystem is mounted\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.ThrottleInterval\fR
.RS 4
This key lets one override the default throttling policy imposed on jobs by launchd\&. The value is in seconds, and by default, jobs will not be spawned more than once every 10 seconds\&. The principle behind this is that jobs should linger around just in case they are needed again in the near future\&. This not only reduces the latency of responses, but it encourages developers to amortize the cost of program invocation\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.TimeOut\fR
.RS 4
The recommended idle time out (in seconds) to pass to the job\&. If no value is specified, a default time out will be supplied by launchd for use by the job at check in time\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.Umask\fR
.RS 4
This optional key specifies what value should be passed to \fR\(oqumask(2)\(cq\fP before running the job\&. Known bug: Property lists don\[u2019]t support octal, so please convert the value to decimal\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.UserName\fR
.RS 4
This optional key specifies the user to run the job as\&. This key is only applicable when launchd is running as root\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.WaitForDebugger\fR
.RS 4
This optional key specifies that launchd should instruct the kernel to have the job wait for a debugger to attach before any code in the job is executed\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.WatchPaths\fR
.RS 4
This optional key causes the job to be started if any one of the listed paths are modified\&.
.sp
\fIType:\fR null or (list of path)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.WorkingDirectory\fR
.RS 4
This optional key is used to specify a directory to \fR\(oqchdir(2)\(cq\fP to before running the job\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.inetdCompatibility\fR
.RS 4
The presence of this key specifies that the daemon expects to be run as if it were launched from inetd\&.
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  Wait = true;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.daemons\&.<name>\&.serviceConfig\&.inetdCompatibility\&.Wait\fR
.RS 4
This flag corresponds to the \[u201C]wait\[u201D] or \[u201C]nowait\[u201D] option of inetd\&. If true, then the listening socket is passed via the standard in/out/error file descriptors\&. If false, then \fR\(oqaccept(2)\(cq\fP is called on behalf of the job, and the result is passed via the standard in/out/error descriptors\&.
.sp
\fIType:\fR null or boolean or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.envVariables\fR
.RS 4
A set of environment variables to be set on all future processes launched by launchd in the caller\[u2019]s context\&. The value of each variable can be either a string or a list of strings\&. The latter is concatenated, interspersed with colon characters\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  LANG = \(dqnl_NL\&.UTF\-8\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.labelPrefix\fR
.RS 4
The default prefix of the service label\&. Individual services can override this by setting the Label attribute\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dqorg\&.nixos\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\fR
.RS 4
Definition of per\-user launchd agents\&.
.sp
When a user logs in, a per\-user launchd is started\&. It does the following:
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
It loads the parameters for each launch\-on\-demand user agent from the property list files found in /System/Library/LaunchAgents, /Library/LaunchAgents, and the user\[u2019]s individual Library/LaunchAgents directory\&.
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
It registers the sockets and file descriptors requested by those user agents\&.
.RE
.RS 4
\h'-3'\fB3\&.\fP\h'1'\c
It launches any user agents that requested to be running all the time\&.
.RE
.RS 4
\h'-3'\fB4\&.\fP\h'1'\c
As requests for a particular service arrive, it launches the corresponding user agent and passes the request to it\&.
.RE
.RS 4
\h'-3'\fB5\&.\fP\h'1'\c
When the user logs out, it sends a SIGTERM signal to all of the user agents that it started\&.
.RE
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.command\fR
.RS 4
Command executed as the service\[u2019]s main process\&.
.sp
\fIType:\fR string or path
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.environment\fR
.RS 4
Environment variables passed to the service\[u2019]s processes\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  LANG = \(dqnl_NL\&.UTF\-8\(dq;
  PATH = \(dq/foo/bar/bin\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.path\fR
.RS 4
Packages added to the service\[u2019]s \fBPATH\fP environment variable\&. Only the \fIbin\fP and subdirectories of each package is added\&.
.sp
\fIType:\fR list of (path or string)
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.script\fR
.RS 4
Shell commands executed as the service\[u2019]s main process\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\fR
.RS 4
Each attribute in this set specifies an option for a key in the plist\&. \fBhttps://developer\&.apple\&.com/legacy/library/documentation/Darwin/Reference/ManPages/man5/launchd\&.plist\&.5\&.html\fR[1]\fR
.sp
\fIType:\fR submodule
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  KeepAlive = true;
  Program = \(dq/run/current\-system/sw/bin/nix\-daemon\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://developer\&.apple\&.com/legacy/library/documentation/Darwin/Reference/ManPages/man5/launchd\&.plist\&.5\&.html
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.AbandonProcessGroup\fR
.RS 4
When a job dies, launchd kills any remaining processes with the same process group ID as the job\&. Setting this key to true disables that behavior\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Debug\fR
.RS 4
This optional key specifies that launchd should adjust its log mask temporarily to LOG_DEBUG while dealing with this job\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Disabled\fR
.RS 4
This optional key is used as a hint to \fR\(oqlaunchctl(1)\(cq\fP that it should not submit this job to launchd when loading a job or jobs\&. The value of this key does NOT reflect the current state of the job on the running system\&. If you wish to know whether a job is loaded in launchd, reading this key from a configuration file yourself is not a sufficient test\&. You should query launchd for the presence of the job using the \fR\(oqlaunchctl(1)\(cq\fP list subcommand or use the ServiceManagement framework\[u2019]s \fR\(oqSMJobCopyDictionary()\(cq\fP method\&.
.sp
Note that as of Mac OS X v10\&.6, this key\[u2019]s value in a configuration file conveys a default value, which is changed with the [\-w] option of the \fR\(oqlaunchctl(1)\(cq\fP load and unload subcommands\&. These subcommands no longer modify the configuration file, so the value displayed in the configuration file is not necessarily the value that \fR\(oqlaunchctl(1)\(cq\fP will apply\&. See \fR\(oqlaunchctl(1)\(cq\fP for more information\&.
.sp
Please also be mindful that you should only use this key if the provided on\-demand and KeepAlive criteria are insufficient to describe the conditions under which your job needs to run\&. The cost to have a job loaded in launchd is negligible, so there is no harm in loading a job which only runs once or very rarely\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.EnableGlobbing\fR
.RS 4
This flag causes launchd to use the \fR\(oqglob(3)\(cq\fP mechanism to update the program arguments before invocation\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.EnableTransactions\fR
.RS 4
This flag instructs launchd that the job promises to use \fR\(oqvproc_transaction_begin(3)\(cq\fP and \fR\(oqvproc_transaction_end(3)\(cq\fP to track outstanding transactions that need to be reconciled before the process can safely terminate\&. If no outstanding transactions are in progress, then launchd is free to send the SIGKILL signal\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.EnvironmentVariables\fR
.RS 4
This optional key is used to specify additional environment variables to be set before running the job\&.
.sp
\fIType:\fR null or (attribute set of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.ExitTimeOut\fR
.RS 4
The amount of time launchd waits before sending a SIGKILL signal\&. The default value is 20 seconds\&. The value zero is interpreted as infinity\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.GroupName\fR
.RS 4
This optional key specifies the group to run the job as\&. This key is only applicable when launchd is running as root\&. If UserName is set and GroupName is not, the the group will be set to the default group of the user\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\fR
.RS 4
Resource limits to be imposed on the job\&. These adjust variables set with \fR\(oqsetrlimit(2)\(cq\fP\&. The following keys apply:
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  NumberOfFiles = 4096;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.CPU\fR
.RS 4
The maximum amount of cpu time (in seconds) to be used by each process\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Core\fR
.RS 4
The largest size (in bytes) core file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Data\fR
.RS 4
The maximum size (in bytes) of the data segment for a process; this defines how far a program may extend its break with the \fR\(oqsbrk(2)\(cq\fP system call\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.FileSize\fR
.RS 4
The largest size (in bytes) file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.MemoryLock\fR
.RS 4
The maximum size (in bytes) which a process may lock into memory using the \fR\(oqmlock(2)\(cq\fP function\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.NumberOfFiles\fR
.RS 4
The maximum number of open files for this process\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxfiles (SoftResourceLimits) or kern\&.maxfilesperproc (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.NumberOfProcesses\fR
.RS 4
The maximum number of simultaneous processes for this user id\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxproc (SoftResourceLimits) or kern\&.maxprocperuid (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.ResidentSetSize\fR
.RS 4
The maximum size (in bytes) to which a process\[u2019]s resident set size may grow\&. This imposes a limit on the amount of physical memory to be given to a process; if memory is tight, the system will prefer to take memory from processes that are exceeding their declared resident set size\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.HardResourceLimits\&.Stack\fR
.RS 4
The maximum size (in bytes) of the stack segment for a process; this defines how far a program\[u2019]s stack segment may be extended\&. Stack extension is performed automatically by the system\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.InitGroups\fR
.RS 4
This optional key specifies whether \fR\(oqinitgroups(3)\(cq\fP should be called before running the job\&. The default is true in 10\&.5 and false in 10\&.4\&. This key will be ignored if the UserName key is not set\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.KeepAlive\fR
.RS 4
This optional key is used to control whether your job is to be kept continuously running or to let demand and conditions control the invocation\&. The default is false and therefore only demand will start the job\&. The value may be set to true to unconditionally keep the job alive\&. Alternatively, a dictionary of conditions may be specified to selectively control whether launchd keeps a job alive or not\&. If multiple keys are provided, launchd ORs them, thus providing maximum flexibility to the job to refine the logic and stall if necessary\&. If launchd finds no reason to restart the job, it falls back on demand based invocation\&. Jobs that exit quickly and frequently when configured to be kept alive will be throttled to converve system resources\&.
.sp
\fIType:\fR null or boolean or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Label\fR
.RS 4
This required key uniquely identifies the job to launchd\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.LaunchEvents\fR
.RS 4
Specifies higher\-level event types to be used as launch\-on\-demand event sources\&. Each sub\-dictionary defines events for a particular event subsystem, such as \[u201C]com\&.apple\&.iokit\&.matching\[u201D], which can be used to launch jobs based on the appearance of nodes in the IORegistry\&. Each dictionary within the sub\-dictionary specifies an event descriptor that is specified to each event subsystem\&. With this key, the job promises to use the xpc_set_event_stream_handler(3) API to consume events\&. See xpc_events(3) for more details on event sources\&.
.sp
\fIType:\fR null or (attribute set)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dqcom\&.apple\&.iokit\&.matching\(dq = {
    \(dqcom\&.apple\&.usb\&.device\(dq = {
      IOMatchLaunchStream = true;
      IOProviderClass = \(dqIOUSBDevice\(dq;
      idProduct = \(dq*\(dq;
      idVendor = \(dq*\(dq;
    };
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.LaunchOnlyOnce\fR
.RS 4
This optional key specifies whether the job can only be run once and only once\&. In other words, if the job cannot be safely respawned without a full machine reboot, then set this key to be true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.LimitLoadFromHosts\fR
.RS 4
This configuration file only applies to hosts NOT listed with this key\&. Note: One should set kern\&.hostname in \fR\(oqsysctl\&.conf(5)\(cq\fP for this feature to work reliably\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.LimitLoadToHosts\fR
.RS 4
This configuration file only applies to the hosts listed with this key\&. Note: One should set kern\&.hostname in \fR\(oqsysctl\&.conf(5)\(cq\fP for this feature to work reliably\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.LimitLoadToSessionType\fR
.RS 4
This configuration file only applies to sessions of the type specified\&. This key is used in concert with the \-S flag to \fBlaunchctl\fP\&.
.sp
\fIType:\fR null or string or list of string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.LowPriorityBackgroundIO\fR
.RS 4
This optional key specifies whether the kernel should consider this daemon to be low priority when doing file system I/O when the process is throttled with the Darwin\-background classification\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.LowPriorityIO\fR
.RS 4
This optional key specifies whether the kernel should consider this daemon to be low priority when doing file system I/O\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.MachServices\fR
.RS 4
This optional key is used to specify Mach services to be registered with the Mach bootstrap sub\-system\&. Each key in this dictionary should be the name of service to be advertised\&. The value of the key must be a boolean and set to true\&. Alternatively, a dictionary can be used instead of a simple true value\&.
.sp
Finally, for the job itself, the values will be replaced with Mach ports at the time of check\-in with launchd\&.
.sp
\fIType:\fR null or (attribute set of (boolean or (submodule)))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dqorg\&.nixos\&.service\(dq = {
    ResetAtClose = true;
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Nice\fR
.RS 4
This optional key specifies what nice(3) value should be applied to the daemon\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.OnDemand\fR
.RS 4
This key was used in Mac OS X 10\&.4 to control whether a job was kept alive or not\&. The default was true\&. This key has been deprecated and replaced in Mac OS X 10\&.5 and later with the more powerful KeepAlive option\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.ProcessType\fR
.RS 4
This optional key describes, at a high level, the intended purpose of the job\&. The system will apply resource limits based on what kind of job it is\&. If left unspecified, the system will apply light resource limits to the job, throttling its CPU usage and I/O bandwidth\&. The following are valid values:
.RS 4
.PP
Background
.RS 4
Background jobs are generally processes that do work that was not directly requested by the user\&. The resource limits applied to Background jobs are intended to prevent them from disrupting the user experience\&.
.RE
.PP
Standard
.RS 4
Standard jobs are equivalent to no ProcessType being set\&.
.RE
.PP
Adaptive
.RS 4
Adaptive jobs move between the Background and Interactive classifications based on activity over XPC connections\&. See \fR\(oqxpc_transaction_begin(3)\(cq\fP for details\&.
.RE
.PP
Interactive
.RS 4
Interactive jobs run with the same resource limitations as apps, that is to say, none\&. Interactive jobs are critical to maintaining a responsive user experience, and this key should only be used if an app\[u2019]s ability to be responsive depends on it, and cannot be made Adaptive\&.
.RE
.RE
.sp
\fIType:\fR null or one of \[u201C]Background\[u201D], \[u201C]Standard\[u201D], \[u201C]Adaptive\[u201D], \[u201C]Interactive\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqBackground\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Program\fR
.RS 4
This key maps to the first argument of \fR\(oqexecvp(3)\(cq\fP\&. If this key is missing, then the first element of the array of strings provided to the ProgramArguments will be used instead\&. This key is required in the absence of the ProgramArguments key\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.ProgramArguments\fR
.RS 4
This key maps to the second argument of \fR\(oqexecvp(3)\(cq\fP\&. This key is required in the absence of the Program key\&. Please note: many people are confused by this key\&. Please read \fR\(oqexecvp(3)\(cq\fP very carefully!
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.QueueDirectories\fR
.RS 4
Much like the WatchPaths option, this key will watch the paths for modifications\&. The difference being that the job will only be started if the path is a directory and the directory is not empty\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.RootDirectory\fR
.RS 4
This optional key is used to specify a directory to \fR\(oqchroot(2)\(cq\fP to before running the job\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.RunAtLoad\fR
.RS 4
This optional key is used to control whether your job is launched once at the time the job is loaded\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.ServiceIPC\fR
.RS 4
This optional key specifies whether the job participates in advanced communication with launchd\&. The default is false\&. This flag is incompatible with the inetdCompatibility key\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SessionCreate\fR
.RS 4
This key specifies that the job should be spawned into a new security audit session rather than the default session for the context is belongs to\&. See auditon(2) for details\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\fR
.RS 4
This optional key is used to specify launch on demand sockets that can be used to let launchd know when to run the job\&. The job must check\-in to get a copy of the file descriptors using APIs outlined in launch(3)\&. The keys of the top level Sockets dictionary can be anything\&. They are meant for the application developer to use to differentiate which descriptors correspond to which application level protocols (e\&.g\&. http vs\&. ftp vs\&. DNS\[u2026])\&. At check\-in time, the value of each Sockets dictionary key will be an array of descriptors\&. Daemon/Agent writers should consider all descriptors of a given key to be to be effectively equivalent, even though each file descriptor likely represents a different networking protocol which conforms to the criteria specified in the job configuration file\&.
.sp
The parameters below are used as inputs to call \fR\(oqgetaddrinfo(3)\(cq\fP\&.
.sp
\fIType:\fR null or (attribute set of (submodule))
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.Bonjour\fR
.RS 4
This optional key can be used to request that the service be registered with the \fR\(oqmDNSResponder(8)\(cq\fP\&. If the value is boolean, the service name is inferred from the SockServiceName\&.
.sp
\fIType:\fR null or boolean or list of string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.MulticastGroup\fR
.RS 4
This optional key can be used to request that the datagram socket join a multicast group\&. If the value is a hostname, then \fR\(oqgetaddrinfo(3)\(cq\fP will be used to join the correct multicast address for a given socket family\&. If an explicit IPv4 or IPv6 address is given, it is required that the SockFamily family also be set, otherwise the results are undefined\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SecureSocketWithKey\fR
.RS 4
This optional key is a variant of SockPathName\&. Instead of binding to a known path, a securely generated socket is created and the path is assigned to the environment variable that is inherited by all jobs spawned by launchd\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockFamily\fR
.RS 4
This optional key can be used to specifically request that \[u201C]IPv4\[u201D] or \[u201C]IPv6\[u201D] socket(s) be created\&.
.sp
\fIType:\fR null or one of \[u201C]IPv4\[u201D], \[u201C]IPv6\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockNodeName\fR
.RS 4
This optional key specifies the node to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPassive\fR
.RS 4
This optional key specifies whether \fR\(oqlisten(2)\(cq\fP or \fR\(oqconnect(2)\(cq\fP should be called on the created file descriptor\&. The default is true (\[u201C]to listen\[u201D])\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPathMode\fR
.RS 4
This optional key specifies the mode of the socket\&. Known bug: Property lists don\[u2019]t support octal, so please convert the value to decimal\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockPathName\fR
.RS 4
This optional key implies SockFamily is set to \[u201C]Unix\[u201D]\&. It specifies the path to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockProtocol\fR
.RS 4
This optional key specifies the protocol to be passed to \fR\(oqsocket(2)\(cq\fP\&. The only value understood by this key at the moment is \[u201C]TCP\[u201D]\&.
.sp
\fIType:\fR null or value \[u201C]TCP\[u201D] (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockServiceName\fR
.RS 4
This optional key specifies the service on the node to \fR\(oqconnect(2)\(cq\fP or \fR\(oqbind(2)\(cq\fP to\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Sockets\&.<name>\&.SockType\fR
.RS 4
This optional key tells launchctl what type of socket to create\&. The default is \[u201C]stream\[u201D] and other valid values for this key are \[u201C]dgram\[u201D] and \[u201C]seqpacket\[u201D] respectively\&.
.sp
\fIType:\fR null or one of \[u201C]stream\[u201D], \[u201C]dgram\[u201D], \[u201C]seqpacket\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\fR
.RS 4
Resource limits to be imposed on the job\&. These adjust variables set with \fR\(oqsetrlimit(2)\(cq\fP\&. The following keys apply:
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.CPU\fR
.RS 4
The maximum amount of cpu time (in seconds) to be used by each process\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Core\fR
.RS 4
The largest size (in bytes) core file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Data\fR
.RS 4
The maximum size (in bytes) of the data segment for a process; this defines how far a program may extend its break with the \fR\(oqsbrk(2)\(cq\fP system call\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.FileSize\fR
.RS 4
The largest size (in bytes) file that may be created\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.MemoryLock\fR
.RS 4
The maximum size (in bytes) which a process may lock into memory using the mlock(2) function\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.NumberOfFiles\fR
.RS 4
The maximum number of open files for this process\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxfiles (SoftResourceLimits) or kern\&.maxfilesperproc (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.NumberOfProcesses\fR
.RS 4
The maximum number of simultaneous processes for this user id\&. Setting this value in a system wide daemon will set the \fR\(oqsysctl(3)\(cq\fP kern\&.maxproc (SoftResourceLimits) or kern\&.maxprocperuid (HardResourceLimits) value in addition to the \fR\(oqsetrlimit(2)\(cq\fP values\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.ResidentSetSize\fR
.RS 4
The maximum size (in bytes) to which a process\[u2019]s resident set size may grow\&. This imposes a limit on the amount of physical memory to be given to a process; if memory is tight, the system will prefer to take memory from processes that are exceeding their declared resident set size\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.SoftResourceLimits\&.Stack\fR
.RS 4
The maximum size (in bytes) of the stack segment for a process; this defines how far a program\[u2019]s stack segment may be extended\&. Stack extension is performed automatically by the system\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.StandardErrorPath\fR
.RS 4
This optional key specifies what file should be used for data being sent to stderr when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.StandardInPath\fR
.RS 4
This optional key specifies what file should be used for data being supplied to stdin when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.StandardOutPath\fR
.RS 4
This optional key specifies what file should be used for data being sent to stdout when using \fR\(oqstdio(3)\(cq\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.StartCalendarInterval\fR
.RS 4
This optional key causes the job to be started every calendar interval as specified\&. The semantics are much like \fBcrontab\fP\fR(5)\fP: Missing attributes are considered to be wildcard\&. Unlike cron which skips job invocations when the computer is asleep, launchd will start the job the next time the computer wakes up\&. If multiple intervals transpire before the computer is woken, those events will be coalesced into one event upon waking from sleep\&.
.sp
.RS 4
\fBImportant\fP
.br
The list must not be empty and must not contain duplicate entries (attrsets which compare equally)\&.
.RE
.sp
.RS 4
\fBCaution\fP
.br
Since missing attrs become wildcards, an empty attrset effectively means \[u201C]every minute\[u201D]\&.
.RE
.sp
\fIType:\fR null or (submodule) or unique (non\-empty (list of (submodule)))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  {
    Hour = 2;
    Minute = 30;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.StartInterval\fR
.RS 4
This optional key causes the job to be started every N seconds\&. If the system is asleep, the job will be started the next time the computer wakes up\&. If multiple intervals transpire before the computer is woken, those events will be coalesced into one event upon wake from sleep\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.StartOnMount\fR
.RS 4
This optional key causes the job to be started every time a filesystem is mounted\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.ThrottleInterval\fR
.RS 4
This key lets one override the default throttling policy imposed on jobs by launchd\&. The value is in seconds, and by default, jobs will not be spawned more than once every 10 seconds\&. The principle behind this is that jobs should linger around just in case they are needed again in the near future\&. This not only reduces the latency of responses, but it encourages developers to amortize the cost of program invocation\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.TimeOut\fR
.RS 4
The recommended idle time out (in seconds) to pass to the job\&. If no value is specified, a default time out will be supplied by launchd for use by the job at check in time\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.Umask\fR
.RS 4
This optional key specifies what value should be passed to \fR\(oqumask(2)\(cq\fP before running the job\&. Known bug: Property lists don\[u2019]t support octal, so please convert the value to decimal\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.UserName\fR
.RS 4
This optional key specifies the user to run the job as\&. This key is only applicable when launchd is running as root\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.WaitForDebugger\fR
.RS 4
This optional key specifies that launchd should instruct the kernel to have the job wait for a debugger to attach before any code in the job is executed\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.WatchPaths\fR
.RS 4
This optional key causes the job to be started if any one of the listed paths are modified\&.
.sp
\fIType:\fR null or (list of path)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.WorkingDirectory\fR
.RS 4
This optional key is used to specify a directory to \fR\(oqchdir(2)\(cq\fP to before running the job\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.inetdCompatibility\fR
.RS 4
The presence of this key specifies that the daemon expects to be run as if it were launched from inetd\&.
.sp
\fIType:\fR null or (submodule)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  Wait = true;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.agents\&.<name>\&.serviceConfig\&.inetdCompatibility\&.Wait\fR
.RS 4
This flag corresponds to the \[u201C]wait\[u201D] or \[u201C]nowait\[u201D] option of inetd\&. If true, then the listening socket is passed via the standard in/out/error file descriptors\&. If false, then \fR\(oqaccept(2)\(cq\fP is called on behalf of the job, and the result is passed via the standard in/out/error descriptors\&.
.sp
\fIType:\fR null or boolean or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlaunchd\&.user\&.envVariables\fR
.RS 4
A set of environment variables to be set on all future processes launched by launchd in the caller\[u2019]s context\&. The value of each variable can be either a string or a list of strings\&. The latter is concatenated, interspersed with colon characters\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  LANG = \(dqnl_NL\&.UTF\-8\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/launchd>\fP
.RE
.RE
.PP
\fBlib\fR
.RS 4
This option allows modules to define helper functions, constants, etc\&.
.sp
\fIType:\fR attribute set of (attribute set)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/misc/lib\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.computerName\fR
.RS 4
The user\-friendly name for the system, set in System Preferences > Sharing > Computer Name\&.
.sp
Setting this option is equivalent to running \fR\(oqscutil \-\-set ComputerName\(cq\fP\&.
.sp
This name can contain spaces and Unicode characters\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqJohn\[u2019]s MacBook Pro\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/networking>\fP
.RE
.RE
.PP
\fBnetworking\&.dns\fR
.RS 4
The list of dns servers used when resolving domain names\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq8\&.8\&.8\&.8\(dq
  \(dq8\&.8\&.4\&.4\(dq
  \(dq2001:4860:4860::8888\(dq
  \(dq2001:4860:4860::8844\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/networking>\fP
.RE
.RE
.PP
\fBnetworking\&.hostName\fR
.RS 4
The hostname of your system, as visible from the command line and used by local and remote networks when connecting through SSH and Remote Login\&.
.sp
Setting this option is equivalent to running the command \fR\(oqscutil \-\-set HostName\(cq\fP\&.
.sp
(Note that networking\&.localHostName defaults to the value of this option\&.)
.sp
\fIType:\fR null or string matching the pattern \(ha(([a\-zA\-Z0\-9]|[a\-zA\-Z0\-9][a\-zA\-Z0\-9\e\-]*[a\-zA\-Z0\-9])\e\&.)*([A\-Za\-z0\-9]|[A\-Za\-z0\-9][A\-Za\-z0\-9\e\-]*[A\-Za\-z0\-9])$
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqJohns\-MacBook\-Pro\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/networking>\fP
.RE
.RE
.PP
\fBnetworking\&.knownNetworkServices\fR
.RS 4
List of networkservices that should be configured\&.
.sp
To display a list of all the network services on the server\[u2019]s hardware ports, use \fBnetworksetup \-listallnetworkservices\fP\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqWi\-Fi\(dq
  \(dqEthernet Adaptor\(dq
  \(dqThunderbolt Ethernet\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/networking>\fP
.RE
.RE
.PP
\fBnetworking\&.localHostName\fR
.RS 4
The local hostname, or local network name, is displayed beneath the computer\[u2019]s name at the top of the Sharing preferences pane\&. It identifies your Mac to Bonjour\-compatible services\&.
.sp
Setting this option is equivalent to running the command \fR\(oqscutil \-\-set LocalHostName\(cq\fP, where running, e\&.g\&., \fR\(oqscutil \-\-set LocalHostName \(aqJohns\-MacBook\-Pro\(aq\(cq\fP, would set the systems local hostname to \[u201C]Johns\-MacBook\-Pro\&.local\[u201D]\&. The value of this option defaults to the value of the networking\&.hostName option\&.
.sp
By default on macOS the local hostname is your computer\[u2019]s name with \[u201C]\&.local\[u201D] appended, with any spaces replaced with hyphens, and invalid characters omitted\&.
.sp
\fIType:\fR null or string matching the pattern \(ha(([a\-zA\-Z0\-9]|[a\-zA\-Z0\-9][a\-zA\-Z0\-9\e\-]*[a\-zA\-Z0\-9])\e\&.)*([A\-Za\-z0\-9]|[A\-Za\-z0\-9][A\-Za\-z0\-9\e\-]*[A\-Za\-z0\-9])$
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqJohns\-MacBook\-Pro\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/networking>\fP
.RE
.RE
.PP
\fBnetworking\&.search\fR
.RS 4
The list of search paths used when resolving domain names\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/networking>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\fR
.RS 4
Set of wg\-quick interfaces\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.address\fR
.RS 4
List of IP addresses for this interface\&.
.sp
\fIType:\fR null or (list of string)
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.autostart\fR
.RS 4
Whether to bring up this interface automatically during boot\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.dns\fR
.RS 4
List of DNS servers for this interface\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.listenPort\fR
.RS 4
Port to listen on, randomly selected if not specified\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.mtu\fR
.RS 4
MTU to set for this interface, automatically set if not specified
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.peers\fR
.RS 4
List of peers associated with this interface\&.
.sp
\fIType:\fR list of (submodule)
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.peers\&.*\&.allowedIPs\fR
.RS 4
List of IP addresses associated with this peer\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.peers\&.*\&.endpoint\fR
.RS 4
IP and port to connect to this peer at\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.peers\&.*\&.persistentKeepalive\fR
.RS 4
Interval in seconds to send keepalive packets
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.peers\&.*\&.presharedKeyFile\fR
.RS 4
Optional, path to file containing the pre\-shared key for this peer\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.peers\&.*\&.publicKey\fR
.RS 4
The public key for this peer\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.postDown\fR
.RS 4
List of commands to run after interface shutdown
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D] or (list of string) convertible to it
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.postUp\fR
.RS 4
List of commands to run after interface setup\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D] or (list of string) convertible to it
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.preDown\fR
.RS 4
List of commadns to run before interface shutdown\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D] or (list of string) convertible to it
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.preUp\fR
.RS 4
List of commands to run before interface setup\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D] or (list of string) convertible to it
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.privateKeyFile\fR
.RS 4
Path to file containing this interface\[u2019]s private key\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.interfaces\&.<name>\&.table\fR
.RS 4
Controls the routing table to which routes are added\&. There are two special values: \fR\(oqoff\(cq\fP disables the creation of routes altogether, and \fR\(oqauto\(cq\fP (the default) adds routes to the default table and enables special handling of default routes\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnetworking\&.wg\-quick\&.logDir\fR
.RS 4
Directory to save wg\-quick logs to\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq/var/log\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/wg\-quick\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.package\fR
.RS 4
This option specifies the Nix package instance to use throughout the system\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.nix
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\fR
.RS 4
This option lists the machines to be used if distributed builds are enabled (see \fBnix\&.distributedBuilds\fP)\&. Nix will perform derivations on those machines via SSH by copying the inputs to the Nix store on the remote machine, starting the build, then copying the output back to the local Nix store\&.
.sp
\fIType:\fR list of (submodule)
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.hostName\fR
.RS 4
The hostname of the build machine\&.
.sp
\fIType:\fR string
.sp
\fIExample:\fR \(dqnixbuilder\&.example\&.org\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.mandatoryFeatures\fR
.RS 4
A list of features mandatory for this builder\&. The builder will be ignored for derivations that don\[u2019]t require all features in this list\&. All mandatory features are automatically included in \fIsupportedFeatures\fP\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqbig\-parallel\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.maxJobs\fR
.RS 4
The number of concurrent jobs the build machine supports\&. The build machine will enforce its own limits, but this allows hydra to schedule better since there is no work\-stealing between build machines\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 1
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.protocol\fR
.RS 4
The protocol used for communicating with the build machine\&. Use \fR\(oqssh\-ng\(cq\fP if your remote builder and your local Nix version support that improved protocol\&.
.sp
Use \fR\(oqnull\(cq\fP when trying to change the special localhost builder without a protocol which is for example used by hydra\&.
.sp
\fIType:\fR one of <null>, \[u201C]ssh\[u201D], \[u201C]ssh\-ng\[u201D]
.sp
\fIDefault:\fR \(dqssh\(dq
.sp
\fIExample:\fR \(dqssh\-ng\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.publicHostKey\fR
.RS 4
The (base64\-encoded) public host key of this builder\&. The field is calculated via \fBbase64 \-w0 /etc/ssh/ssh_host_type_key\&.pub\fP\&. If null, SSH will use its regular known\-hosts file when connecting\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.speedFactor\fR
.RS 4
The relative speed of this builder\&. This is an arbitrary integer that indicates the speed of this builder, relative to other builders\&. Higher is faster\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 1
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.sshKey\fR
.RS 4
The path to the SSH private key with which to authenticate on the build machine\&. The private key must not have a passphrase\&. If null, the building user (root on NixOS machines) must have an appropriate ssh configuration to log in non\-interactively\&.
.sp
Note that for security reasons, this path must point to a file in the local filesystem, \fInot\fR to the nix store\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq/root/\&.ssh/id_buildhost_builduser\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.sshUser\fR
.RS 4
The username to log in as on the remote host\&. This user must be able to log in and run nix commands non\-interactively\&. It must also be privileged to build derivations, so must be included in \fBnix\&.settings\&.trusted\-users\fP\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqbuilder\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.supportedFeatures\fR
.RS 4
A list of features supported by this builder\&. The builder will be ignored for derivations that require features not in this list\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqkvm\(dq
  \(dqbig\-parallel\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.system\fR
.RS 4
The system type the build machine can execute derivations on\&. Either this attribute or \fIsystems\fP must be present, where \fIsystem\fP takes precedence if both are set\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqx86_64\-linux\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.buildMachines\&.*\&.systems\fR
.RS 4
The system types the build machine can execute derivations on\&. Either this attribute or \fIsystem\fP must be present, where \fIsystem\fP takes precedence if both are set\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqx86_64\-linux\(dq
  \(dqaarch64\-linux\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.channel\&.enable\fR
.RS 4
Whether the \fR\(oqnix\-channel\(cq\fP command and state files are made available on the machine\&.
.sp
The following files are initialized when enabled:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq/nix/var/nix/profiles/per\-user/root/channels\(cq\fP
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq$HOME/\&.nix\-defexpr/channels\(cq\fP (on login)
.RE
.sp
Disabling this option will not remove the state files from the system\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.checkConfig\fR
.RS 4
If enabled (the default), checks for data type mismatches and that Nix can parse the generated nix\&.conf\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.configureBuildUsers\fR
.RS 4
Enable configuration for nixbld group and users\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.daemonIOLowPriority\fR
.RS 4
Whether the Nix daemon process should considered to be low priority when doing file system I/O\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.daemonProcessType\fR
.RS 4
Nix daemon process resource limits class\&. These limits propagate to build processes\&. \fR\(oqStandard\(cq\fP is the default process type and will apply light resource limits, throttling its CPU usage and I/O bandwidth\&.
.sp
See \fBman launchd\&.plist\fP for explanation of other process types\&.
.sp
\fIType:\fR one of \[u201C]Background\[u201D], \[u201C]Standard\[u201D], \[u201C]Adaptive\[u201D], \[u201C]Interactive\[u201D]
.sp
\fIDefault:\fR \(dqStandard\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.distributedBuilds\fR
.RS 4
Whether to distribute builds to the machines listed in \fBnix\&.buildMachines\fP\&.
.sp
NOTE: This requires services\&.nix\-daemon\&.enable for a multi\-user install\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.extraOptions\fR
.RS 4
Additional text appended to \fInix\&.conf\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR
.sp
.RS 4
.nf
\(aq\(aq
  keep\-outputs = true
  keep\-derivations = true
\(aq\(aq
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.gc\&.automatic\fR
.RS 4
Automatically run the garbage collector at a specific time\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-gc>\fP
.RE
.RE
.PP
\fBnix\&.gc\&.interval\fR
.RS 4
The calendar interval at which the garbage collector will run\&. See the \fBserviceConfig\&.StartCalendarInterval\fP option of the \fBlaunchd\fP module for more info\&.
.sp
\fIType:\fR (submodule) or unique (non\-empty (list of (submodule)))
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
[
  {
    Hour = 3;
    Minute = 15;
    Weekday = 7;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-gc>\fP
.RE
.RE
.PP
\fBnix\&.gc\&.options\fR
.RS 4
Options given to \fInix\-collect\-garbage\fP when the garbage collector is run automatically\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dq\-\-max\-freed $((64 * 1024**3))\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-gc>\fP
.RE
.RE
.PP
\fBnix\&.gc\&.user\fR
.RS 4
User that runs the garbage collector\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-gc>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.enable\fR
.RS 4
Whether to enable Linux builder\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.package\fR
.RS 4
This option specifies the Linux builder to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR \(dqpkgs\&.darwin\&.linux\-builder\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.config\fR
.RS 4
This option specifies extra NixOS configuration for the builder\&. You should first use the Linux builder without changing the builder configuration otherwise you may not be able to build the Linux builder\&.
.sp
\fIType:\fR module
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
({ pkgs, \&.\&.\&. }:

{
  environment\&.systemPackages = [ pkgs\&.neovim ];
})
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.ephemeral\fR
.RS 4
Whether to enable wipe the builder\[u2019]s filesystem on every restart\&.
.sp
This is disabled by default as maintaining the builder\[u2019]s Nix Store reduces rebuilds\&. You can enable this if you don\[u2019]t want your builder to accumulate state\&. \&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.mandatoryFeatures\fR
.RS 4
A list of features mandatory for the Linux builder\&. The builder will be ignored for derivations that don\[u2019]t require all features in this list\&. All mandatory features are automatically included in \fIsupportedFeatures\fP\&.
.sp
This sets the corresponding \fR\(oqnix\&.buildMachines\&.*\&.mandatoryFeatures\(cq\fP option\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR []
.sp
\fIExample:\fR [ \(dqbig\-parallel\(dq ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.maxJobs\fR
.RS 4
The number of concurrent jobs the Linux builder machine supports\&. The build machine will enforce its own limits, but this allows hydra to schedule better since there is no work\-stealing between build machines\&.
.sp
This sets the corresponding \fR\(oqnix\&.buildMachines\&.*\&.maxJobs\(cq\fP option\&.
.sp
\fIType:\fR positive integer, meaning >0
.sp
\fIDefault:\fR 1
.sp
\fIExample:\fR 4
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.protocol\fR
.RS 4
The protocol used for communicating with the build machine\&. Use \fR\(oqssh\-ng\(cq\fP if your remote builder and your local Nix version support that improved protocol\&.
.sp
Use \fR\(oqnull\(cq\fP when trying to change the special localhost builder without a protocol which is for example used by hydra\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dqssh\-ng\(dq
.sp
\fIExample:\fR \(dqssh\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.speedFactor\fR
.RS 4
The relative speed of the Linux builder\&. This is an arbitrary integer that indicates the speed of this builder, relative to other builders\&. Higher is faster\&.
.sp
This sets the corresponding \fR\(oqnix\&.buildMachines\&.*\&.speedFactor\(cq\fP option\&.
.sp
\fIType:\fR positive integer, meaning >0
.sp
\fIDefault:\fR 1
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.supportedFeatures\fR
.RS 4
A list of features supported by the Linux builder\&. The builder will be ignored for derivations that require features not in this list\&.
.sp
This sets the corresponding \fR\(oqnix\&.buildMachines\&.*\&.supportedFeatures\(cq\fP option\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ \(dqkvm\(dq \(dqbenchmark\(dq \(dqbig\-parallel\(dq ]
.sp
\fIExample:\fR [ \(dqkvm\(dq \(dqbig\-parallel\(dq ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.systems\fR
.RS 4
This option specifies system types the build machine can execute derivations on\&.
.sp
This sets the corresponding \fR\(oqnix\&.buildMachines\&.*\&.systems\(cq\fP option\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
\(aq\(aq
  The \(ganixpkgs\&.hostPlatform\&.system\(ga of the build machine\(aqs final NixOS configuration\&.
\(aq\(aq
.fi
.RE
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqx86_64\-linux\(dq
  \(dqaarch64\-linux\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.linux\-builder\&.workingDirectory\fR
.RS 4
The working directory of the Linux builder daemon process\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq/var/lib/darwin\-builder\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/linux\-builder\&.nix>\fP
.RE
.RE
.PP
\fBnix\&.nixPath\fR
.RS 4
The default Nix expression search path, used by the Nix evaluator to look up paths enclosed in angle brackets (e\&.g\&. \fR\(oq<nixpkgs>\(cq\fP)\&.
.sp
Named entries can be specified using an attribute set, if an entry is configured multiple times the value with the lowest ordering will be used\&.
.sp
\fIType:\fR nix path
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
lib\&.optionals cfg\&.channel\&.enable [
  # Include default path <darwin\-config>\&.
  { darwin\-config = \(dq${config\&.environment\&.darwinConfig}\(dq; }
  \(dq/nix/var/nix/profiles/per\-user/root/channels\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.nrBuildUsers\fR
.RS 4
Number of \fR\(oqnixbld\(cq\fP user accounts created to perform secure concurrent builds\&. If you receive an error message saying that \[u201C]all build users are currently in use\[u201D], you should increase this value\&.
.sp
\fIType:\fR signed integer
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.optimise\&.automatic\fR
.RS 4
Automatically run the nix store optimiser at a specific time\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-optimise>\fP
.RE
.RE
.PP
\fBnix\&.optimise\&.interval\fR
.RS 4
The calendar interval at which the optimiser will run\&. See the \fBserviceConfig\&.StartCalendarInterval\fP option of the \fBlaunchd\fP module for more info\&.
.sp
\fIType:\fR (submodule) or unique (non\-empty (list of (submodule)))
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
[
  {
    Hour = 4;
    Minute = 15;
    Weekday = 7;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-optimise>\fP
.RE
.RE
.PP
\fBnix\&.optimise\&.user\fR
.RS 4
User that runs the store optimisation\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-optimise>\fP
.RE
.RE
.PP
\fBnix\&.registry\fR
.RS 4
A system\-wide flake registry\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.registry\&.<name>\&.exact\fR
.RS 4
Whether the \fBfrom\fP reference needs to match exactly\&. If set, a \fBfrom\fP reference like \fR\(oqnixpkgs\(cq\fP does not match with a reference like \fR\(oqnixpkgs/nixos\-20\&.03\(cq\fP\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.registry\&.<name>\&.flake\fR
.RS 4
The flake input \fBfrom\fP is rewritten to\&.
.sp
\fIType:\fR null or (attribute set)
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR nixpkgs
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.registry\&.<name>\&.from\fR
.RS 4
The flake reference to be rewritten\&.
.sp
\fIType:\fR attribute set of (string or signed integer or boolean or package)
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  id = \(dqnixpkgs\(dq;
  type = \(dqindirect\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.registry\&.<name>\&.to\fR
.RS 4
The flake reference \fBfrom\fP is rewritten to\&.
.sp
\fIType:\fR attribute set of (string or signed integer or boolean or package)
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  owner = \(dqmy\-org\(dq;
  repo = \(dqmy\-nixpkgs\(dq;
  type = \(dqgithub\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\fR
.RS 4
Configuration for Nix, see \fBhttps://nixos\&.org/manual/nix/stable/#sec\-conf\-file\fR[1]\fR for avalaible options\&. The value declared here will be translated directly to the key\-value pairs Nix expects\&.
.sp
Nix configurations defined under \fBnix\&.*\fP will be translated and applied to this option\&. In addition, configuration specified in \fBnix\&.extraOptions\fP which will be appended verbatim to the resulting config file\&.
.sp
\fIType:\fR attribute set of (Nix config atom (null, bool, int, float, str, path or package) or list of (Nix config atom (null, bool, int, float, str, path or package)))
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://nixos\&.org/manual/nix/stable/#sec\-conf\-file
.RE
.RE
.PP
\fBnix\&.settings\&.allowed\-users\fR
.RS 4
A list of names of users (separated by whitespace) that are allowed to connect to the Nix daemon\&. As with \fBnix\&.settings\&.trusted\-users\fP, you can specify groups by prefixing them with \fR\(oq@\(cq\fP\&. Also, you can allow all users by specifying \fR\(oq*\(cq\fP\&. The default is \fR\(oq*\(cq\fP\&. Note that trusted users are always allowed to connect\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
[
  \(dq*\(dq
]
.fi
.RE
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq@admin\(dq
  \(dq@builders\(dq
  \(dqalice\(dq
  \(dqbob\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.auto\-optimise\-store\fR
.RS 4
If set to true, Nix automatically detects files in the store that have identical contents, and replaces them with hard links to a single copy\&. This saves disk space\&. If set to false (the default), you can still run nix\-store \-\-optimise to get rid of duplicate files\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.cores\fR
.RS 4
This option defines the maximum number of concurrent tasks during one build\&. It affects, e\&.g\&., \-j option for make\&. The special value 0 means that the builder should use all available CPU cores in the system\&. Some builds may become non\-deterministic with this option; use with care! Packages will only be affected if enableParallelBuilding is set for them\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 0
.sp
\fIExample:\fR 64
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.extra\-sandbox\-paths\fR
.RS 4
Directories from the host filesystem to be included in the sandbox\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq/dev\(dq
  \(dq/proc\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.max\-jobs\fR
.RS 4
This option defines the maximum number of jobs that Nix will try to build in parallel\&. The default is auto, which means it will use all available logical cores\&. It is recommend to set it to the total number of logical cores in your system (e\&.g\&., 16 for two CPUs with 4 cores each and hyper\-threading)\&.
.sp
\fIType:\fR signed integer or value \[u201C]auto\[u201D] (singular enum)
.sp
\fIDefault:\fR \(dqauto\(dq
.sp
\fIExample:\fR 64
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.require\-sigs\fR
.RS 4
If enabled (the default), Nix will only download binaries from binary caches if they are cryptographically signed with any of the keys listed in \fBnix\&.settings\&.trusted\-public\-keys\fP\&. If disabled, signatures are neither required nor checked, so it\[u2019]s strongly recommended that you use only trustworthy caches and https to prevent man\-in\-the\-middle attacks\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.sandbox\fR
.RS 4
If set, Nix will perform builds in a sandboxed environment that it will set up automatically for each build\&. This prevents impurities in builds by disallowing access to dependencies outside of the Nix store by using network and mount namespaces in a chroot environment\&. It doesn\[u2019]t affect derivation hashes, so changing this option will not trigger a rebuild of packages\&.
.sp
\fIType:\fR boolean or value \[u201C]relaxed\[u201D] (singular enum)
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.substituters\fR
.RS 4
List of binary cache URLs used to obtain pre\-built binaries of Nix packages\&.
.sp
By default https://cache\&.nixos\&.org/ is added\&.
.sp
\fIType:\fR list of string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.trusted\-public\-keys\fR
.RS 4
List of public keys used to sign binary caches\&. If \fBnix\&.settings\&.trusted\-public\-keys\fP is enabled, then Nix will use a binary from a binary cache if and only if it is signed by \fIany\fR of the keys listed here\&. By default, only the key for \fR\(oqcache\&.nixos\&.org\(cq\fP is included\&.
.sp
\fIType:\fR list of string
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqhydra\&.nixos\&.org\-1:CNHJZBh9K4tP3EKF6FkkgeVYsS3ohTl+oS0Qa8bezVs=\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.trusted\-substituters\fR
.RS 4
List of binary cache URLs that non\-root users can use (in addition to those specified using \fBnix\&.settings\&.substituters\fP) by passing \fR\(oq\-\-option binary\-caches\(cq\fP to Nix commands\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqhttps://hydra\&.nixos\&.org/\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.settings\&.trusted\-users\fR
.RS 4
A list of names of users that have additional rights when connecting to the Nix daemon, such as the ability to specify additional binary caches, or to import unsigned NARs\&. You can also specify groups by prefixing them with \fR\(oq@\(cq\fP; for instance, \fR\(oq@admin\(cq\fP means all users in the wheel group\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
[
  \(dqroot\(dq
]
.fi
.RE
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqroot\(dq
  \(dqalice\(dq
  \(dq@admin\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnix\&.useDaemon\fR
.RS 4
If set, Nix will use the daemon to perform operations\&. Use this instead of services\&.nix\-daemon\&.enable if you don\[u2019]t want the daemon service to be managed for you\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix>\fP
.RE
.RE
.PP
\fBnixpkgs\&.buildPlatform\fR
.RS 4
Specifies the platform on which nix\-darwin should be built\&. By default, nix\-darwin is built on the system where it runs, but you can change where it\[u2019]s built\&. Setting this option will cause nix\-darwin to be cross\-compiled\&.
.sp
For instance, if you\[u2019]re doing distributed multi\-platform deployment, or if you\[u2019]re building machines, you can set this to match your development system and/or build farm\&.
.sp
Ignored when \fR\(oqnixpkgs\&.pkgs\(cq\fP is set\&.
.sp
\fIType:\fR string or (attribute set)
.sp
\fIDefault:\fR config\&.nixpkgs\&.hostPlatform
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  config = \(dqx86_64\-apple\-darwin\(dq;
  system = \(dqx86_64\-darwin\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/nixpkgs\&.nix>\fP
.RE
.RE
.PP
\fBnixpkgs\&.config\fR
.RS 4
The configuration of the Nix Packages collection\&. (For details, see the Nixpkgs documentation\&.) It allows you to set package configuration options\&.
.sp
Ignored when \fR\(oqnixpkgs\&.pkgs\(cq\fP is set\&.
.sp
\fIType:\fR nixpkgs config
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{ allowBroken = true; allowUnfree = true; }
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/nixpkgs\&.nix>\fP
.RE
.RE
.PP
\fBnixpkgs\&.hostPlatform\fR
.RS 4
Specifies the platform where the nix\-darwin configuration will run\&.
.sp
To cross\-compile, set also \fR\(oqnixpkgs\&.buildPlatform\(cq\fP\&.
.sp
Ignored when \fR\(oqnixpkgs\&.pkgs\(cq\fP is set\&.
.sp
\fIType:\fR string or (attribute set)
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  config = \(dqaarch64\-apple\-darwin\(dq;
  system = \(dqaarch64\-darwin\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/nixpkgs\&.nix>\fP
.RE
.RE
.PP
\fBnixpkgs\&.overlays\fR
.RS 4
List of overlays to use with the Nix Packages collection\&. (For details, see the Nixpkgs documentation\&.) It allows you to override packages globally\&. Each function in the list takes as an argument the \fIoriginal\fR Nixpkgs\&. The first argument should be used for finding dependencies, and the second should be used for overriding recipes\&.
.sp
If \fR\(oqnixpkgs\&.pkgs\(cq\fP is set, overlays specified here will be applied after the overlays that were already present in \fR\(oqnixpkgs\&.pkgs\(cq\fP\&.
.sp
\fIType:\fR list of (nixpkgs overlay)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  (self: super: {
    openssh = super\&.openssh\&.override {
      hpnSupport = true;
      kerberos = self\&.libkrb5;
    };
  })
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/nixpkgs\&.nix>\fP
.RE
.RE
.PP
\fBnixpkgs\&.pkgs\fR
.RS 4
If set, the pkgs argument to all nix\-darwin modules is the value of this option, extended with \fR\(oqnixpkgs\&.overlays\(cq\fP, if that is also set\&. The nix\-darwin and Nixpkgs architectures must match\&. Any other options in \fR\(oqnixpkgs\&.*\(cq\fP, notably \fR\(oqconfig\(cq\fP, will be ignored\&.
.sp
The default value imports the Nixpkgs from \fBnixpkgs.source\fR[1]\fR\&. The \fR\(oqconfig\(cq\fP, \fR\(oqoverlays\(cq\fP, \fR\(oqlocalSystem\(cq\fP, and \fR\(oqcrossSystem\(cq\fP are based on this option\[u2019]s siblings\&.
.sp
This option can be used to increase the performance of evaluation, or to create packages that depend on a container that should be built with the exact same evaluation of Nixpkgs, for example\&. Applications like this should set their default value using \fR\(oqlib\&.mkDefault\(cq\fP, so user\-provided configuration can override it without using \fR\(oqlib\(cq\fP\&.
.sp
\fIType:\fR An evaluation of Nixpkgs; the top level attribute set of packages
.sp
\fIExample:\fR import <nixpkgs> {}
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/nixpkgs\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBnixpkgs\&.source\fP option
.RE
.RE
.PP
\fBnixpkgs\&.source\fR
.RS 4
The path to import Nixpkgs from\&. If you\[u2019]re setting a custom \fBnixpkgs.pkgs\fR[1]\fR or \fR\(oq_module\&.args\&.pkgs\(cq\fP, setting this to something with \fR\(oqrev\(cq\fP and \fR\(oqshortRev\(cq\fP attributes (such as a flake input or \fR\(oqbuiltins\&.fetchGit\(cq\fP result) will also set \fR\(oqsystem\&.nixpkgsRevision\(cq\fP and related options\&. (nix\-darwin only)
.sp
\fIType:\fR path
.sp
\fIDefault:\fR <nixpkgs> or nix\-darwin\[u2019]s nixpkgs flake input
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/nixpkgs\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
see the \fBnixpkgs\&.pkgs\fP option
.RE
.RE
.PP
\fBnixpkgs\&.system\fR
.RS 4
Specifies the Nix platform type on which nix\-darwin should be built\&. It is better to specify \fR\(oqnixpkgs\&.hostPlatform\(cq\fP instead\&.
.sp
Ignored when \fR\(oqnixpkgs\&.pkgs\(cq\fP or \fR\(oqnixpkgs\&.hostPlatform\(cq\fP is set\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR Traditionally builtins\&.currentSystem, but unset when invoking nix\-darwin through lib\&.darwinSystem\&.
.sp
\fIExample:\fR \(dqx86_64\-darwin\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/nix/nixpkgs\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.bash\&.enable\fR
.RS 4
Whether to configure bash as an interactive shell\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/bash>\fP
.RE
.RE
.PP
\fBprograms\&.bash\&.enableCompletion\fR
.RS 4
Enable bash completion for all interactive bash shells\&.
.sp
NOTE\&. This doesn\[u2019]t work with bash 3\&.2, which is the default on macOS\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/bash>\fP
.RE
.RE
.PP
\fBprograms\&.bash\&.interactiveShellInit\fR
.RS 4
Shell script code called during interactive bash shell initialisation\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/bash>\fP
.RE
.RE
.PP
\fBprograms\&.direnv\&.enable\fR
.RS 4
Whether to enable direnv integration\&. Takes care of both installation and setting up the sourcing of the shell\&. Additionally enables nix\-direnv integration\&. \&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/direnv\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.direnv\&.package\fR
.RS 4
The direnv package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.direnv
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/direnv\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.direnv\&.direnvrcExtra\fR
.RS 4
Extra lines to append to the sourced direnvrc
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR
.sp
.RS 4
.nf
\(aq\(aq
  export FOO=\(dqfoo\(dq
  echo \(dqloaded direnv!\(dq
\(aq\(aq
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/direnv\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.direnv\&.loadInNixShell\fR
.RS 4
Whether to enable loading direnv in \fR\(oqnix\-shell\(cq\fP \fR\(oqnix shell\(cq\fP or \fR\(oqnix develop\(cq\fP \&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/direnv\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.direnv\&.nix\-direnv\&.enable\fR
.RS 4
Whether to enable a faster, persistent implementation of use_nix and use_flake, to replace the built\-in one \&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/direnv\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.direnv\&.nix\-direnv\&.package\fR
.RS 4
The nix\-direnv package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.nix\-direnv
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/direnv\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.direnv\&.silent\fR
.RS 4
Whether to enable the hiding of direnv logging \&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/direnv\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.enable\fR
.RS 4
Whether to configure fish as an interactive shell\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.babelfishPackage\fR
.RS 4
The babelfish package to use when useBabelfish is set to true\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR <derivation babelfish\-1\&.2\&.1>
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.interactiveShellInit\fR
.RS 4
Shell script code called during interactive fish shell initialisation\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.loginShellInit\fR
.RS 4
Shell script code called during fish login shell initialisation\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.promptInit\fR
.RS 4
Shell script code used to initialise fish prompt\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.shellAliases\fR
.RS 4
Set of aliases for fish shell\&. See \fBenvironment\&.shellAliases\fP for an option format description\&.
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.shellInit\fR
.RS 4
Shell script code called during fish shell initialisation\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.useBabelfish\fR
.RS 4
If enabled, the configured environment will be translated to native fish using \fBbabelfish\fR[1]\fR\&. Otherwise, \fBforeign\-env\fR[2]\fR will be used\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://github\&.com/bouk/babelfish
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
https://github\&.com/oh\-my\-fish/plugin\-foreign\-env
.RE
.RE
.PP
\fBprograms\&.fish\&.vendor\&.completions\&.enable\fR
.RS 4
Whether fish should use completion files provided by other packages\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.vendor\&.config\&.enable\fR
.RS 4
Whether fish should source configuration snippets provided by other packages\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.fish\&.vendor\&.functions\&.enable\fR
.RS 4
Whether fish should autoload fish functions provided by other packages\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/fish\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.gnupg\&.agent\&.enable\fR
.RS 4
Enables GnuPG agent for every user session\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/gnupg\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.gnupg\&.agent\&.enableSSHSupport\fR
.RS 4
Enable SSH agent support in GnuPG agent\&. Also sets SSH_AUTH_SOCK environment variable correctly\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/gnupg\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.info\&.enable\fR
.RS 4
Whether to enable info pages and the \fBinfo\fP command\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/info>\fP
.RE
.RE
.PP
\fBprograms\&.man\&.enable\fR
.RS 4
Whether to enable manual pages and the \fBman\fP command\&. This also includes \[u201C]man\[u201D] outputs of all \fR\(oqsystemPackages\(cq\fP\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/man\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.nix\-index\&.enable\fR
.RS 4
Whether to enable nix\-index and its command\-not\-found helper\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/nix\-index>\fP
.RE
.RE
.PP
\fBprograms\&.nix\-index\&.package\fR
.RS 4
This option specifies the nix\-index package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR \(dqpkgs\&.nix\-index\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/nix\-index>\fP
.RE
.RE
.PP
\fBprograms\&.ssh\&.knownHosts\fR
.RS 4
The set of system\-wide known SSH hosts\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  {
    hostNames = [ \(dqmyhost\(dq \(dqmyhost\&.mydomain\&.com\(dq \(dq10\&.10\&.1\&.4\(dq ];
    publicKeyFile = \&./pubkeys/myhost_ssh_host_dsa_key\&.pub;
  }
  {
    hostNames = [ \(dqmyhost2\(dq ];
    publicKeyFile = \&./pubkeys/myhost2_ssh_host_dsa_key\&.pub;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBprograms\&.ssh\&.knownHosts\&.<name>\&.certAuthority\fR
.RS 4
This public key is an SSH certificate authority, rather than an individual host\[u2019]s key\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBprograms\&.ssh\&.knownHosts\&.<name>\&.hostNames\fR
.RS 4
A list of host names and/or IP numbers used for accessing the host\[u2019]s ssh service\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBprograms\&.ssh\&.knownHosts\&.<name>\&.publicKey\fR
.RS 4
The public key data for the host\&. You can fetch a public key from a running SSH server with the \fBssh\-keyscan\fP command\&. The public key should not include any host names, only the key type and the key itself\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqecdsa\-sha2\-nistp521 AAAAE2VjZHN\&.\&.\&.UEPg==\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBprograms\&.ssh\&.knownHosts\&.<name>\&.publicKeyFile\fR
.RS 4
The path to the public key file for the host\&. The public key file is read at build time and saved in the Nix store\&. You can fetch a public key file from a running SSH server with the \fBssh\-keyscan\fP command\&. The content of the file should follow the same format as described for the \fR\(oqpublicKey\(cq\fP option\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.enable\fR
.RS 4
Whether to configure tmux\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.enableFzf\fR
.RS 4
Enable fzf keybindings for selecting tmux sessions and panes\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.enableMouse\fR
.RS 4
Enable mouse support for tmux\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.enableSensible\fR
.RS 4
Enable sensible configuration options for tmux\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.enableVim\fR
.RS 4
Enable vim style keybindings for copy mode, and navigation of tmux panes\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.defaultCommand\fR
.RS 4
The default command to use for tmux panes\&.
.sp
\fIType:\fR string or package
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.extraConfig\fR
.RS 4
Extra configuration to add to \fItmux\&.conf\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.iTerm2\fR
.RS 4
Cater to iTerm2 and its tmux integration, as appropriate\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.tmuxOptions\&.<name>\&.enable\fR
.RS 4
Whether this file should be generated\&. This option allows specific files to be disabled\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.tmuxOptions\&.<name>\&.source\fR
.RS 4
Path of the source file\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.tmuxOptions\&.<name>\&.target\fR
.RS 4
Name of symlink\&. Defaults to the attribute name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.tmux\&.tmuxOptions\&.<name>\&.text\fR
.RS 4
Text of the file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/tmux\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.enable\fR
.RS 4
Whether to configure vim\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.enableSensible\fR
.RS 4
Enable sensible configuration options for vim\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.extraKnownPlugins\fR
.RS 4
Custom plugin declarations to add to VAM\[u2019]s knownPlugins\&.
.sp
\fIType:\fR attribute set of package
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  vim\-jsx = pkgs\&.vimUtils\&.buildVimPluginFrom2Nix {
    name = \(dqvim\-javascript\-2016\-07\-29\(dq;
    src = pkgs\&.fetchgit {
      url = \(dqgit://github\&.com/mxw/vim\-jsx\(dq;
      rev = \(dq261114c925ea81eeb4db1651cc1edced66d6b5d6\(dq;
      sha256 = \(dq17pffzwnvsimnnr4ql1qifdh4a0sqqsmcwfiqqzgglvsnzw5vpls\(dq;
    };
    dependencies = [];

  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.plugins\fR
.RS 4
VAM plugin dictionaries to use for vim_configurable\&.
.sp
\fIType:\fR list of (attribute set)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  {
    names = [
      \(dqsurround\(dq
      \(dqvim\-nix\(dq
    ];
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.vimConfig\fR
.RS 4
Extra vimrcConfig to use for vim_configurable\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.vimOptions\&.<name>\&.enable\fR
.RS 4
Whether this file should be generated\&. This option allows specific files to be disabled\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.vimOptions\&.<name>\&.source\fR
.RS 4
Path of the source file\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.vimOptions\&.<name>\&.target\fR
.RS 4
Name of symlink\&. Defaults to the attribute name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.vim\&.vimOptions\&.<name>\&.text\fR
.RS 4
Text of the file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/vim\&.nix>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enable\fR
.RS 4
Whether to configure zsh as an interactive shell\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enableBashCompletion\fR
.RS 4
Enable bash completion for all interactive zsh shells\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enableCompletion\fR
.RS 4
Enable zsh completion for all interactive zsh shells\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enableFzfCompletion\fR
.RS 4
Enable fzf completion\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enableFzfGit\fR
.RS 4
Enable fzf keybindings for C\-g git browsing\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enableFzfHistory\fR
.RS 4
Enable fzf keybinding for Ctrl\-r history search\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enableGlobalCompInit\fR
.RS 4
Enable execution of compinit call for all interactive zsh shells\&.
.sp
This option can be disabled if the user wants to extend its \fR\(oqfpath\(cq\fP and a custom \fR\(oqcompinit\(cq\fP call in the local config is required\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR config\&.programs\&.zsh\&.enableCompletion
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.enableSyntaxHighlighting\fR
.RS 4
Enable zsh\-syntax\-highlighting\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.interactiveShellInit\fR
.RS 4
Shell script code called during interactive zsh shell initialisation\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.loginShellInit\fR
.RS 4
Shell script code called during zsh login shell initialisation\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.promptInit\fR
.RS 4
Shell script code used to initialise the zsh prompt\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dqautoload \-U promptinit && promptinit && prompt suse && setopt prompt_sp\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.shellInit\fR
.RS 4
Shell script code called during zsh shell initialisation\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBprograms\&.zsh\&.variables\fR
.RS 4
A set of environment variables used in the global environment\&. These variables will be set on shell initialisation\&. The value of each variable can be either a string or a list of strings\&. The latter is concatenated, interspersed with colon characters\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/zsh>\fP
.RE
.RE
.PP
\fBsecurity\&.pam\&.enableSudoTouchIdAuth\fR
.RS 4
Enable sudo authentication with Touch ID\&.
.sp
When enabled, this option adds the following line to \fI/etc/pam\&.d/sudo\fP:
.sp
.RS 4
.nf
auth       sufficient     pam_tid\&.so
.fi
.RE
.sp
.RS 4
\fBNote\fP
.br
macOS resets this file when doing a system update\&. As such, sudo authentication with Touch ID won\[u2019]t work after a system update until the nix\-darwin configuration is reapplied\&.
.RE
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/pam\&.nix>\fP
.RE
.RE
.PP
\fBsecurity\&.pki\&.caCertificateBlacklist\fR
.RS 4
A list of blacklisted CA certificate names that won\[u2019]t be imported from the Mozilla Trust Store into \fI/etc/ssl/certs/ca\-certificates\&.crt\fP\&. Use the names from that file\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqWoSign\(dq
  \(dqWoSign China\(dq
  \(dqCA WoSign ECC Root\(dq
  \(dqCertification Authority of WoSign G2\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/pki>\fP
.RE
.RE
.PP
\fBsecurity\&.pki\&.certificateFiles\fR
.RS 4
A list of files containing trusted root certificates in PEM format\&. These are concatenated to form \fI/etc/ssl/certs/ca\-certificates\&.crt\fP, which is used by many programs that use OpenSSL, such as \fBcurl\fP and \fBgit\fP\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ \(dq${pkgs\&.cacert}/etc/ssl/certs/ca\-bundle\&.crt\(dq ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/pki>\fP
.RE
.RE
.PP
\fBsecurity\&.pki\&.certificates\fR
.RS 4
A list of trusted root certificates in PEM format\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[ \(aq\(aq
    NixOS\&.org
    =========
    \-\-\-\-\-BEGIN CERTIFICATE\-\-\-\-\-
    MIIGUDCCBTigAwIBAgIDD8KWMA0GCSqGSIb3DQEBBQUAMIGMMQswCQYDVQQGEwJJ
    TDEWMBQGA1UEChMNU3RhcnRDb20gTHRkLjErMCkGA1UECxMiU2VjdXJlIERpZ2l0
    \&.\&.\&.
    \-\-\-\-\-END CERTIFICATE\-\-\-\-\-
  \(aq\(aq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/pki>\fP
.RE
.RE
.PP
\fBsecurity\&.pki\&.installCACerts\fR
.RS 4
Whether to enable certificate management with nix\-darwin\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/pki>\fP
.RE
.RE
.PP
\fBsecurity\&.sandbox\&.profiles\fR
.RS 4
Definition of sandbox profiles\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sandbox>\fP
.RE
.RE
.PP
\fBsecurity\&.sandbox\&.profiles\&.<name>\&.allowLocalNetworking\fR
.RS 4
Whether to allow localhost network access inside the sandbox\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sandbox>\fP
.RE
.RE
.PP
\fBsecurity\&.sandbox\&.profiles\&.<name>\&.allowNetworking\fR
.RS 4
Whether to allow network access inside the sandbox\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sandbox>\fP
.RE
.RE
.PP
\fBsecurity\&.sandbox\&.profiles\&.<name>\&.allowSystemPaths\fR
.RS 4
Whether to allow read access to FHS paths like /etc and /var\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sandbox>\fP
.RE
.RE
.PP
\fBsecurity\&.sandbox\&.profiles\&.<name>\&.closure\fR
.RS 4
List of store paths to make accessible\&.
.sp
\fIType:\fR list of package
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sandbox>\fP
.RE
.RE
.PP
\fBsecurity\&.sandbox\&.profiles\&.<name>\&.readablePaths\fR
.RS 4
List of paths that should be read\-only inside the sandbox\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sandbox>\fP
.RE
.RE
.PP
\fBsecurity\&.sandbox\&.profiles\&.<name>\&.writablePaths\fR
.RS 4
List of paths that should be read/write inside the sandbox\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sandbox>\fP
.RE
.RE
.PP
\fBsecurity\&.sudo\&.extraConfig\fR
.RS 4
Extra configuration text appended to \fIsudoers\fP\&.
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/security/sudo\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.activate\-system\&.enable\fR
.RS 4
Whether to activate system at boot time\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/activate\-system>\fP
.RE
.RE
.PP
\fBservices\&.autossh\&.sessions\fR
.RS 4
List of AutoSSH sessions to start as systemd services\&. Each service is named \[u2018]autossh\-{session\&.name}\[u2019]\&.
.sp
\fIType:\fR list of (submodule)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  {
    extraArguments = \(dq\-N \-D4343 billremote@socks\&.host\&.net\(dq;
    monitoringPort = 20000;
    name = \(dqsocks\-peer\(dq;
    user = \(dqbill\(dq;
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/autossh\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.autossh\&.sessions\&.*\&.extraArguments\fR
.RS 4
Arguments to be passed to AutoSSH and retransmitted to SSH process\&. Some meaningful options include \-N (don\[u2019]t run remote command), \-D (open SOCKS proxy on local port), \-R (forward remote port), \-L (forward local port), \-v (Enable debug)\&. Check ssh manual for the complete list\&.
.sp
\fIType:\fR string
.sp
\fIExample:\fR \(dq\-N \-D4343 bill@socks\&.example\&.net\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/autossh\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.autossh\&.sessions\&.*\&.monitoringPort\fR
.RS 4
Port to be used by AutoSSH for peer monitoring\&. Note, that AutoSSH also uses mport+1\&. Value of 0 disables the keep\-alive style monitoring
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 0
.sp
\fIExample:\fR 20000
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/autossh\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.autossh\&.sessions\&.*\&.name\fR
.RS 4
Name of the local AutoSSH session
.sp
\fIType:\fR string
.sp
\fIExample:\fR \(dqsocks\-peer\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/autossh\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.autossh\&.sessions\&.*\&.user\fR
.RS 4
Name of the user the AutoSSH session should run as
.sp
\fIType:\fR string
.sp
\fIExample:\fR \(dqbill\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/autossh\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\fR
.RS 4
Attribute set of buildkite agents\&. The attribute key is combined with the hostname and a unique integer to create the final agent name\&. This can be overridden by setting the \fR\(oqname\(cq\fP attribute\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.enable\fR
.RS 4
Whether to enable this buildkite agent
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.package\fR
.RS 4
Which buildkite\-agent derivation to use
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.buildkite\-agent
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.dataDir\fR
.RS 4
The workdir for the agent
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq/var/lib/buildkite\-agent\-\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.extraConfig\fR
.RS 4
Extra lines to be added verbatim to the configuration file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dqdebug=true\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.checkout\fR
.RS 4
The \fR\(oqcheckout\(cq\fP hook script will replace the default checkout routine of the bootstrap\&.sh script\&. You can use this hook to do your own SCM checkout behaviour
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.command\fR
.RS 4
The \fR\(oqcommand\(cq\fP hook script will replace the default implementation of running the build command\&.
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.environment\fR
.RS 4
The \fR\(oqenvironment\(cq\fP hook will run before all other commands, and can be used to set up secrets, data, etc\&. Anything exported in hooks will be available to the build script\&.
.sp
Note: the contents of this file will be copied to the world\-readable Nix store\&.
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
\(aq\(aq
  export SECRET_VAR=\(gahead \-1 /run/keys/secret\(ga
\(aq\(aq
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.post\-artifact\fR
.RS 4
The \fR\(oqpost\-artifact\(cq\fP hook will run just after artifacts are uploaded
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.post\-checkout\fR
.RS 4
The \fR\(oqpost\-checkout\(cq\fP hook will run after the bootstrap script has checked out your projects source code\&.
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.post\-command\fR
.RS 4
The \fR\(oqpost\-command\(cq\fP hook will run after the bootstrap script has run your build commands
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.pre\-artifact\fR
.RS 4
The \fR\(oqpre\-artifact\(cq\fP hook will run just before artifacts are uploaded
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.pre\-checkout\fR
.RS 4
The \fR\(oqpre\-checkout\(cq\fP hook will run just before your projects source code is checked out from your SCM provider
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.pre\-command\fR
.RS 4
The \fR\(oqpre\-command\(cq\fP hook will run just before your build command runs
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.pre\-exit\fR
.RS 4
The \fR\(oqpre\-exit\(cq\fP hook will run just before your build job finishes
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.hooksPath\fR
.RS 4
Path to the directory storing the hooks\&. Consider using \fBservices\&.buildkite\-agents\&.<name>\&.hooks\&.<name>\fP instead\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR generated from \fBservices\&.buildkite\-agents\&.<name>\&.hooks\fP
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.name\fR
.RS 4
The name of the agent as seen in the buildkite dashboard\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq%hostname\-\[u2039]name\[u203A]\-%n\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.preCommands\fR
.RS 4
Extra commands to run before starting buildkite\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.privateSshKeyPath\fR
.RS 4
OpenSSH private key
.sp
A run\-time path to the key file, which is supposed to be provisioned outside of Nix store\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.runtimePackages\fR
.RS 4
Add programs to the buildkite\-agent environment
.sp
\fIType:\fR list of (package or path)
.sp
\fIDefault:\fR [ pkgs\&.bash pkgs\&.gnutar pkgs\&.gzip pkgs\&.git pkgs\&.nix ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.shell\fR
.RS 4
Command that buildkite\-agent 3 will execute when it spawns a shell\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq${pkgs\&.bash}/bin/bash \-e \-c\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.tags\fR
.RS 4
Tags for the agent\&.
.sp
\fIType:\fR attribute set of (string or list of string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  docker = \(dqtrue\(dq;
  queue = \(dqdefault\(dq;
  ruby2 = \(dqtrue\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.buildkite\-agents\&.<name>\&.tokenPath\fR
.RS 4
The token from your Buildkite \[u201C]Agents\[u201D] page\&.
.sp
A run\-time path to the token file, which is supposed to be provisioned outside of Nix store\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/buildkite\-agents\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.cachix\-agent\&.enable\fR
.RS 4
Enable to run Cachix Agent as a system service\&.
.sp
Read \fBCachix Deploy\fR[1]\fR documentation for more information\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/cachix\-agent\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.cachix\&.org/deploy/
.RE
.RE
.PP
\fBservices\&.cachix\-agent\&.package\fR
.RS 4
Package containing cachix executable\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.cachix
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/cachix\-agent\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.cachix\-agent\&.credentialsFile\fR
.RS 4
Required file that needs to contain:
.sp
export CACHIX_AGENT_TOKEN=\[u2026]
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/etc/cachix\-agent\&.token\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/cachix\-agent\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.cachix\-agent\&.logFile\fR
.RS 4
Absolute path to log all stderr and stdout
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR \(dq/var/log/cachix\-agent\&.log\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/cachix\-agent\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.cachix\-agent\&.name\fR
.RS 4
Agent name, usually the same as the hostname\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/cachix\-agent\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.enable\fR
.RS 4
Whether to enable the chunkwm window manager\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.package\fR
.RS 4
This option specifies the chunkwm package to use\&.
.sp
\fIType:\fR package
.sp
\fIExample:\fR pkgs\&.chunkwm
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.extraConfig\fR
.RS 4
Additional commands for \fIchunkwmrc\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dqchunkc tiling::rule \-\-owner Emacs \-\-state tile\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.hotload\fR
.RS 4
Whether to enable hotload\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.plugins\&.border\&.config\fR
.RS 4
Optional border plugin configuration\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dqchunkc set focused_border_color   0xffc0b18b\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.plugins\&.dir\fR
.RS 4
Chunkwm Plugins directory\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/run/current\-system/sw/lib/chunkwm/plugins\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.plugins\&.list\fR
.RS 4
Chunkwm Plugins to enable\&.
.sp
\fIType:\fR list of (one of \[u201C]border\[u201D], \[u201C]ffm\[u201D], \[u201C]tiling\[u201D])
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
[
  \(dqborder\(dq
  \(dqffm\(dq
  \(dqtiling\(dq
]
.fi
.RE
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqtiling\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.chunkwm\&.plugins\&.tiling\&.config\fR
.RS 4
Optional tiling plugin configuration\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIExample:\fR \(dqchunkc set global_desktop_mode   bsp\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/chunkwm\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.dnsmasq\&.enable\fR
.RS 4
Whether to enable DNSmasq\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/dnsmasq\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.dnsmasq\&.package\fR
.RS 4
This option specifies the dnsmasq package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dqpkgs\&.dnsmasq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/dnsmasq\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.dnsmasq\&.addresses\fR
.RS 4
List of domains that will be redirected by the DNSmasq\&.
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{ localhost = \(dq127\&.0\&.0\&.1\(dq; }
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/dnsmasq\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.dnsmasq\&.bind\fR
.RS 4
This option specifies the interface on which DNSmasq will listen\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq127\&.0\&.0\&.1\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/dnsmasq\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.dnsmasq\&.port\fR
.RS 4
This option specifies port on which DNSmasq will listen\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 53
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/dnsmasq\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.emacs\&.enable\fR
.RS 4
Whether to enable the Emacs Daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/emacs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.emacs\&.package\fR
.RS 4
This option specifies the emacs package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR <derivation emacs\-29\&.4>
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/emacs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.emacs\&.additionalPath\fR
.RS 4
This option specifies additional PATH that the emacs daemon would have\&. Typically if you have binaries in your home directory that is what you would add your home path here\&. One caveat is that there won\[u2019]t be shell variable expansion, so you can\[u2019]t use $HOME for example
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq/Users/my_user_name\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/emacs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.emacs\&.exec\fR
.RS 4
Emacs command/binary to execute\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dqemacs\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/emacs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.eternal\-terminal\&.enable\fR
.RS 4
Whether to enable Eternal Terminal server\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/eternal\-terminal\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.eternal\-terminal\&.package\fR
.RS 4
This option specifies the eternal\-terminal package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dqpkgs\&.eternal\-terminal\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/eternal\-terminal\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.eternal\-terminal\&.logSize\fR
.RS 4
The maximum log size\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 20971520
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/eternal\-terminal\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.eternal\-terminal\&.port\fR
.RS 4
The port the server should listen on\&. Will use the server\[u2019]s default (2022) if not specified\&.
.sp
Make sure to open this port in the firewall if necessary\&.
.sp
\fIType:\fR 16 bit unsigned integer; between 0 and 65535 (both inclusive)
.sp
\fIDefault:\fR 2022
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/eternal\-terminal\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.eternal\-terminal\&.silent\fR
.RS 4
If enabled, disables all logging\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/eternal\-terminal\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.eternal\-terminal\&.verbosity\fR
.RS 4
The verbosity level (0\-9)\&.
.sp
\fIType:\fR one of 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
.sp
\fIDefault:\fR 0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/eternal\-terminal\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\fR
.RS 4
Multiple GitHub Runners\&.
.sp
If \fR\(oquser\(cq\fP and \fR\(oqgroup\(cq\fP are set to \fR\(oqnull\(cq\fP, the module will configure nix\-darwin to manage the \fR\(oq_github\-runner\(cq\fP user and group\&. Note that multiple runner configurations share the same user/group, which means they can access resources from other runners\&. Make each runner use its own user and group if this is not what you want\&. In this case, you will have to do the user and group creation yourself\&. If only \fR\(oquser\(cq\fP is set, while \fR\(oqgroup\(cq\fP is set to \fR\(oqnull\(cq\fP, the service will infer the primary group of the \fR\(oquser\(cq\fP\&.
.sp
For each GitHub runner, the system activation script creates the following directories:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq/var/lib/github\-runners/<name>\(cq\fP: State directory to store the runner registration credentials
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq/var/lib/github\-runners/_work/<name>\(cq\fP: Working directory for workflow files\&. The runner only uses this directory if \fR\(oqworkDir\(cq\fP is \fR\(oqnull\(cq\fP (see the \fR\(oqworkDir\(cq\fP option for details)\&.
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq/var/log/github\-runners/<name>\(cq\fP: The launchd service writes the stdout and stderr streams to this directory\&.
.RE
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  runner1 = {
    enable = true;
    name = \(dqrunner1\(dq;
    tokenFile = \(dq/secrets/token1\(dq;
    url = \(dqhttps://github\&.com/owner/repo\(dq;
  };
  runner2 = {
    enable = true;
    name = \(dqrunner2\(dq;
    tokenFile = \(dq/secrets/token2\(dq;
    url = \(dqhttps://github\&.com/owner/repo\(dq;
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.enable\fR
.RS 4
Whether to enable GitHub Actions runner\&.
.sp
Note: GitHub recommends using self\-hosted runners with private repositories only\&. Learn more here: \fBAbout self\-hosted runners\fR[1]\fR\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.github\&.com/en/actions/hosting\-your\-own\-runners/about\-self\-hosted\-runners
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.package\fR
.RS 4
The github\-runner package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.github\-runner
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.ephemeral\fR
.RS 4
If enabled, causes the following behavior:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
Passes the \fR\(oq\-\-ephemeral\(cq\fP flag to the runner configuration script
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
De\-registers and stops the runner with GitHub after it has processed one job
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
Restarts the service after its successful exit
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
On start, wipes the state directory and configures a new runner
.RE
.sp
You should only enable this option if \fR\(oqtokenFile\(cq\fP points to a file which contains a personal access token (PAT)\&. If you\[u2019]re using the option with a registration token, restarting the service will fail as soon as the registration token expired\&.
.sp
Changing this option triggers a new runner registration\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.extraEnvironment\fR
.RS 4
Extra environment variables to set for the runner, as an attrset\&.
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  GIT_CONFIG = \(dq/path/to/git/config\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.extraLabels\fR
.RS 4
Extra labels in addition to the default (unless disabled through the \fR\(oqnoDefaultLabels\(cq\fP option)\&.
.sp
Changing this option triggers a new runner registration\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ \(dqnixos\(dq ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.extraPackages\fR
.RS 4
Extra packages to add to \fR\(oqPATH\(cq\fP of the service to make them available to workflows\&.
.sp
\fIType:\fR list of package
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.group\fR
.RS 4
Group under which to run the service\&.
.sp
If this option and the \fR\(oquser\(cq\fP option is set to \fR\(oqnull\(cq\fP, nix\-darwin creates the \fR\(oqgithub\-runner\(cq\fP user and group\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR groupname
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.name\fR
.RS 4
Name of the runner to configure\&. If null, defaults to the hostname\&.
.sp
Changing this option triggers a new runner registration\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIExample:\fR \(dqnixos\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.noDefaultLabels\fR
.RS 4
Disables adding the default labels\&. Also see the \fR\(oqextraLabels\(cq\fP option\&.
.sp
Changing this option triggers a new runner registration\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.nodeRuntimes\fR
.RS 4
List of Node\&.js runtimes the runner should support\&.
.sp
\fIType:\fR non\-empty (list of value \[u201C]node20\[u201D] (singular enum))
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
[
  \(dqnode20\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.replace\fR
.RS 4
Replace any existing runner with the same name\&.
.sp
Without this flag, registering a new runner with the same name fails\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.runnerGroup\fR
.RS 4
Name of the runner group to add this runner to (defaults to the default runner group)\&.
.sp
Changing this option triggers a new runner registration\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.serviceOverrides\fR
.RS 4
Modify the service\&. Can be used to, e\&.g\&., adjust the sandboxing options\&.
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.tokenFile\fR
.RS 4
The full path to a file which contains either
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
a fine\-grained personal access token (PAT),
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
a classic PAT
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
or a runner registration token
.RE
.sp
Changing this option or the \fR\(oqtokenFile\(cq\fP\[u2019]s content triggers a new runner registration\&.
.sp
We suggest using the fine\-grained PATs\&. A runner registration token is valid only for 1 hour after creation, so the next time the runner configuration changes this will give you hard\-to\-debug HTTP 404 errors in the configure step\&.
.sp
The file should contain exactly one line with the token without any newline\&. (Use \fR\(oqecho \-n \(aq\[u2026]token\[u2026]\(aq > \[u2026]token file\[u2026]\(cq\fP to make sure no newlines sneak in\&.)
.sp
If the file contains a PAT, the service creates a new registration token on startup as needed\&. If a registration token is given, it can be used to re\-register a runner of the same name but is time\-limited as noted above\&.
.sp
For fine\-grained PATs:
.sp
Give it \[u201C]Read and Write access to organization/repository self hosted runners\[u201D], depending on whether it is organization wide or per\-repository\&. You might have to experiment a little, fine\-grained PATs are a \fR\(oqbeta\(cq\fP Github feature and still subject to change; nonetheless they are the best option at the moment\&.
.sp
For classic PATs:
.sp
Make sure the PAT has a scope of \fR\(oqadmin:org\(cq\fP for organization\-wide registrations or a scope of \fR\(oqrepo\(cq\fP for a single repository\&.
.sp
For runner registration tokens:
.sp
Nothing special needs to be done, but updating will break after one hour, so these are not recommended\&.
.sp
\fIType:\fR path
.sp
\fIExample:\fR \(dq/run/secrets/github\-runner/nixos\&.token\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.url\fR
.RS 4
Repository to add the runner to\&.
.sp
Changing this option triggers a new runner registration\&.
.sp
IMPORTANT: If your token is org\-wide (not per repository), you need to provide a github org link, not a single repository, so do it like this \fR\(oqhttps://github\&.com/nixos\(cq\fP, not like this \fR\(oqhttps://github\&.com/nixos/nixpkgs\(cq\fP\&. Otherwise, you are going to get a \fR\(oq404 NotFound\(cq\fP from \fR\(oqPOST https://api\&.github\&.com/actions/runner\-registration\(cq\fP in the configure script\&.
.sp
\fIType:\fR string
.sp
\fIExample:\fR \(dqhttps://github\&.com/nixos/nixpkgs\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.user\fR
.RS 4
User under which to run the service\&.
.sp
If this option and the \fR\(oqgroup\(cq\fP option is set to \fR\(oqnull\(cq\fP, nix\-darwin creates the \fR\(oqgithub\-runner\(cq\fP user and group\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR username
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.github\-runners\&.<name>\&.workDir\fR
.RS 4
Working directory, available as \fR\(oq$GITHUB_WORKSPACE\(cq\fP during workflow runs and used as a default for \fBrepository checkouts\fR[1]\fR\&. The service cleans this directory on every service start\&.
.sp
Changing this option triggers a new runner registration\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/github\-runner/options\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://github\&.com/actions/checkout
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.enable\fR
.RS 4
Whether to enable Gitlab Runner\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.package\fR
.RS 4
Gitlab Runner package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR \(dqpkgs\&.gitlab\-runner\(dq
.sp
\fIExample:\fR pkgs\&.gitlab\-runner_1_11
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.checkInterval\fR
.RS 4
Defines the interval length, in seconds, between new jobs check\&. The default value is 3; if set to 0 or lower, the default value will be used\&. See \fBrunner documentation\fR[1]\fR for more information\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 0
.sp
\fIExample:\fR with lib; (length (attrNames config\&.services\&.gitlab\-runner\&.services)) * 3
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.gitlab\&.com/runner/configuration/advanced\-configuration\&.html#how\-check_interval\-works
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.concurrent\fR
.RS 4
Limits how many jobs globally can be run concurrently\&. The most upper limit of jobs using all defined runners\&. 0 does not mean unlimited\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 1
.sp
\fIExample:\fR config\&.nix\&.maxJobs
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.configFile\fR
.RS 4
Configuration file for gitlab\-runner\&.
.sp
\fBconfigFile\fP takes precedence over \fBservices\fP\&. \fBcheckInterval\fP and \fBconcurrent\fP will be ignored too\&.
.sp
This option is deprecated, please use \fBservices\fP instead\&. You can use \fBregistrationConfigFile\fP and \fBregistrationFlags\fP for settings not covered by this module\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.extraPackages\fR
.RS 4
Extra packages to add to PATH for the gitlab\-runner process\&.
.sp
\fIType:\fR list of package
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.gracefulTermination\fR
.RS 4
Finish all remaining jobs before stopping\&. If not set gitlab\-runner will stop immediatly without waiting for jobs to finish, which will lead to failed builds\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.gracefulTimeout\fR
.RS 4
Time to wait until a graceful shutdown is turned into a forceful one\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dqinfinity\(dq
.sp
\fIExample:\fR \(dq5min 20s\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.prometheusListenAddress\fR
.RS 4
Address (<host>:<port>) on which the Prometheus metrics HTTP server should be listening\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqlocalhost:8080\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.sentryDSN\fR
.RS 4
Data Source Name for tracking of all system level errors to Sentry\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqhttps://public:private@host:port/1\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\fR
.RS 4
GitLab Runner services\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  # runner for building in docker via host\(aqs nix\-daemon
  # nix store will be readable in runner, might be insecure
  nix = {
    # File should contain at least these two variables:
    # \(gaCI_SERVER_URL\(ga
    # \(gaREGISTRATION_TOKEN\(ga
    registrationConfigFile = \(dq/run/secrets/gitlab\-runner\-registration\(dq;
    dockerImage = \(dqalpine\(dq;
    dockerVolumes = [
      \(dq/nix/store:/nix/store:ro\(dq
      \(dq/nix/var/nix/db:/nix/var/nix/db:ro\(dq
      \(dq/nix/var/nix/daemon\-socket:/nix/var/nix/daemon\-socket:ro\(dq
    ];
    dockerDisableCache = true;
    preBuildScript = pkgs\&.writeScript \(dqsetup\-container\(dq \(aq\(aq
      mkdir \-p \-m 0755 /nix/var/log/nix/drvs
      mkdir \-p \-m 0755 /nix/var/nix/gcroots
      mkdir \-p \-m 0755 /nix/var/nix/profiles
      mkdir \-p \-m 0755 /nix/var/nix/temproots
      mkdir \-p \-m 0755 /nix/var/nix/userpool
      mkdir \-p \-m 1777 /nix/var/nix/gcroots/per\-user
      mkdir \-p \-m 1777 /nix/var/nix/profiles/per\-user
      mkdir \-p \-m 0755 /nix/var/nix/profiles/per\-user/root
      mkdir \-p \-m 0700 \(dq$HOME/\&.nix\-defexpr\(dq

      \&. ${pkgs\&.nix}/etc/profile\&.d/nix\&.sh

      ${pkgs\&.nix}/bin/nix\-env \-i ${concatStringsSep \(dq \(dq (with pkgs; [ nix cacert git openssh ])}

      ${pkgs\&.nix}/bin/nix\-channel \-\-add https://nixos\&.org/channels/nixpkgs\-unstable
      ${pkgs\&.nix}/bin/nix\-channel \-\-update nixpkgs
    \(aq\(aq;
    environmentVariables = {
      ENV = \(dq/etc/profile\(dq;
      USER = \(dqroot\(dq;
      NIX_REMOTE = \(dqdaemon\(dq;
      PATH = \(dq/nix/var/nix/profiles/default/bin:/nix/var/nix/profiles/default/sbin:/bin:/sbin:/usr/bin:/usr/sbin\(dq;
      NIX_SSL_CERT_FILE = \(dq/nix/var/nix/profiles/default/etc/ssl/certs/ca\-bundle\&.crt\(dq;
    };
    tagList = [ \(dqnix\(dq ];
  };
  # runner for building docker images
  docker\-images = {
    # File should contain at least these two variables:
    # \(gaCI_SERVER_URL\(ga
    # \(gaREGISTRATION_TOKEN\(ga
    registrationConfigFile = \(dq/run/secrets/gitlab\-runner\-registration\(dq;
    dockerImage = \(dqdocker:stable\(dq;
    dockerVolumes = [
      \(dq/var/run/docker\&.sock:/var/run/docker\&.sock\(dq
    ];
    tagList = [ \(dqdocker\-images\(dq ];
  };
  # runner for executing stuff on host system (very insecure!)
  # make sure to add required packages (including git!)
  # to \(gaenvironment\&.systemPackages\(ga
  shell = {
    # File should contain at least these two variables:
    # \(gaCI_SERVER_URL\(ga
    # \(gaREGISTRATION_TOKEN\(ga
    registrationConfigFile = \(dq/run/secrets/gitlab\-runner\-registration\(dq;
    executor = \(dqshell\(dq;
    tagList = [ \(dqshell\(dq ];
  };
  # runner for everything else
  default = {
    # File should contain at least these two variables:
    # \(gaCI_SERVER_URL\(ga
    # \(gaREGISTRATION_TOKEN\(ga
    registrationConfigFile = \(dq/run/secrets/gitlab\-runner\-registration\(dq;
    dockerImage = \(dqdebian:stable\(dq;
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.buildsDir\fR
.RS 4
Absolute path to a directory where builds will be stored in context of selected executor (Locally, Docker, SSH)\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq/var/lib/gitlab\-runner/builds\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.cloneUrl\fR
.RS 4
Overwrite the URL for the GitLab instance\&. Used if the Runner can\[u2019]t connect to GitLab on the URL GitLab exposes itself\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqhttp://gitlab\&.example\&.local\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.debugTraceDisabled\fR
.RS 4
When set to true Runner will disable the possibility of using the \fR\(oqCI_DEBUG_TRACE\(cq\fP feature\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.dockerAllowedImages\fR
.RS 4
Whitelist allowed images\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqruby:*\(dq
  \(dqpython:*\(dq
  \(dqphp:*\(dq
  \(dqmy\&.registry\&.tld:5000/*:*\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.dockerAllowedServices\fR
.RS 4
Whitelist allowed services\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqpostgres:9\(dq
  \(dqredis:*\(dq
  \(dqmysql:*\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.dockerDisableCache\fR
.RS 4
Disable all container caching\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.dockerExtraHosts\fR
.RS 4
Add a custom host\-to\-IP mapping\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqother\-host:127\&.0\&.0\&.1\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.dockerImage\fR
.RS 4
Docker image to be used\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.dockerPrivileged\fR
.RS 4
Give extended privileges to container\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.dockerVolumes\fR
.RS 4
Bind\-mount a volume and create it if it doesn\[u2019]t exist prior to mounting\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq/var/run/docker\&.sock:/var/run/docker\&.sock\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.environmentVariables\fR
.RS 4
Custom environment variables injected to build environment\&. For secrets you can use \fBregistrationConfigFile\fP with \fR\(oqRUNNER_ENV\(cq\fP variable set\&.
.sp
\fIType:\fR attribute set of string
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  NAME = \(dqvalue\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.executor\fR
.RS 4
Select executor, eg\&. shell, docker, etc\&. See \fBrunner documentation\fR[1]\fR for more information\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dqdocker\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.gitlab\&.com/runner/executors/README\&.html
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.limit\fR
.RS 4
Limit how many jobs can be handled concurrently by this service\&. 0 (default) simply means don\[u2019]t limit\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.maximumTimeout\fR
.RS 4
What is the maximum timeout (in seconds) that will be set for job when using this Runner\&. 0 (default) simply means don\[u2019]t limit\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.postBuildScript\fR
.RS 4
Runner\-specific command script executed after code is pulled and just after build executes\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.preBuildScript\fR
.RS 4
Runner\-specific command script executed after code is pulled, just before build executes\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.preCloneScript\fR
.RS 4
Runner\-specific command script executed before code is pulled\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.protected\fR
.RS 4
When set to true Runner will only run on pipelines triggered on protected branches\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.registrationConfigFile\fR
.RS 4
Absolute path to a file with environment variables used for gitlab\-runner registration\&. A list of all supported environment variables can be found in \fR\(oqgitlab\-runner register \-\-help\(cq\fP\&.
.sp
Ones that you probably want to set is
.sp
\fR\(oqCI_SERVER_URL=<CI server URL>\(cq\fP
.sp
\fR\(oqREGISTRATION_TOKEN=<registration secret>\(cq\fP
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.registrationFlags\fR
.RS 4
Extra command\-line flags passed to \fR\(oqgitlab\-runner register\(cq\fP\&. Execute \fR\(oqgitlab\-runner register \-\-help\(cq\fP for a list of supported flags\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq\-\-docker\-helper\-image my/gitlab\-runner\-helper\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.requestConcurrency\fR
.RS 4
Limit number of concurrent requests for new jobs from GitLab\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.runUntagged\fR
.RS 4
Register to run untagged builds; defaults to \fR\(oqtrue\(cq\fP when \fBtagList\fP is empty\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.services\&.<name>\&.tagList\fR
.RS 4
Tag list\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.sessionServer\fR
.RS 4
The session server allows the user to interact with jobs that the Runner is responsible for\&. A good example of this is the \fBinteractive web terminal\fR[1]\fR\&.
.sp
\fIType:\fR submodule
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  listenAddress = \(dq0\&.0\&.0\&.0:8093\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.gitlab\&.com/ee/ci/interactive_web_terminal/index\&.html
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.sessionServer\&.advertiseAddress\fR
.RS 4
The URL that the Runner will expose to GitLab to be used to access the session server\&. Fallbacks to \fBlistenAddress\fP if not defined\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqrunner\-host\-name\&.tld:8093\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.sessionServer\&.listenAddress\fR
.RS 4
An internal URL to be used for the session server\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq0\&.0\&.0\&.0:8093\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.gitlab\-runner\&.sessionServer\&.sessionTimeout\fR
.RS 4
How long in seconds the session can stay active after the job completes (which will block the job from finishing)\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 1800
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/gitlab\-runner\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.enable\fR
.RS 4
Enable to run Hercules CI Agent as a system service\&.
.sp
\fBHercules CI\fR[1]\fR is a continuous integation service that is centered around Nix\&.
.sp
Support is available at \fBhelp@hercules\-ci\&.com\fR[2]\fR\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://hercules\-ci\&.com
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
mailto:help@hercules\-ci\&.com
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.package\fR
.RS 4
Package containing the bin/hercules\-ci\-agent executable\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.hercules\-ci\-agent
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.logFile\fR
.RS 4
Stdout and sterr of hercules\-ci\-agent process\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/var/log/hercules\-ci\-agent\&.log\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\fR
.RS 4
These settings are written to the \fR\(oqagent\&.toml\(cq\fP file\&.
.sp
Not all settings are listed as options, can be set nonetheless\&.
.sp
For the exhaustive list of settings, see \fBhttps://docs\&.hercules\-ci\&.com/hercules\-ci/reference/agent\-config/\fR[1]\fR\&.
.sp
\fIType:\fR TOML value
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.hercules\-ci\&.com/hercules\-ci/reference/agent\-config/
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.apiBaseUrl\fR
.RS 4
API base URL that the agent will connect to\&.
.sp
When using Hercules CI Enterprise, set this to the URL where your Hercules CI server is reachable\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dqhttps://hercules\-ci\&.com\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.baseDirectory\fR
.RS 4
State directory (secrets, work directory, etc) for agent
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/var/lib/hercules\-ci\-agent\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.binaryCachesPath\fR
.RS 4
Path to a JSON file containing binary cache secret keys\&.
.sp
As these values are confidential, they should not be in the store, but copied over using other means, such as agenix, NixOps \fR\(oqdeployment\&.keys\(cq\fP, or manual installation\&.
.sp
The format is described on \fBhttps://docs\&.hercules\-ci\&.com/hercules\-ci\-agent/binary\-caches\-json/\fR[1]\fR\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR staticSecretsDirectory + \(dq/binary\-caches\&.json\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.hercules\-ci\&.com/hercules\-ci\-agent/binary\-caches\-json/
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.clusterJoinTokenPath\fR
.RS 4
Location of the cluster\-join\-token\&.key file\&.
.sp
You can retrieve the contents of the file when creating a new agent via \fBhttps://hercules\-ci\&.com/dashboard\fR[1]\fR\&.
.sp
As this value is confidential, it should not be in the store, but installed using other means, such as agenix, NixOps \fR\(oqdeployment\&.keys\(cq\fP, or manual installation\&.
.sp
The contents of the file are used for authentication between the agent and the API\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR staticSecretsDirectory + \(dq/cluster\-join\-token\&.key\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://hercules\-ci\&.com/dashboard
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.concurrentTasks\fR
.RS 4
Number of tasks to perform simultaneously\&.
.sp
A task is a single derivation build, an evaluation or an effect run\&. At minimum, you need 2 concurrent tasks for \fR\(oqx86_64\-linux\(cq\fP in your cluster, to allow for import from derivation\&.
.sp
\fR\(oqconcurrentTasks\(cq\fP can be around the CPU core count or lower if memory is the bottleneck\&.
.sp
The optimal value depends on the resource consumption characteristics of your workload, including memory usage and in\-task parallelism\&. This is typically determined empirically\&.
.sp
When scaling, it is generally better to have a double\-size machine than two machines, because each split of resources causes inefficiencies; particularly with regards to build latency because of extra downloads\&.
.sp
\fIType:\fR positive integer, meaning >0, or value \[u201C]auto\[u201D] (singular enum)
.sp
\fIDefault:\fR \(dqauto\(dq, meaning equal to the number of CPU cores\&.
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.labels\fR
.RS 4
A key\-value map of user data\&.
.sp
This data will be available to organization members in the dashboard and API\&.
.sp
The values can be of any TOML type that corresponds to a JSON type, but arrays can not contain tables/objects due to limitations of the TOML library\&. Values involving arrays of non\-primitive types may not be representable currently\&.
.sp
\fIType:\fR TOML value
.sp
\fIDefault:\fR
.sp
.RS 4
.nf
{
  agent\&.source = \(dq\&.\&.\&.\(dq; # One of \(dqnixpkgs\(dq, \(dqflake\(dq, \(dqoverride\(dq
  lib\&.version = \(dq\&.\&.\&.\(dq;
  pkgs\&.version = \(dq\&.\&.\&.\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.secretsJsonPath\fR
.RS 4
Path to a JSON file containing secrets for effects\&.
.sp
As these values are confidential, they should not be in the store, but copied over using other means, such as agenix, NixOps \fR\(oqdeployment\&.keys\(cq\fP, or manual installation\&.
.sp
The format is described on \fBhttps://docs\&.hercules\-ci\&.com/hercules\-ci\-agent/secrets\-json/\fR[1]\fR\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR staticSecretsDirectory + \(dq/secrets\&.json\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://docs\&.hercules\-ci\&.com/hercules\-ci\-agent/secrets\-json/
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.staticSecretsDirectory\fR
.RS 4
This is the default directory to look for statically configured secrets like \fR\(oqcluster\-join\-token\&.key\(cq\fP\&.
.sp
See also \fR\(oqclusterJoinTokenPath\(cq\fP and \fR\(oqbinaryCachesPath\(cq\fP for fine\-grained configuration\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR baseDirectory + \(dq/secrets\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.hercules\-ci\-agent\&.settings\&.workDirectory\fR
.RS 4
The directory in which temporary subdirectories are created for task state\&. This includes sources for Nix evaluation\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR baseDirectory + \(dq/work\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/hercules\-ci\-agent/common\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.ipfs\&.enable\fR
.RS 4
Whether to enable the ipfs daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ipfs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.ipfs\&.enableGarbageCollection\fR
.RS 4
Passes \-\-enable\-gc flag to ipfs daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ipfs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.ipfs\&.package\fR
.RS 4
The ipfs package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR <derivation kubo\-0\&.29\&.0>
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ipfs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.ipfs\&.ipfsPath\fR
.RS 4
Set the IPFS_PATH environment variable\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ipfs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.ipfs\&.logFile\fR
.RS 4
The logfile to use for the ipfs service\&. Alternatively \fBsudo launchctl debug system/org\&.nixos\&.ipfs \-\-stderr\fP can be used to stream the logs to a shell after restarting the service with \fBsudo launchctl kickstart \-k system/org\&.nixos\&.ipfs\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq/var/tmp/ipfs\&.log\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ipfs\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.enable\fR
.RS 4
Whether to enable Enable the jankyborders service\[u2026]
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.package\fR
.RS 4
The jankyborders package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.jankyborders
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.active_color\fR
.RS 4
Sets the border color for the focused window (format: 0xAARRGGBB)\&. For instance, active_color=\[u201C]0xff00ff00\[u201D] creates a green border\&. For Gradient Border : active_color=\[u201C]gradient(top_right=0x9992B3F5,bottom_left=0x9992B3F5)\[u201D]
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq0xFFFFFFFF\(dq
.sp
\fIExample:\fR \(dq0xFFFFFFFF\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.ax_focus\fR
.RS 4
If set to true, the (slower) accessibility API is used to resolve the focused window\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.background_color\fR
.RS 4
Sets the background fill color for all windows (only 0xAARRGGBB arguments supported)\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dq0xFFFFFFFF\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.blacklist\fR
.RS 4
The applications specified here are excluded from being bordered\&. For example, blacklist = [ \[u201C]Safari\[u201D] \[u201C]kitty\[u201D] ] excludes Safari and kitty from being bordered\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqSafari\(dq
  \(dqkitty\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.blur_radius\fR
.RS 4
Sets the blur radius applied to the borders or backgrounds with transparency\&.
.sp
\fIType:\fR floating point number
.sp
\fIDefault:\fR 0\&.0
.sp
\fIExample:\fR 5\&.0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.hidpi\fR
.RS 4
If set to on, the border will be drawn with retina resolution\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.inactive_color\fR
.RS 4
Sets the border color for all windows not in focus (format: 0xAARRGGBB)\&. For Gradient Border : inactive_color=\[u201C]gradient(top_right=0x9992B3F5,bottom_left=0x9992B3F5)\[u201D]
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq0xFFFFFFFF\(dq
.sp
\fIExample:\fR \(dq0xFFFFFFFF\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.style\fR
.RS 4
Specifies the style of the border (either round or square)\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dqround\(dq
.sp
\fIExample:\fR \(dqsquare/round\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.whitelist\fR
.RS 4
Once this list is populated, only applications listed here are considered for receiving a border\&. If the whitelist is empty (default) it is inactive\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqArc\(dq
  \(dqUSB Overdrive\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.jankyborders\&.width\fR
.RS 4
Determines the width of the border\&. For example, width=5\&.0 creates a border 5\&.0 points wide\&.
.sp
\fIType:\fR floating point number
.sp
\fIDefault:\fR 5\&.0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/jankyborders>\fP
.RE
.RE
.PP
\fBservices\&.karabiner\-elements\&.enable\fR
.RS 4
Whether to enable Karabiner\-Elements\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/karabiner\-elements>\fP
.RE
.RE
.PP
\fBservices\&.khd\&.enable\fR
.RS 4
Whether to enable the khd hotkey daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/khd>\fP
.RE
.RE
.PP
\fBservices\&.khd\&.package\fR
.RS 4
This option specifies the khd package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR \(dqpkgs\&.khd\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/khd>\fP
.RE
.RE
.PP
\fBservices\&.khd\&.i3Keybindings\fR
.RS 4
Wether to configure i3 style keybindings for kwm\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/khd>\fP
.RE
.RE
.PP
\fBservices\&.khd\&.khdConfig\fR
.RS 4
Config to use for \fIkhdrc\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dqalt + shift \- r   :   kwmc quit\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/khd>\fP
.RE
.RE
.PP
\fBservices\&.kwm\&.enable\fR
.RS 4
Whether to enable the khd window manager\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/kwm>\fP
.RE
.RE
.PP
\fBservices\&.kwm\&.package\fR
.RS 4
This option specifies the kwm package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dqpkgs\&.kwm\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/kwm>\fP
.RE
.RE
.PP
\fBservices\&.kwm\&.kwmConfig\fR
.RS 4
Config to use for \fIkwmrc\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dqkwmc rule owner=\e\(dqiTerm2\e\(dq properties={role=\e\(dqAXDialog\e\(dq}\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/kwm>\fP
.RE
.RE
.PP
\fBservices\&.lorri\&.enable\fR
.RS 4
Whether to enable the lorri service\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/lorri\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.lorri\&.logFile\fR
.RS 4
The logfile to use for the lorri service\&. Alternatively \fBsudo launchctl debug system/org\&.nixos\&.lorri \-\-stderr\fP can be used to stream the logs to a shell after restarting the service with \fBsudo launchctl kickstart \-k system/org\&.nixos\&.lorri\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq/var/tmp/lorri\&.log\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/lorri\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.mopidy\&.enable\fR
.RS 4
Whether to enable the Mopidy Daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mopidy\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.mopidy\&.package\fR
.RS 4
This option specifies the mopidy package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dqpkgs\&.mopidy\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mopidy\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.mopidy\&.mediakeys\&.enable\fR
.RS 4
Whether to enable the Mopidy OSX Media Keys support daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mopidy\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.mopidy\&.mediakeys\&.package\fR
.RS 4
This option specifies the mediakeys package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dqpkgs\&.pythonPackages\&.osxmpdkeys\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mopidy\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.netbird\&.enable\fR
.RS 4
Whether to enable Netbird daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/netbird\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.netbird\&.package\fR
.RS 4
The package to use for netbird
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.netbird
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/netbird\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.nextdns\&.enable\fR
.RS 4
Whether to enable the NextDNS DNS/53 to DoH Proxy service\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nextdns>\fP
.RE
.RE
.PP
\fBservices\&.nextdns\&.arguments\fR
.RS 4
Additional arguments to be passed to nextdns run\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq\-config\(dq
  \(dq10\&.0\&.3\&.0/24=abcdef\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nextdns>\fP
.RE
.RE
.PP
\fBservices\&.nix\-daemon\&.enable\fR
.RS 4
Whether to enable the nix\-daemon service\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-daemon\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.nix\-daemon\&.enableSocketListener\fR
.RS 4
Whether to make the nix\-daemon service socket activated\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-daemon\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.nix\-daemon\&.logFile\fR
.RS 4
The logfile to use for the nix\-daemon service\&. Alternatively \fBsudo launchctl debug system/org\&.nixos\&.nix\-daemon \-\-stderr\fP can be used to stream the logs to a shell after restarting the service with \fBsudo launchctl kickstart \-k system/org\&.nixos\&.nix\-daemon\fP\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq/var/log/nix\-daemon\&.log\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-daemon\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.nix\-daemon\&.tempDir\fR
.RS 4
The TMPDIR to use for nix\-daemon\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/nix\-daemon\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.ofborg\&.enable\fR
.RS 4
Whether to enable the ofborg builder service\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ofborg>\fP
.RE
.RE
.PP
\fBservices\&.ofborg\&.package\fR
.RS 4
This option specifies the ofborg package to use\&. eg\&.
.sp
(import <ofborg> {})\&.ofborg\&.rs
.sp
$ nix\-channel \-\-add https://github\&.com/NixOS/ofborg/archive/released\&.tar\&.gz ofborg $ nix\-channel \-\-update
.sp
\fIType:\fR package
.sp
\fIExample:\fR pkgs\&.ofborg
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ofborg>\fP
.RE
.RE
.PP
\fBservices\&.ofborg\&.configFile\fR
.RS 4
Configuration file to use for ofborg\&.
.sp
WARNING Don\[u2019]t use a path literal or derivation for this, that would expose credentials in the store making them world readable\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ofborg>\fP
.RE
.RE
.PP
\fBservices\&.ofborg\&.logFile\fR
.RS 4
The logfile to use for the ofborg service\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/var/log/ofborg\&.log\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/ofborg>\fP
.RE
.RE
.PP
\fBservices\&.offlineimap\&.enable\fR
.RS 4
Whether to enable Offlineimap, a software to dispose your mailbox(es) as a local Maildir(s)\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mail/offlineimap\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.offlineimap\&.package\fR
.RS 4
Offlineimap derivation to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR \(dqpkgs\&.offlineimap\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mail/offlineimap\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.offlineimap\&.extraConfig\fR
.RS 4
Additional text to be appended to \fIofflineimaprc\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mail/offlineimap\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.offlineimap\&.path\fR
.RS 4
List of derivations to put in Offlineimap\[u2019]s path\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ pkgs\&.pass pkgs\&.bash pkgs\&.notmuch ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mail/offlineimap\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.offlineimap\&.runQuick\fR
.RS 4
Run only quick synchronizations\&. Ignore any flag updates on IMAP servers\&. If a flag on the remote IMAP changes, and we have the message locally, it will be left untouched in a quick run\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mail/offlineimap\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.offlineimap\&.startInterval\fR
.RS 4
Optional key to start offlineimap services each N seconds
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR 300
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/mail/offlineimap\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.enable\fR
.RS 4
Whether to enable PostgreSQL Server\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.enableTCPIP\fR
.RS 4
Whether PostgreSQL should listen on all network interfaces\&. If disabled, the database can only be accessed via its Unix domain socket or via TCP connections to localhost\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.package\fR
.RS 4
PostgreSQL package to use\&.
.sp
\fIType:\fR package
.sp
\fIExample:\fR pkgs\&.postgresql_11
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.authentication\fR
.RS 4
Defines how users authenticate themselves to the server\&. See the \fBPostgreSQL documentation for pg_hba\&.conf\fR[1]\fR for details on the expected format of this option\&. By default, peer based authentication will be used for users connecting via the Unix socket, and md5 password authentication will be used for users connecting via TCP\&. Any added rules will be inserted above the default rules\&. If you\[u2019]d like to replace the default rules entirely, you can use \fR\(oqlib\&.mkForce\(cq\fP in your module\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://www\&.postgresql\&.org/docs/current/auth\-pg\-hba\-conf\&.html
.RE
.RE
.PP
\fBservices\&.postgresql\&.checkConfig\fR
.RS 4
Check the syntax of the configuration file at compile time
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.dataDir\fR
.RS 4
The data directory for PostgreSQL\&. If left as the default value this directory will automatically be created before the PostgreSQL server starts, otherwise the sysadmin is responsible for ensuring the directory exists with appropriate ownership and permissions\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/var/lib/postgresql/${config\&.services\&.postgresql\&.package\&.psqlSchema}\(dq
.sp
\fIExample:\fR \(dq/var/lib/postgresql/11\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.ensureDatabases\fR
.RS 4
Ensures that the specified databases exist\&. This option will never delete existing databases, especially not when the value of this option is changed\&. This means that databases created once through this option or otherwise have to be removed manually\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dqgitea\(dq
  \(dqnextcloud\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.ensureUsers\fR
.RS 4
Ensures that the specified users exist and have at least the ensured permissions\&. The PostgreSQL users will be identified using peer authentication\&. This authenticates the Unix user with the same name only, and that without the need for a password\&. This option will never delete existing users or remove permissions, especially not when the value of this option is changed\&. This means that users created and permissions assigned once through this option or otherwise have to be removed manually\&.
.sp
\fIType:\fR list of (submodule)
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  {
    name = \(dqnextcloud\(dq;
    ensurePermissions = {
      \(dqDATABASE nextcloud\(dq = \(dqALL PRIVILEGES\(dq;
    };
  }
  {
    name = \(dqsuperuser\(dq;
    ensurePermissions = {
      \(dqALL TABLES IN SCHEMA public\(dq = \(dqALL PRIVILEGES\(dq;
    };
  }
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.ensureUsers\&.*\&.ensurePermissions\fR
.RS 4
Permissions to ensure for the user, specified as an attribute set\&. The attribute names specify the database and tables to grant the permissions for\&. The attribute values specify the permissions to grant\&. You may specify one or multiple comma\-separated SQL privileges here\&.
.sp
For more information on how to specify the target and on which privileges exist, see the \fBGRANT syntax\fR[1]\fR\&. The attributes are used as \fR\(oqGRANT ${attrValue} ON ${attrName}\(cq\fP\&.
.sp
\fIType:\fR attribute set of string
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  \(dqDATABASE \e\(dqnextcloud\e\(dq\(dq = \(dqALL PRIVILEGES\(dq;
  \(dqALL TABLES IN SCHEMA public\(dq = \(dqALL PRIVILEGES\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://www\&.postgresql\&.org/docs/current/sql\-grant\&.html
.RE
.RE
.PP
\fBservices\&.postgresql\&.ensureUsers\&.*\&.name\fR
.RS 4
Name of the user to ensure\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.extraPlugins\fR
.RS 4
List of PostgreSQL plugins\&. PostgreSQL version for each plugin should match version for \fR\(oqservices\&.postgresql\&.package\(cq\fP value\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR with pkgs\&.postgresql_11\&.pkgs; [ postgis pg_repack ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.identMap\fR
.RS 4
Defines the mapping from system users to database users\&.
.sp
The general form is:
.sp
map\-name system\-username database\-username
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.initdbArgs\fR
.RS 4
Additional arguments passed to \fR\(oqinitdb\(cq\fP during data dir initialisation\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq\-\-data\-checksums\(dq
  \(dq\-\-allow\-group\-access\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.initialScript\fR
.RS 4
A file containing SQL statements to execute on first startup\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.logLinePrefix\fR
.RS 4
A printf\-style string that is output at the beginning of each log line\&. Upstream default is \fR\(oq\(aq%m [%p] \(aq\(cq\fP, i\&.e\&. it includes the timestamp\&. We do not include the timestamp, because journal has it anyway\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq[%p] \(dq
.sp
\fIExample:\fR \(dq%m [%p] \(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.port\fR
.RS 4
The port on which PostgreSQL listens\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 5432
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.recoveryConfig\fR
.RS 4
Contents of the \fIrecovery\&.conf\fP file\&.
.sp
\fIType:\fR null or strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.RE
.PP
\fBservices\&.postgresql\&.settings\fR
.RS 4
PostgreSQL configuration\&. Refer to \fBhttps://www\&.postgresql\&.org/docs/11/config\-setting\&.html#CONFIG\-SETTING\-CONFIGURATION\-FILE\fR[1]\fR for an overview of \fR\(oqpostgresql\&.conf\(cq\fP\&.
.sp
.RS 4
\fBNote\fP
.br
String values will automatically be enclosed in single quotes\&. Single quotes will be escaped with two single quotes as described by the upstream documentation linked above\&.
.RE
.sp
\fIType:\fR attribute set of (boolean or floating point number or signed integer or string)
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  log_connections = true;
  log_statement = \(dqall\(dq;
  logging_collector = true
  log_disconnections = true
  log_destination = lib\&.mkForce \(dqsyslog\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/postgresql>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://www\&.postgresql\&.org/docs/11/config\-setting\&.html#CONFIG\-SETTING\-CONFIGURATION\-FILE
.RE
.RE
.PP
\fBservices\&.privoxy\&.enable\fR
.RS 4
Whether to enable the privoxy proxy service\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/privoxy>\fP
.RE
.RE
.PP
\fBservices\&.privoxy\&.package\fR
.RS 4
This option specifies the privoxy package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR <derivation privoxy\-3\&.0\&.34>
.sp
\fIExample:\fR pkgs\&.privoxy
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/privoxy>\fP
.RE
.RE
.PP
\fBservices\&.privoxy\&.confdir\fR
.RS 4
Directory for privoxy files such as \&.action and \&.filter\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/privoxy>\fP
.RE
.RE
.PP
\fBservices\&.privoxy\&.config\fR
.RS 4
Config to use for privoxy
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dqforward / upstream\&.proxy:8080\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/privoxy>\fP
.RE
.RE
.PP
\fBservices\&.privoxy\&.listenAddress\fR
.RS 4
The address and TCP port on which privoxy will listen\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq127\&.0\&.0\&.1:8118\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/privoxy>\fP
.RE
.RE
.PP
\fBservices\&.privoxy\&.templdir\fR
.RS 4
Directory for privoxy template files\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq\e${pkgs\&.privoxy}/etc/templates\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/privoxy>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.enable\fR
.RS 4
Whether to enable the redis database service\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.package\fR
.RS 4
This option specifies the redis package to use
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dqpkgs\&.redis\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.appendOnly\fR
.RS 4
By default data is only periodically persisted to disk, enable this option to use an append\-only file for improved persistence\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.bind\fR
.RS 4
The IP interface to bind to\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq127\&.0\&.0\&.1\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.dataDir\fR
.RS 4
Data directory for the redis database\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR \(dq/var/lib/redis\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.extraConfig\fR
.RS 4
Additional text to be appended to \fIredis\&.conf\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.port\fR
.RS 4
The port for Redis to listen to\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 6379
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.redis\&.unixSocket\fR
.RS 4
The path to the socket to bind to\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq/var/run/redis\&.sock\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/redis>\fP
.RE
.RE
.PP
\fBservices\&.sketchybar\&.enable\fR
.RS 4
Whether to enable sketchybar\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/sketchybar>\fP
.RE
.RE
.PP
\fBservices\&.sketchybar\&.package\fR
.RS 4
The sketchybar package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.sketchybar
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/sketchybar>\fP
.RE
.RE
.PP
\fBservices\&.sketchybar\&.config\fR
.RS 4
Contents of sketchybar\[u2019]s configuration file\&. If empty (the default), the configuration file won\[u2019]t be managed\&.
.sp
See \fBdocumentation\fR[1]\fR and \fBexample\fR[2]\fR\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR
.sp
.RS 4
.nf
\(aq\(aq
  sketchybar \-\-bar height=24
  sketchybar \-\-update
  echo \(dqsketchybar configuration loaded\&.\&.\(dq
\(aq\(aq
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/sketchybar>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://felixkratz\&.github\&.io/SketchyBar/
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
https://github\&.com/FelixKratz/SketchyBar/blob/master/sketchybarrc
.RE
.RE
.PP
\fBservices\&.sketchybar\&.extraPackages\fR
.RS 4
Extra packages to add to PATH\&.
.sp
\fIType:\fR list of package
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ pkgs\&.jq ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/sketchybar>\fP
.RE
.RE
.PP
\fBservices\&.skhd\&.enable\fR
.RS 4
Whether to enable the skhd hotkey daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/skhd>\fP
.RE
.RE
.PP
\fBservices\&.skhd\&.package\fR
.RS 4
This option specifies the skhd package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR <derivation skhd\-0\&.3\&.9>
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/skhd>\fP
.RE
.RE
.PP
\fBservices\&.skhd\&.skhdConfig\fR
.RS 4
Config to use for \fIskhdrc\fP\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dqalt + shift \- r   :   chunkc quit\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/skhd>\fP
.RE
.RE
.PP
\fBservices\&.spacebar\&.enable\fR
.RS 4
Whether to enable the spacebar spacebar\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/spacebar>\fP
.RE
.RE
.PP
\fBservices\&.spacebar\&.package\fR
.RS 4
The spacebar package to use\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/spacebar>\fP
.RE
.RE
.PP
\fBservices\&.spacebar\&.config\fR
.RS 4
Key/Value pairs to pass to spacebar\[u2019]s \[u2018]config\[u2019] domain, via the configuration file\&.
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  clock_format     = \(dq%R\(dq;
  background_color = \(dq0xff202020\(dq;
  foreground_color = \(dq0xffa8a8a8\(dq;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/spacebar>\fP
.RE
.RE
.PP
\fBservices\&.spacebar\&.extraConfig\fR
.RS 4
Extra arbitrary configuration to append to the configuration file\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR
.sp
.RS 4
.nf
echo \(dqspacebar config loaded\&.\&.\&.\(dq
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/spacebar>\fP
.RE
.RE
.PP
\fBservices\&.spotifyd\&.enable\fR
.RS 4
Whether to enable the spotifyd service\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/spotifyd\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.spotifyd\&.package\fR
.RS 4
The spotifyd package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dqpkgs\&.spotifyd\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/spotifyd\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.spotifyd\&.settings\fR
.RS 4
Configuration for spotifyd, see \fBhttps://spotifyd\&.github\&.io/spotifyd/config/File\&.html\fR[1]\fR for supported values\&.
.sp
\fIType:\fR null or TOML value
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  bitrate = 160;
  volume_normalisation = true;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/spotifyd\&.nix>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://spotifyd\&.github\&.io/spotifyd/config/File\&.html
.RE
.RE
.PP
\fBservices\&.synapse\-bt\&.enable\fR
.RS 4
Whether to run Synapse BitTorrent Daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synapse\-bt\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.synapse\-bt\&.package\fR
.RS 4
Synapse BitTorrent package to use\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR \(dqpkgs\&.synapse\-bt\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synapse\-bt\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.synapse\-bt\&.downloadDir\fR
.RS 4
Download directory for Synapse BitTorrent\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/var/lib/synapse\-bt\(dq
.sp
\fIExample:\fR \(dq/var/lib/synapse\-bt/downloads\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synapse\-bt\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.synapse\-bt\&.extraConfig\fR
.RS 4
Extra configuration options for Synapse BitTorrent\&.
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synapse\-bt\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.synapse\-bt\&.port\fR
.RS 4
The port on which Synapse BitTorrent listens\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 16384
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synapse\-bt\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.package\fR
.RS 4
The package used for the synergy client and server\&.
.sp
\fIType:\fR package
.sp
\fIDefault:\fR \(dqpkgs\&.synergy\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.client\&.enable\fR
.RS 4
Whether to enable the Synergy client (receive keyboard and mouse events from a Synergy server)\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.client\&.autoStart\fR
.RS 4
Whether the Synergy client should be started automatically\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.client\&.screenName\fR
.RS 4
Use the given name instead of the hostname to identify ourselves to the server\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.client\&.serverAddress\fR
.RS 4
The server address is of the form: [hostname][:port]\&. The hostname must be the address or hostname of the server\&. The port overrides the default port, 24800\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.client\&.tls\&.enable\fR
.RS 4
Whether to enable Whether TLS encryption should be used\&.
.sp
Using this requires a TLS certificate that can be generated by starting the Synergy GUI once and entering a valid product key\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.client\&.tls\&.cert\fR
.RS 4
The TLS certificate to use for encryption\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq\(ti/\&.synergy/SSL/Synergy\&.pem\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.server\&.enable\fR
.RS 4
Whether to enable the Synergy server (send keyboard and mouse events)\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.server\&.address\fR
.RS 4
Address on which to listen for clients\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.server\&.autoStart\fR
.RS 4
Whether the Synergy server should be started automatically\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.server\&.configFile\fR
.RS 4
The Synergy server configuration file\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq/etc/synergy\-server\&.conf\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.server\&.screenName\fR
.RS 4
Use the given name instead of the hostname to identify this screen in the configuration\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.server\&.tls\&.enable\fR
.RS 4
Whether to enable Whether TLS encryption should be used\&.
.sp
Using this requires a TLS certificate that can be generated by starting the Synergy GUI once and entering a valid product key\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.synergy\&.server\&.tls\&.cert\fR
.RS 4
The TLS certificate to use for encryption\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dq\(ti/\&.synergy/SSL/Synergy\&.pem\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/synergy>\fP
.RE
.RE
.PP
\fBservices\&.tailscale\&.enable\fR
.RS 4
Whether to enable Tailscale client daemon\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/tailscale\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.tailscale\&.package\fR
.RS 4
The package to use for tailscale
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.tailscale
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/tailscale\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.tailscale\&.overrideLocalDns\fR
.RS 4
This option implements \fR\(oqOverride local DNS\(cq\fP as it is not yet implemented in Tailscaled\-on\-macOS\&.
.sp
To use this option, in the Tailscale control panel:
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
at least one DNS server is added
.RE
.RS 4
\h'-3'\fB2\&.\fP\h'1'\c
\fR\(oqOverride local DNS\(cq\fP is enabled
.RE
.sp
As this option sets 100\&.100\&.100\&.100 as your sole DNS server, if the requirements above are not met, all non\-MagicDNS queries WILL fail\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/tailscale\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.telegraf\&.enable\fR
.RS 4
Whether to enable telegraf agent\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIExample:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/monitoring/telegraf\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.telegraf\&.package\fR
.RS 4
Which telegraf derivation to use
.sp
\fIType:\fR package
.sp
\fIDefault:\fR pkgs\&.telegraf
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/monitoring/telegraf\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.telegraf\&.configUrl\fR
.RS 4
Url to fetch config from
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/monitoring/telegraf\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.telegraf\&.environmentFiles\fR
.RS 4
File to load as environment file\&. This is useful to avoid putting secrets into the nix store\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq/run/keys/telegraf\&.env\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/monitoring/telegraf\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.telegraf\&.extraConfig\fR
.RS 4
Extra configuration options for telegraf
.sp
\fIType:\fR TOML value
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  inputs = {
    statsd = {
      delete_timings = true;
      service_address = \(dq:8125\(dq;
    };
  };
  outputs = {
    influxdb = {
      database = \(dqtelegraf\(dq;
      urls = [
        \(dqhttp://localhost:8086\(dq
      ];
    };
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/monitoring/telegraf\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.trezord\&.enable\fR
.RS 4
Enable Trezor bridge daemon, for use with Trezor hardware wallets\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/trezord\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.trezord\&.emulator\&.enable\fR
.RS 4
Enable Trezor emulator support\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/trezord\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.trezord\&.emulator\&.port\fR
.RS 4
Listening port for the Trezor emulator\&.
.sp
\fIType:\fR 16 bit unsigned integer; between 0 and 65535 (both inclusive)
.sp
\fIDefault:\fR 21324
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/trezord\&.nix>\fP
.RE
.RE
.PP
\fBservices\&.yabai\&.enable\fR
.RS 4
Whether to enable the yabai window manager\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/yabai>\fP
.RE
.RE
.PP
\fBservices\&.yabai\&.enableScriptingAddition\fR
.RS 4
Whether to enable yabai\[u2019]s scripting\-addition\&. SIP must be disabled for this to work\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/yabai>\fP
.RE
.RE
.PP
\fBservices\&.yabai\&.package\fR
.RS 4
The yabai package to use\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR <derivation yabai\-7\&.1\&.2>
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/yabai>\fP
.RE
.RE
.PP
\fBservices\&.yabai\&.config\fR
.RS 4
Key/Value pairs to pass to yabai\[u2019]s \[u2018]config\[u2019] domain, via the configuration file\&.
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  focus_follows_mouse = \(dqautoraise\(dq;
  mouse_follows_focus = \(dqoff\(dq;
  window_placement    = \(dqsecond_child\(dq;
  window_opacity      = \(dqoff\(dq;
  top_padding         = 36;
  bottom_padding      = 10;
  left_padding        = 10;
  right_padding       = 10;
  window_gap          = 10;
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/yabai>\fP
.RE
.RE
.PP
\fBservices\&.yabai\&.extraConfig\fR
.RS 4
Extra arbitrary configuration to append to the configuration file
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR
.sp
.RS 4
.nf
yabai \-m rule \-\-add app=\(aqSystem Preferences\(aq manage=off
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/services/yabai>\fP
.RE
.RE
.PP
\fBsystem\&.activationScripts\&.<name>\&.enable\fR
.RS 4
Whether this file should be generated\&. This option allows specific files to be disabled\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/activation\-scripts\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.activationScripts\&.<name>\&.source\fR
.RS 4
Path of the source file\&.
.sp
\fIType:\fR path
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/activation\-scripts\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.activationScripts\&.<name>\&.target\fR
.RS 4
Name of symlink\&. Defaults to the attribute name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\[u2039]name\[u203A]\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/activation\-scripts\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.activationScripts\&.<name>\&.text\fR
.RS 4
Text of the file\&.
.sp
\fIType:\fR strings concatenated with \[u201C]\en\[u201D]
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/activation\-scripts\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.checks\&.verifyBuildUsers\fR
.RS 4
Whether to run the Nix build users validation checks\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/checks\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.checks\&.verifyNixChannels\fR
.RS 4
Whether to run the nix\-channels validation checks\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/checks\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.checks\&.verifyNixPath\fR
.RS 4
Whether to run the NIX_PATH validation checks\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/checks\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.configurationRevision\fR
.RS 4
The Git revision of the top\-level flake from which this configuration was built\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/version\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.darwinLabel\fR
.RS 4
Label to be used in the names of generated outputs\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/version\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.\(dq\&.GlobalPreferences\(dq\&.\(dqcom\&.apple\&.mouse\&.scaling\(dq\fR
.RS 4
Sets the mouse tracking speed\&. Found in the \[u201C]Mouse\[u201D] section of \[u201C]System Preferences\[u201D]\&. Set to \-1\&.0 to disable mouse acceleration\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \-1\&.0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/GlobalPreferences\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.\(dq\&.GlobalPreferences\(dq\&.\(dqcom\&.apple\&.sound\&.beep\&.sound\(dq\fR
.RS 4
Sets the system\-wide alert sound\&. Found under \[u201C]Sound Effects\[u201D] in the \[u201C]Sound\[u201D] section of \[u201C]System Preferences\[u201D]\&. Look in \[u201C]/System/Library/Sounds\[u201D] for possible candidates\&.
.sp
\fIType:\fR null or path
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/GlobalPreferences\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.ActivityMonitor\&.IconType\fR
.RS 4
Change the icon in the dock when running\&.
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
0: Application Icon
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
2: Network Usage
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
3: Disk Activity
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
5: CPU Usage
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
6: CPU History Default is null\&.
.RE
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/ActivityMonitor\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.ActivityMonitor\&.OpenMainWindow\fR
.RS 4
Open the main window when opening Activity Monitor\&. Default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/ActivityMonitor\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.ActivityMonitor\&.ShowCategory\fR
.RS 4
Change which processes to show\&.
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
100: All Processes
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
101: All Processes, Hierarchally
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
102: My Processes
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
103: System Processes
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
104: Other User Processes
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
105: Active Processes
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
106: Inactive Processes
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
107: Windowed Processes Default is 100\&.
.RE
.sp
\fIType:\fR null or one of 100, 101, 102, 103, 104, 105, 106, 107
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/ActivityMonitor\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.ActivityMonitor\&.SortColumn\fR
.RS 4
Which column to sort the main activity page (such as \[u201C]CPUUsage\[u201D])\&. Default is null\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/ActivityMonitor\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.ActivityMonitor\&.SortDirection\fR
.RS 4
The sort direction of the sort column (0 is decending)\&. Default is null\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/ActivityMonitor\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.CustomSystemPreferences\fR
.RS 4
Sets custom system preferences
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  NSGlobalDomain = {
    TISRomanSwitchState = 1;
  };
  \(dqcom\&.apple\&.Safari\(dq = {
    \(dqcom\&.apple\&.Safari\&.ContentPageGroupIdentifier\&.WebKit2DeveloperExtrasEnabled\(dq = true;
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/CustomPreferences\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.CustomUserPreferences\fR
.RS 4
Sets custom user preferences
.sp
\fIType:\fR attribute set
.sp
\fIDefault:\fR { }
.sp
\fIExample:\fR
.sp
.RS 4
.nf
{
  NSGlobalDomain = {
    TISRomanSwitchState = 1;
  };
  \(dqcom\&.apple\&.Safari\(dq = {
    \(dqcom\&.apple\&.Safari\&.ContentPageGroupIdentifier\&.WebKit2DeveloperExtrasEnabled\(dq = true;
  };
}
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/CustomPreferences\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.LaunchServices\&.LSQuarantine\fR
.RS 4
Whether to enable quarantine for downloaded applications\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/LaunchServices\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleEnableMouseSwipeNavigateWithScrolls\fR
.RS 4
Enables swiping left or right with two fingers to navigate backward or forward\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleEnableSwipeNavigateWithScrolls\fR
.RS 4
Enables swiping left or right with two fingers to navigate backward or forward\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleFontSmoothing\fR
.RS 4
Sets the level of font smoothing (sub\-pixel font rendering)\&.
.sp
\fIType:\fR null or one of 0, 1, 2
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleICUForce24HourTime\fR
.RS 4
Whether to use 24\-hour or 12\-hour time\&. The default is based on region settings\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleInterfaceStyle\fR
.RS 4
Set to \[u2018]Dark\[u2019] to enable dark mode, or leave unset for normal mode\&.
.sp
\fIType:\fR null or value \[u201C]Dark\[u201D] (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleInterfaceStyleSwitchesAutomatically\fR
.RS 4
Whether to automatically switch between light and dark mode\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleKeyboardUIMode\fR
.RS 4
Configures the keyboard control behavior\&. Mode 3 enables full keyboard control\&.
.sp
\fIType:\fR null or value 3 (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleMeasurementUnits\fR
.RS 4
Whether to use centimeters (metric) or inches (US, UK) as the measurement unit\&. The default is based on region settings\&.
.sp
\fIType:\fR null or one of \[u201C]Centimeters\[u201D], \[u201C]Inches\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleMetricUnits\fR
.RS 4
Whether to use the metric system\&. The default is based on region settings\&.
.sp
\fIType:\fR null or one of 0, 1
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.ApplePressAndHoldEnabled\fR
.RS 4
Whether to enable the press\-and\-hold feature\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleScrollerPagingBehavior\fR
.RS 4
Jump to the spot that\[u2019]s clicked on the scroll bar\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleShowAllExtensions\fR
.RS 4
Whether to show all file extensions in Finder\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleShowAllFiles\fR
.RS 4
Whether to always show hidden files\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleShowScrollBars\fR
.RS 4
When to show the scrollbars\&. Options are \[u2018]WhenScrolling\[u2019], \[u2018]Automatic\[u2019] and \[u2018]Always\[u2019]\&.
.sp
\fIType:\fR null or one of \[u201C]WhenScrolling\[u201D], \[u201C]Automatic\[u201D], \[u201C]Always\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleTemperatureUnit\fR
.RS 4
Whether to use Celsius or Fahrenheit\&. The default is based on region settings\&.
.sp
\fIType:\fR null or one of \[u201C]Celsius\[u201D], \[u201C]Fahrenheit\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.AppleWindowTabbingMode\fR
.RS 4
Sets the window tabbing when opening a new document: \[u2018]manual\[u2019], \[u2018]always\[u2019], or \[u2018]fullscreen\[u2019]\&. The default is \[u2018]fullscreen\[u2019]\&.
.sp
\fIType:\fR null or one of \[u201C]manual\[u201D], \[u201C]always\[u201D], \[u201C]fullscreen\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.InitialKeyRepeat\fR
.RS 4
Apple menu > System Preferences > Keyboard
.sp
If you press and hold certain keyboard keys when in a text area, the key\[u2019]s character begins to repeat\&. For example, the Delete key continues to remove text for as long as you hold it down\&.
.sp
This sets how long you must hold down the key before it starts repeating\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.KeyRepeat\fR
.RS 4
Apple menu > System Preferences > Keyboard
.sp
If you press and hold certain keyboard keys when in a text area, the key\[u2019]s character begins to repeat\&. For example, the Delete key continues to remove text for as long as you hold it down\&.
.sp
This sets how fast it repeats once it starts\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSAutomaticCapitalizationEnabled\fR
.RS 4
Whether to enable automatic capitalization\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSAutomaticDashSubstitutionEnabled\fR
.RS 4
Whether to enable smart dash substitution\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSAutomaticInlinePredictionEnabled\fR
.RS 4
Whether to enable inline predictive text\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSAutomaticPeriodSubstitutionEnabled\fR
.RS 4
Whether to enable smart period substitution\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSAutomaticQuoteSubstitutionEnabled\fR
.RS 4
Whether to enable smart quote substitution\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSAutomaticSpellingCorrectionEnabled\fR
.RS 4
Whether to enable automatic spelling correction\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSAutomaticWindowAnimationsEnabled\fR
.RS 4
Whether to animate opening and closing of windows and popovers\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSDisableAutomaticTermination\fR
.RS 4
Whether to disable the automatic termination of inactive apps\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSDocumentSaveNewDocumentsToCloud\fR
.RS 4
Whether to save new documents to iCloud by default\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSNavPanelExpandedStateForSaveMode\fR
.RS 4
Whether to use expanded save panel by default\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSNavPanelExpandedStateForSaveMode2\fR
.RS 4
Whether to use expanded save panel by default\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSScrollAnimationEnabled\fR
.RS 4
Whether to enable smooth scrolling\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSTableViewDefaultSizeMode\fR
.RS 4
Sets the size of the finder sidebar icons: 1 (small), 2 (medium) or 3 (large)\&. The default is 3\&.
.sp
\fIType:\fR null or one of 1, 2, 3
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSTextShowsControlCharacters\fR
.RS 4
Whether to display ASCII control characters using caret notation in standard text views\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSUseAnimatedFocusRing\fR
.RS 4
Whether to enable the focus ring animation\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSWindowResizeTime\fR
.RS 4
Sets the speed speed of window resizing\&. The default is given in the example\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR 0\&.2
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.NSWindowShouldDragOnGesture\fR
.RS 4
Whether to enable moving window by holding anywhere on it like on Linux\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.PMPrintingExpandedStateForPrint\fR
.RS 4
Whether to use the expanded print panel by default\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.PMPrintingExpandedStateForPrint2\fR
.RS 4
Whether to use the expanded print panel by default\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&._HIHideMenuBar\fR
.RS 4
Whether to autohide the menu bar\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.keyboard\&.fnState\(dq\fR
.RS 4
Use F1, F2, etc\&. keys as standard function keys\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.mouse\&.tapBehavior\(dq\fR
.RS 4
Configures the trackpad tap behavior\&. Mode 1 enables tap to click\&.
.sp
\fIType:\fR null or value 1 (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.sound\&.beep\&.feedback\(dq\fR
.RS 4
Apple menu > System Preferences > Sound
.sp
Make a feedback sound when the system volume changed\&. This setting accepts the integers 0 or 1\&. Defaults to 1\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.sound\&.beep\&.volume\(dq\fR
.RS 4
Apple menu > System Preferences > Sound
.sp
Sets the beep/alert volume level from 0\&.000 (muted) to 1\&.000 (100% volume)\&.
.sp
75% = 0\&.7788008
.sp
50% = 0\&.6065307
.sp
25% = 0\&.4723665
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.springing\&.delay\(dq\fR
.RS 4
Set the spring loading delay for directories\&. The default is given in the example\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR 1\&.0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.springing\&.enabled\(dq\fR
.RS 4
Whether to enable spring loading (expose) for directories\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.swipescrolldirection\(dq\fR
.RS 4
Whether to enable \[u201C]Natural\[u201D] scrolling direction\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.trackpad\&.enableSecondaryClick\(dq\fR
.RS 4
Whether to enable trackpad secondary click\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.trackpad\&.forceClick\(dq\fR
.RS 4
Whether to enable trackpad force click\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.trackpad\&.scaling\(dq\fR
.RS 4
Configures the trackpad tracking speed (0 to 3)\&. The default is \[u201C]1\[u201D]\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.NSGlobalDomain\&.\(dqcom\&.apple\&.trackpad\&.trackpadCornerClickBehavior\(dq\fR
.RS 4
Configures the trackpad corner click behavior\&. Mode 1 enables right click\&.
.sp
\fIType:\fR null or value 1 (singular enum)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/NSGlobalDomain\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.SoftwareUpdate\&.AutomaticallyInstallMacOSUpdates\fR
.RS 4
Automatically install Mac OS software updates\&. Defaults to false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/SoftwareUpdate\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.AppWindowGroupingBehavior\fR
.RS 4
Grouping strategy when showing windows from an application\&. false means \[u201C]One at a time\[u201D] true means \[u201C]All at once\[u201D]
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.AutoHide\fR
.RS 4
Auto hide stage strip showing recent apps\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.EnableStandardClickToShowDesktop\fR
.RS 4
Click wallpaper to reveal desktop Clicking your wallpaper will move all windows out of the way to allow access to your desktop items and widgets\&. Default is true\&. false means \[u201C]Only in Stage Manager\[u201D] true means \[u201C]Always\[u201D]
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.GloballyEnabled\fR
.RS 4
Enable Stage Manager Stage Manager arranges your recent windows into a single strip for reduced clutter and quick access\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.HideDesktop\fR
.RS 4
Hide items in Stage Manager\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.StageManagerHideWidgets\fR
.RS 4
Hide widgets in Stage Manager\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.StandardHideDesktopIcons\fR
.RS 4
Hide items on desktop\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.WindowManager\&.StandardHideWidgets\fR
.RS 4
Hide widgets on desktop\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/WindowManager\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.alf\&.allowdownloadsignedenabled\fR
.RS 4
Apple menu > System Preferences > Security and Privacy > Firewall
.sp
Allows any downloaded Application that has been signed to accept incoming requests\&. Default is 0\&.
.sp
0 = disabled 1 = enabled
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/alf\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.alf\&.allowsignedenabled\fR
.RS 4
Apple menu > System Preferences > Security and Privacy > Firewall
.sp
Allows any signed Application to accept incoming requests\&. Default is true\&.
.sp
0 = disabled 1 = enabled
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/alf\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.alf\&.globalstate\fR
.RS 4
Apple menu > System Preferences > Security and Privacy > Firewall
.sp
Enable the internal firewall to prevent unauthorised applications, programs and services from accepting incoming connections\&.
.sp
0 = disabled 1 = enabled 2 = blocks all connections except for essential services
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/alf\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.alf\&.loggingenabled\fR
.RS 4
Apple menu > System Preferences > Security and Privacy > Firewall
.sp
Enable logging of requests made to the firewall\&. Default is 0\&.
.sp
0 = disabled 1 = enabled
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/alf\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.alf\&.stealthenabled\fR
.RS 4
Apple menu > System Preferences > Security and firewall
.sp
Drops incoming requests via ICMP such as ping requests\&. Default is 0\&.
.sp
0 = disabled 1 = enabled
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/alf\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.enable\-spring\-load\-actions\-on\-all\-items\fR
.RS 4
Enable spring loading for all Dock items\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.appswitcher\-all\-displays\fR
.RS 4
Whether to display the appswitcher on all displays or only the main one\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.autohide\fR
.RS 4
Whether to automatically hide and show the dock\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.autohide\-delay\fR
.RS 4
Sets the speed of the autohide delay\&. The default is given in the example\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR 0\&.24
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.autohide\-time\-modifier\fR
.RS 4
Sets the speed of the animation when hiding/showing the Dock\&. The default is given in the example\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR 1\&.0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.dashboard\-in\-overlay\fR
.RS 4
Whether to hide Dashboard as a Space\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.expose\-animation\-duration\fR
.RS 4
Sets the speed of the Mission Control animations\&. The default is given in the example\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR 1\&.0
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.expose\-group\-by\-app\fR
.RS 4
Whether to group windows by application in Mission Control\[u2019]s Expos\[u00E9]\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.largesize\fR
.RS 4
Magnified icon size on hover\&. The default is 16\&.
.sp
\fIType:\fR null or integer between 16 and 128 (both inclusive)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.launchanim\fR
.RS 4
Animate opening applications from the Dock\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.magnification\fR
.RS 4
Magnify icon on hover\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.mineffect\fR
.RS 4
Set the minimize/maximize window effect\&. The default is genie\&.
.sp
\fIType:\fR null or one of \[u201C]genie\[u201D], \[u201C]suck\[u201D], \[u201C]scale\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.minimize\-to\-application\fR
.RS 4
Whether to minimize windows into their application icon\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.mouse\-over\-hilite\-stack\fR
.RS 4
Enable highlight hover effect for the grid view of a stack in the Dock\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.mru\-spaces\fR
.RS 4
Whether to automatically rearrange spaces based on most recent use\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.orientation\fR
.RS 4
Position of the dock on screen\&. The default is \[u201C]bottom\[u201D]\&.
.sp
\fIType:\fR null or one of \[u201C]bottom\[u201D], \[u201C]left\[u201D], \[u201C]right\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.persistent\-apps\fR
.RS 4
Persistent applications in the dock\&.
.sp
\fIType:\fR null or (list of (path or string))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq/Applications/Safari\&.app\(dq
  \(dq/System/Applications/Utilities/Terminal\&.app\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.persistent\-others\fR
.RS 4
Persistent folders in the dock\&.
.sp
\fIType:\fR null or (list of (path or string))
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  \(dq\(ti/Documents\(dq
  \(dq\(ti/Downloads\(dq
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.show\-process\-indicators\fR
.RS 4
Show indicator lights for open applications in the Dock\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.show\-recents\fR
.RS 4
Show recent applications in the dock\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.showhidden\fR
.RS 4
Whether to make icons of hidden applications tranclucent\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.static\-only\fR
.RS 4
Show only open applications in the Dock\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.tilesize\fR
.RS 4
Size of the icons in the dock\&. The default is 64\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.wvous\-bl\-corner\fR
.RS 4
Hot corner action for bottom left corner\&. Valid values include:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq1\(cq\fP: Disabled
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq2\(cq\fP: Mission Control
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq3\(cq\fP: Application Windows
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq4\(cq\fP: Desktop
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq5\(cq\fP: Start Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq6\(cq\fP: Disable Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq7\(cq\fP: Dashboard
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq10\(cq\fP: Put Display to Sleep
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq11\(cq\fP: Launchpad
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq12\(cq\fP: Notification Center
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq13\(cq\fP: Lock Screen
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq14\(cq\fP: Quick Note
.RE
.sp
\fIType:\fR null or (positive integer, meaning >0)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.wvous\-br\-corner\fR
.RS 4
Hot corner action for bottom right corner\&. Valid values include:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq1\(cq\fP: Disabled
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq2\(cq\fP: Mission Control
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq3\(cq\fP: Application Windows
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq4\(cq\fP: Desktop
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq5\(cq\fP: Start Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq6\(cq\fP: Disable Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq7\(cq\fP: Dashboard
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq10\(cq\fP: Put Display to Sleep
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq11\(cq\fP: Launchpad
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq12\(cq\fP: Notification Center
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq13\(cq\fP: Lock Screen
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq14\(cq\fP: Quick Note
.RE
.sp
\fIType:\fR null or (positive integer, meaning >0)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.wvous\-tl\-corner\fR
.RS 4
Hot corner action for top left corner\&. Valid values include:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq1\(cq\fP: Disabled
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq2\(cq\fP: Mission Control
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq3\(cq\fP: Application Windows
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq4\(cq\fP: Desktop
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq5\(cq\fP: Start Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq6\(cq\fP: Disable Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq7\(cq\fP: Dashboard
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq10\(cq\fP: Put Display to Sleep
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq11\(cq\fP: Launchpad
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq12\(cq\fP: Notification Center
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq13\(cq\fP: Lock Screen
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq14\(cq\fP: Quick Note
.RE
.sp
\fIType:\fR null or (positive integer, meaning >0)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.dock\&.wvous\-tr\-corner\fR
.RS 4
Hot corner action for top right corner\&. Valid values include:
.sp
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq1\(cq\fP: Disabled
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq2\(cq\fP: Mission Control
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq3\(cq\fP: Application Windows
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq4\(cq\fP: Desktop
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq5\(cq\fP: Start Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq6\(cq\fP: Disable Screen Saver
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq7\(cq\fP: Dashboard
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq10\(cq\fP: Put Display to Sleep
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq11\(cq\fP: Launchpad
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq12\(cq\fP: Notification Center
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq13\(cq\fP: Lock Screen
.RE
.RS 4
\h'-2'\fB\[u2022]\fP\h'1'\c
\fR\(oq14\(cq\fP: Quick Note
.RE
.sp
\fIType:\fR null or (positive integer, meaning >0)
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/dock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.AppleShowAllExtensions\fR
.RS 4
Whether to always show file extensions\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.AppleShowAllFiles\fR
.RS 4
Whether to always show hidden files\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.CreateDesktop\fR
.RS 4
Whether to show icons on the desktop or not\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.FXDefaultSearchScope\fR
.RS 4
Change the default search scope\&. Use \[u201C]SCcf\[u201D] to default to current folder\&. The default is unset (\[u201C]This Mac\[u201D])\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.FXEnableExtensionChangeWarning\fR
.RS 4
Whether to show warnings when change the file extension of files\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.FXPreferredViewStyle\fR
.RS 4
Change the default finder view\&. \[u201C]icnv\[u201D] = Icon view, \[u201C]Nlsv\[u201D] = List view, \[u201C]clmv\[u201D] = Column View, \[u201C]Flwv\[u201D] = Gallery View The default is icnv\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.QuitMenuItem\fR
.RS 4
Whether to allow quitting of the Finder\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.ShowPathbar\fR
.RS 4
Show path breadcrumbs in finder windows\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&.ShowStatusBar\fR
.RS 4
Show status bar at bottom of finder windows with item/disk space stats\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.finder\&._FXShowPosixPathInTitle\fR
.RS 4
Whether to show the full POSIX filepath in the window title\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/finder\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.DisableConsoleAccess\fR
.RS 4
Disables the ability for a user to access the console by typing \[u201C]>console\[u201D] for a username at the login window\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.GuestEnabled\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Allow users to login to the machine as guests using the Guest account\&. Default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.LoginwindowText\fR
.RS 4
Text to be shown on the login window\&. Default is \[u201C]\e\eU03bb\[u201D]\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.PowerOffDisabledWhileLoggedIn\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
If set to true, the Power Off menu item will be disabled when the user is logged in\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.RestartDisabled\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Hides the Restart button on the login screen\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.RestartDisabledWhileLoggedIn\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Disables the \[u201C]Restart\[u201D] option when users are logged in\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.SHOWFULLNAME\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Displays login window as a name and password field instead of a list of users\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.ShutDownDisabled\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Hides the Shut Down button on the login screen\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.ShutDownDisabledWhileLoggedIn\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Disables the \[u201C]Shutdown\[u201D] option when users are logged in\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.SleepDisabled\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Hides the Sleep button on the login screen\&. Default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.loginwindow\&.autoLoginUser\fR
.RS 4
Apple menu > System Preferences > Users and Groups > Login Options
.sp
Auto login the supplied user on boot\&. Default is Off\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/loginwindow\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.magicmouse\&.MouseButtonMode\fR
.RS 4
\[u201C]OneButton\[u201D]: any tap is a left click\&. \[u201C]TwoButton\[u201D]: allow left\- and right\-clicking\&.
.sp
\fIType:\fR null or one of \[u201C]OneButton\[u201D], \[u201C]TwoButton\[u201D]
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/magicmouse\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.menuExtraClock\&.IsAnalog\fR
.RS 4
Show an analog clock instead of a digital one\&. Default is null\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/clock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.menuExtraClock\&.Show24Hour\fR
.RS 4
Show a 24\-hour clock, instead of a 12\-hour clock\&. Default is null\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/clock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.menuExtraClock\&.ShowAMPM\fR
.RS 4
Show the AM/PM label\&. Useful if Show24Hour is false\&. Default is null\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/clock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.menuExtraClock\&.ShowDate\fR
.RS 4
Show the full date\&. Default is null\&.
.sp
0 = When space allows 1 = Always 2 = Never
.sp
\fIType:\fR null or one of 0, 1, 2
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/clock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.menuExtraClock\&.ShowDayOfMonth\fR
.RS 4
Show the day of the month\&. Default is null\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/clock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.menuExtraClock\&.ShowDayOfWeek\fR
.RS 4
Show the day of the week\&. Default is null\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/clock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.menuExtraClock\&.ShowSeconds\fR
.RS 4
Show the clock with second precision, instead of minutes\&. Default is null\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/clock\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.screencapture\&.disable\-shadow\fR
.RS 4
Disable drop shadow border around screencaptures\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/screencapture\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.screencapture\&.location\fR
.RS 4
The filesystem path to which screencaptures should be written\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/screencapture\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.screencapture\&.show\-thumbnail\fR
.RS 4
Show thumbnail after screencapture before writing to file\&. The default is true\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/screencapture\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.screencapture\&.type\fR
.RS 4
The image format to use, such as \[u201C]jpg\[u201D]\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/screencapture\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.screensaver\&.askForPassword\fR
.RS 4
If true, the user is prompted for a password when the screen saver is unlocked or stopped\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/screensaver\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.screensaver\&.askForPasswordDelay\fR
.RS 4
The number of seconds to delay before the password will be required to unlock or stop the screen saver (the grace period)\&.
.sp
\fIType:\fR null or signed integer
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/screensaver\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.smb\&.NetBIOSName\fR
.RS 4
Hostname to use for NetBIOS\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/smb\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.smb\&.ServerDescription\fR
.RS 4
Hostname to use for sharing services\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/smb\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.spaces\&.spans\-displays\fR
.RS 4
Apple menu > System Preferences > Mission Control
.sp
Displays have separate Spaces (note a logout is required before this setting will take effect)\&.
.sp
false = each physical display has a separate space (Mac default) true = one space spans across all physical displays
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/spaces\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.ActuationStrength\fR
.RS 4
0 to enable Silent Clicking, 1 to disable\&. The default is 1\&.
.sp
\fIType:\fR null or one of 0, 1
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.Clicking\fR
.RS 4
Whether to enable trackpad tap to click\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.Dragging\fR
.RS 4
Whether to enable tap\-to\-drag\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.FirstClickThreshold\fR
.RS 4
For normal click: 0 for light clicking, 1 for medium, 2 for firm\&. The default is 1\&.
.sp
\fIType:\fR null or one of 0, 1, 2
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.SecondClickThreshold\fR
.RS 4
For force touch: 0 for light clicking, 1 for medium, 2 for firm\&. The default is 1\&.
.sp
\fIType:\fR null or one of 0, 1, 2
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.TrackpadRightClick\fR
.RS 4
Whether to enable trackpad right click\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.TrackpadThreeFingerDrag\fR
.RS 4
Whether to enable three finger drag\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.trackpad\&.TrackpadThreeFingerTapGesture\fR
.RS 4
0 to disable three finger tap, 2 to trigger Look up & data detectors\&. The default is 2\&.
.sp
\fIType:\fR null or one of 0, 2
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/trackpad\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.universalaccess\&.closeViewScrollWheelToggle\fR
.RS 4
Use scroll gesture with the Ctrl (\(ha) modifier key to zoom\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/universalaccess\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.universalaccess\&.closeViewZoomFollowsFocus\fR
.RS 4
Follow the keyboard focus while zoomed in\&. Without setting \fR\(oqcloseViewScrollWheelToggle\(cq\fP this has no effect\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/universalaccess\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.universalaccess\&.mouseDriverCursorSize\fR
.RS 4
Set the size of cursor\&. 1 for normal, 4 for maximum\&. The default is 1\&.
.sp
\fIType:\fR null or floating point number
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR 1\&.5
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/universalaccess\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.universalaccess\&.reduceMotion\fR
.RS 4
Disable animation when switching screens or opening apps
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/universalaccess\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.defaults\&.universalaccess\&.reduceTransparency\fR
.RS 4
Disable transparency in the menu bar and elsewhere\&. Requires macOS Yosemite or later\&. The default is false\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/defaults/universalaccess\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.keyboard\&.enableKeyMapping\fR
.RS 4
Whether to enable keyboard mappings\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/keyboard\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.keyboard\&.nonUS\&.remapTilde\fR
.RS 4
Whether to remap the Tilde key on non\-us keyboards\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/keyboard\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.keyboard\&.remapCapsLockToControl\fR
.RS 4
Whether to remap the Caps Lock key to Control\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/keyboard\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.keyboard\&.remapCapsLockToEscape\fR
.RS 4
Whether to remap the Caps Lock key to Escape\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/keyboard\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.keyboard\&.swapLeftCommandAndLeftAlt\fR
.RS 4
Whether to swap the left Command key and left Alt key\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/keyboard\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.keyboard\&.swapLeftCtrlAndFn\fR
.RS 4
Whether to swap the left Control key and Fn (Globe) key\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/keyboard\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.nixpkgsRelease\fR
.RS 4
The nixpkgs release (e\&.g\&. \fR\(oq16\&.03\(cq\fP)\&.
.sp
\fIType:\fR string \fI(read only)\fR
.sp
\fIDefault:\fR \(dq24\&.11\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/version\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.patches\fR
.RS 4
Set of patches to apply to \fI/\fP\&.
.sp
.RS 4
\fBWarning\fP
.br
This can modify everything so use with caution\&.
.RE
.sp
Useful for safely changing system files\&. Unlike the etc module this won\[u2019]t remove or modify files with unexpected content\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR
.sp
.RS 4
.nf
[
  (pkgs\&.writeText \(dqbashrc\&.patch\(dq \(aq\(aq\(aq
    \-\-\- a/etc/bashrc
    +++ b/etc/bashrc
    @@ \-8,3 +8,5 @@
     shopt \-s checkwinsize

     [ \-r \(dq/etc/bashrc_$TERM_PROGRAM\(dq ] && \&. \(dq/etc/bashrc_$TERM_PROGRAM\(dq
    +
    +if test \-e /etc/static/bashrc; then \&. /etc/static/bashrc; fi
  \(aq\(aq\(aq)
]
.fi
.RE
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/patches\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.profile\fR
.RS 4
Profile to use for the system\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/nix/var/nix/profiles/system\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system>\fP
.RE
.RE
.PP
\fBsystem\&.startup\&.chime\fR
.RS 4
Whether to enable the startup chime\&.
.sp
By default, this option does not affect your system configuration in any way\&. However, this means that after it has been set once, unsetting it will not return to the old behavior\&. It will allow the setting to be controlled in System Settings, though\&.
.sp
\fIType:\fR null or boolean
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/startup\&.nix>\fP
.RE
.RE
.PP
\fBsystem\&.stateVersion\fR
.RS 4
Every once in a while, a new NixOS release may change configuration defaults in a way incompatible with stateful data\&. For instance, if the default version of PostgreSQL changes, the new version will probably be unable to read your existing databases\&. To prevent such breakage, you can set the value of this option to the NixOS release with which you want to be compatible\&. The effect is that NixOS will option defaults corresponding to the specified release (such as using an older version of PostgreSQL)\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 4
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/system/version\&.nix>\fP
.RE
.RE
.PP
\fBtime\&.timeZone\fR
.RS 4
The time zone used when displaying times and dates\&. See \fBhttps://en\&.wikipedia\&.org/wiki/List_of_tz_database_time_zones\fR[1]\fR or run \fBsudo systemsetup \-listtimezones\fP for a comprehensive list of possible values for this setting\&.
.sp
\fIType:\fR null or string
.sp
\fIDefault:\fR null
.sp
\fIExample:\fR \(dqAmerica/New_York\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/time>\fP
.RE
.sp
.RS 4
\h'-3'\fB1\&.\fP\h'1'\c
https://en\&.wikipedia\&.org/wiki/List_of_tz_database_time_zones
.RE
.RE
.PP
\fBusers\&.groups\fR
.RS 4
Configuration for groups\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.groups\&.<name>\&.description\fR
.RS 4
The group\[u2019]s description\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.groups\&.<name>\&.gid\fR
.RS 4
The group\[u2019]s GID\&.
.sp
\fIType:\fR signed integer
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.groups\&.<name>\&.members\fR
.RS 4
The group\[u2019]s members\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.groups\&.<name>\&.name\fR
.RS 4
The group\[u2019]s name\&. If undefined, the name of the attribute set will be used\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.knownGroups\fR
.RS 4
List of groups owned and managed by nix\-darwin\&. Used to indicate what users are safe to create/delete based on the configuration\&. Don\[u2019]t add system groups to this\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.knownUsers\fR
.RS 4
List of users owned and managed by nix\-darwin\&. Used to indicate what users are safe to create/delete based on the configuration\&. Don\[u2019]t add the admin user or other system users to this\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\fR
.RS 4
Configuration for users\&.
.sp
\fIType:\fR attribute set of (submodule)
.sp
\fIDefault:\fR { }
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.packages\fR
.RS 4
The set of packages that should be made availabe to the user\&. This is in contrast to \fBenvironment\&.systemPackages\fP, which adds packages to all users\&.
.sp
\fIType:\fR list of package
.sp
\fIDefault:\fR [ ]
.sp
\fIExample:\fR [ pkgs\&.firefox pkgs\&.thunderbird ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.createHome\fR
.RS 4
Create the home directory when creating the user\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR false
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.description\fR
.RS 4
A short description of the user account, typically the user\[u2019]s full name\&.
.sp
\fIType:\fR string
.sp
\fIDefault:\fR \(dq\(dq
.sp
\fIExample:\fR \(dqAlice Q\&. User\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.gid\fR
.RS 4
The user\[u2019]s primary group\&.
.sp
\fIType:\fR signed integer
.sp
\fIDefault:\fR 20
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.home\fR
.RS 4
The user\[u2019]s home directory\&.
.sp
\fIType:\fR path
.sp
\fIDefault:\fR \(dq/var/empty\(dq
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.isHidden\fR
.RS 4
Whether to make the user account hidden\&.
.sp
\fIType:\fR boolean
.sp
\fIDefault:\fR true
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.name\fR
.RS 4
The name of the user account\&. If undefined, the name of the attribute set will be used\&.
.sp
\fIType:\fR string
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.openssh\&.authorizedKeys\&.keyFiles\fR
.RS 4
A list of files each containing one OpenSSH public key that should be added to the user\[u2019]s authorized keys\&. The contents of the files are read at build time and added to a file that the SSH daemon reads in addition to the the user\[u2019]s authorized_keys file\&. You can combine the \fR\(oqkeyFiles\(cq\fP and \fR\(oqkeys\(cq\fP options\&.
.sp
\fIType:\fR list of path
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.openssh\&.authorizedKeys\&.keys\fR
.RS 4
A list of verbatim OpenSSH public keys that should be added to the user\[u2019]s authorized keys\&. The keys are added to a file that the SSH daemon reads in addition to the the user\[u2019]s authorized_keys file\&. You can combine the \fR\(oqkeys\(cq\fP and \fR\(oqkeyFiles\(cq\fP options\&. Warning: If you are using \fR\(oqNixOps\(cq\fP then don\[u2019]t use this option since it will replace the key required for deployment via ssh\&.
.sp
\fIType:\fR list of string
.sp
\fIDefault:\fR [ ]
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/programs/ssh>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.shell\fR
.RS 4
The user\[u2019]s shell\&.
.sp
\fIType:\fR package or path
.sp
\fIDefault:\fR \(dq/sbin/nologin\(dq
.sp
\fIExample:\fR pkgs\&.bashInteractive
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.PP
\fBusers\&.users\&.<name>\&.uid\fR
.RS 4
The user\[u2019]s UID\&.
.sp
\fIType:\fR signed integer
.sp
\fIDeclared by:\fP
.RS 4
\fB<nix\-darwin/modules/users>\fP
.RE
.RE
.SH "AUTHORS"
.PP
Daiderd Jordan and the nix-darwin contributors